Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: <p>Thumbnail image size. Changing the thumbnail size here triggers a rebuild of the thumbnail database.</p>
ar: <p>حجم صورة الصورة المصغرة. يؤدي تغيير حجم الصورة المصغرة هنا إلى إعادة إنشاء قاعدة بيانات الصور المصغرة.</p>
lv: <p>Sīktēlu attēla izmērs. Sīktēlu izmēra izmainīšana liks programmai pārbūvēt visu sīktēlu datubāzi.</p>

source: <p>If this is set, thumbnails are built on demand. As you browse your image database, only those thumbnails that are needed are actually built. This means that when you change the thumbnail size, KPhotoAlbum will remain responsive even if you have lots of images.</p><p>If this is not set, KPhotoAlbum will always build the thumbnails for all images as soon as possible. This means that when new images are found, KPhotoAlbum will immediately build thumbnails for them and you won't have a delay later while browsing.</p>
ar: <p>إذا ضُبط هذا، تُبنى الصور المصغرة عند الطلب. أثناء تصفحك لقاعدة بيانات الصور، تُبنى فقط الصور المصغرة المطلوبة فعليًا. هذا يعني أنه عند تغيير حجم الصورة المصغرة، سيبقى دفتر الصور مستجيبًا حتى إذا كان لديك الكثير من الصور.</p><p>إذا لم يُضبط هذا، سيُبنى دائمًا الصور المصغرة لجميع الصور في أقرب وقت ممكن. هذا يعني أنه عند العثور على صور جديدة، سيُبنى فورًا الصور المصغرة لها ولن يكون هناك تأخير لاحقًا أثناء التصفح.</p>
lv: <p>Šo ieslēdzot, sīktēlu tiks būvēti pēc pieprasījuma. Pārlūkojot attēlu datubāzi, sīktēli tiks būvēti tikai attēliem, kuriem tie nepieciešami. Tas nozīmē, ka, ja izmainīsiet sīktēlu izmēru, „KPhotoAlbum“ turpinās reaģēt uz darbībām arī tad, ja datubāzē ir daudz attēlu.</p><p>Ja nav norādīts, „KPhotoAlbum“ vienmēr būvēs sīktēlus visiem attēliem tiklīdz tas būs iespējams. Tas nozīme, ka, atrodot jaunus attēlus, „KPhotoAlbum“ nekavējoties tiem būvēs sīktēlus, laik vēlāk, pārlūkojot attēlus, nebūtu aiztures.</p>

source: <p>Choose what aspect ratio the cells holding thumbnails should have.</p>
ar: <p>اختر نسبة الأبعاد التي يجب أن تمتلكها الخلايا التي تحمل الصور المصغرة.</p>
lv: <p>Izvēlieties malu attiecību šūnām, kurās tiks iezīmēti sīktēli.</p>

source: <p>How thick the cell padding should be.</p>
ar: <p>ما مدى سماكة الحشو حول الخلايا.</p>
lv: <p>Cik biežām jābūt šūnu malām.</p>

source: <p>If you want to see grid around your thumbnail images, select this option.</p>
ar: <p>إذا أردت رؤية شبكة حول صورك المصغرة، فحدد هذا الخيار.</p>
lv: <p>Izvēlieties šo opciju, ja vēlaties ap sīktēliem redzēt režģi.</p>

source: <p>Checking this option will show the base name for the file under thumbnails in the thumbnail view.</p>
ar: <p>سيؤدي تحديد هذا الخيار إلى عرض الاسم الأساسي للملف تحت الصور المصغرة في عرض الصور المصغرة.</p>
lv: <p>Šīs opcijas atzīmēšana sīktēlu skatā zem sīktēliem parādīs datnes pamata nosaukumu.</p>

source: <p>Checking this option will show the Categories for the file under thumbnails in the thumbnail view</p>
ar: <p>سيؤدي تحديد هذا الخيار إلى عرض الفئات للملف تحت الصور المصغرة في عرض الصور المصغرة</p>
lv: <p>Atzīmējot šo opciju, sīktēlu skatā zem sīktēliem būs redzamas datņu kategorijas</p>

source: <p>When you are browsing, and the count gets below the value specified here, the thumbnails will be shown automatically. The alternative is to continue showing the browser until you press <i>Show Images</i></p>
ar: <p>عند التصفح، وإذا انخفض العدد إلى أقل من القيمة المحددة هنا، فستُعرض الصور المصغرة آليًا. البديل هو الاستمرار في عرض المتصفح حتى تضغط على <i>عرض الصور</i></p>
lv: <p>Kad pārlūkosiet attēlus un to skaits būs zem te norādītā, sīktēlu tiks parādīti automātiski. Alternatīva ir turpināt rādīt pārlūku līdz nospiežat <i>Rādīt attēlus</i></p>

source: If a tag is selected here, it will be added to new (untagged) images automatically, so that they can be easily found. It will be removed as soon as the image has been annotated.
ar: إذا وُضع وسم هنا، فسيُضاف آليًا إلى الصور الجديدة (غير الموسومة)، حتى يمكن العثور عليها بسهولة. سيُزال بمجرد وضع شرح على الصورة.
lv: Te atlasot birku, tā tiks automātiski pievienota jauniem (nebirkotiem) attēliem, lai tos būtu vieglāk atrast. Tā tiks noņemta tiklīdz attēls būs anotēts.

source: Show the untagged images tag as a normal tag
ar: اعرض وسم الصور غير الموسومة كوسم عادي
lv: Nebirkoto attēlu birku rādīt kā normālu birku

source: None Selected
ar: غير محدد
lv: Nekas nav atlasīts

source: New tag added
ar: أُضيف وسم جديد
lv: Pievienota jauna birka

source: <p>The new tag "%1" has been added to the category "%2" and will be used for untagged images now.</p><p>Please save now, so that this tag will be stored in the database. Otherwise, it will be lost, and you will get an error about this tag being not present on the next start.</p>
ar: <p>أُضيف الوسم الجديد "%1" إلى الفئة "%2" وسيُستخدم الآن للصور غير الموسومة.</p><p>يُرجى الحفظ الآن، حتى يُخزن هذا الوسم في قاعدة البيانات. وإلا فسيضيع، وستظهر رسالة خطأ تفيد بعدم وجود هذا الوسم عند البدء التالي.</p>
lv: <p>Jaunā birka „%1“ ir pievienota „%2“ kategorijai un tiks izmantota attēliem bez birkām.</p><p>Saglabājiet darbu, lai šī birka tiktu saglabāta datubāzē. Pretējā gadījumā tā būs pazudusi un, nākamreiz palaižot programmu, jūs saņemsit kļūdu par to, ka šī birka nepastāv.</p>

source: <h1>Choose a Video Player</h1>
ar: <h1>اختر مشغل فيديو</h1>
lv: <h1>Izvēlieties video atskaņotāju</h1>

source: (NOT AVAILABLE)
ar: (غير متوفّر)
lv: (NAV PIEEJAMS)

source: <html><h1>Missing back-end</h1>The back-ends which are not available are due to the system configuration at compile time of KPhotoAlbum. If you compiled KPhotoAlbum yourself, then search for the developer packages of the back-ends. If you on the other hand got KPhotoAlbum from your system, then please talk to the maintainer of the package.</html>
ar: <html><h1>وحدة خلفية مفقودة</h1>الوحدات الخلفية غير المتوفرة تعود إلى ضبط النظام في وقت تجميع دفتر الصور. إذا قمت بتجميع دفتر الصور بنفسك، فابحث عن حزم المطور للوحدات الخلفية. إذا حصلت على دفتر الصور من نظامك، فيُرجى التحدث إلى مشغل الحزمة.</html>
lv: <html><h1>Trūkst aizmugursistēmas</h1>Aizmugursistēmas, kas nav pieejamas, tādas ir sistēmas konfigurācijas dēļ laikā, kad „KPhotoAlbum“ tika kompilēts. Ja „KPhotoAlbum“ kompilējāt saviem spēkiem, meklējiet izstrādātāju pakotnes aizmugursistēmām. Ja, no otras puses, „KPhotoAlbum“ instalējāt no sistēmas, tad sazinieties ar pakotnes uzturētāju.</html>

# A friendly name for the video backend
source: Unconfigured video backend
ar: وحدة خلفية للفيديو غير مضبوطة
lv: Nekonfigurēta video aizmugursistēma

# A friendly name for the video backend
source: Phonon video backend
ar: الوحدة الخلفية Phonon للفيديو
lv: „Phonon“ video aizmugursistēma

# A friendly name for the video backend
source: QtAV video backend
ar: الوحدة الخلفية QtAV للفيديو
lv: „QtAV“ video aizmugursistēma

# A friendly name for the video backend
source: VLC video backend
ar: الوحدة الخلفية VLC للفيديو
lv: VLC video aizmugursistēma

source: Not Configured
ar: غير مضبوط
lv: Nav konfigurēta

source: Running Slide Show From Thumbnail View
ar: يشغل عرض الشرائح من عرض المصغرات
lv: Slīdrādes paišana no sīktēlu skata

source: Viewing Images and Videos From Thumbnail View
ar: مشاهدة الصور و المرئيات من عرض المصغرات
lv: Attēlu un video apskate no sīktēlu skata

source: Slideshow interval:
ar: فترة عرض الشرائح:
lv: Slīdrādes intervāls:

source: sec
ar: ثوان
lv: sek.

source: Image cache:
ar: خبيئة الصورة:
lv: Attēlu kešatmiņa:

source: Mbytes
ar: م. بايت
lv: megabaiti

source: Standard size in viewer:
ar: القياس المعياري في المستعرض:
lv: Standarta izmērs skatītājā:

source: Full Viewer Size
ar: قياس المستعرض الكامل
lv: Pilns skatītāja izmērs

source: Natural Image Size
ar: قياس الصورة الطبيعي
lv: Dabīgais attēla izmērs

source: Natural Image Size If Possible
ar: قياس الصورة الطبيعي إن أمكن
lv: Dabīgais attēla izmērs, ja iespējams

source: <p>Set the standard size for images to be displayed in the viewer.</p> <p><b>Full Viewer Size</b> indicates that the image will be stretched or shrunk to fill the viewer window.</p> <p><b>Natural Image Size</b> indicates that the image will be displayed pixel for pixel.</p> <p><b>Natural Image Size If Possible</b> indicates that the image will be displayed pixel for pixel if it would fit the window, otherwise it will be shrunk to fit the viewer.</p>
ar: <p>اضبط الحجم القياسي للصور لتُعرض في العارض.</p> <p>يشير <b>حجم العارض الكامل</b> إلى أن الصورة ستُمدد أو تُصغر لملء نافذة العارض.</p> <p>يشير <b>الحجم الطبيعي للصورة</b> إلى أن الصورة ستُعرض بكسلا بكسلا.</p> <p>يشير <b>الحجم الطبيعي للصورة إذا أمكن</b> إلى أن الصورة ستُعرض بكسلا بكسلا إذا كانت مناسبة للنافذة، وإلا فستُصغر لتناسب العارض.</p>
lv: <p>Norādīt skatītājā parādāmo attēlu standarta izmēru.</p> <p><b>Pilns skatītāja izmērs</b> nozīmē, ka attēls tiks izstiepts vai saspiests, lai to ietilpinātu skatītāja logā.</p> <p><b>Dabīgais attēla izmērs</b> nozīmē, ka attēls tiks parādīts pikseli pret pikseli.</p> <p><b>Dabīgais attēla izmērs, ja iespējams</b> nozīmē, ka attēls tiks parādīts pikseli pret pikseli, ja tas ietilps logā, bet pretējā gadījumā tas tiks saspiests, lai ietilptu skatītājā.</p>

source: Scaling algorithm:
ar: خوارزمية التحجيم:
lv: Mērogošanas algoritms:

source: Fastest
ar: الأسرع
lv: Ātrākais

source: Best
ar: الأحسن
lv: Labākais

source: <p>When displaying images, KPhotoAlbum normally performs smooth scaling of the image. If this option is not set, KPhotoAlbum will use a faster but less smooth scaling method.</p>
ar: <p>عند عرض الصور، يجري دفتر الصور عادةً تحجيم سلس للصورة. إذا لم يُضبط هذا الخيار، فسيستخدم دفتر الصور طريقة تحجيم أسرع ولكن أقل سلاسة.</p>
lv: <p>Parādot attēlus, „KPhotoAlbum“ parasti veic attēlu līdzeno mērogošanu. Ja šī opcija nav ieslēgta, „KPhotoAlbum“ izmanto ātrāku, bet mazāk viendabīgu metodi.</p>

source: Video Backend:
ar: الوحدة الخلفية للفيديو:
lv: Video aizmugursistēma:

source: Launch in full screen
ar: أطلق في نمط ملء الشاشة
lv: Palaist pilnekrāna režīmā

source: video
ar: فيديو

# Name/title of the filter toolbar widget
source: Filter Toolbar
ar: شريط أدوات المرشح
lv: Filtrēšanas rīkjosla

# The action enables/disables filtering of images in the thumbnail view.
source: Toggle filter
ar: بدّل المرشح
lv: Pārslēgt filtru

source: Press <shortcut>Escape</shortcut> to clear filter.
ar: اضغط <shortcut>Escape</shortcut> لمحو المرشح.
lv: Spiediet <shortcut>Escape</shortcut> pogu, lai filtru notīrītu.

source: Filter view by rating: %1 star
ar: صفِّ العرض حسب التقييم: %1 نجمة
lv: Filtrēt skatu pēc reitinga: %1 zvaigzne

# The label gives a textual description of the active filter
source: Filter: %1
ar: المرشح: %1
lv: Filtrēt: %1

source: Tip: Use <shortcut>Alt+Shift+<placeholder>A-Z</placeholder></shortcut> to toggle a filter for that token.
ar: نصيحة: استخدم <shortcut>Alt+Shift+<placeholder>A-Z</placeholder></shortcut> لتبديل مرشح لذلك الرمز.
lv: Padoms: lai pārslēgtu filtru attiecīgajam marķierim, lietojiet <shortcut>Alt+Shift+<placeholder>A—Z</placeholder></shortcut>.

source: <p><b>Really reorder thumbnails?</b></p><p>By dragging images around in the thumbnail viewer, you actually reorder them. This is very useful where you do not know the exact date for the images. On the other hand, if the images have valid timestamps, you should use <b>Maintenance -&gt; Sort All By Date and Time</b> or <b>View -&gt; Sort Selected By Date and Time</b>.</p>
ar: <p><b>هل تعيد ترتيب الصور المصغرة حقًا؟</b></p><p>عن طريق سحب الصور فيعارض الصور المصغرة، فإنك تعيد ترتيبها فعليًا. هذا مفيد جدًا عندما لا تعرف التاريخ الدقيق للصور. من ناحية أخرى، إذا كانت الصور تحتوي على طوابع زمنية صالحة، فيجب استخدام <b>الصيانة -&gt; فرز الكل حسب التاريخ والوقت</b> أو <b>عرض -&gt; فرز المحدد حسب التاريخ والوقت</b>.</p>
lv: <p>Vai tiešām pārkārtot sīktēlus?</p><p>Velkot attēlus sīktēlu skatītājā, varat tos pārkārtot. Tas ir ļoti noderīgi, ja nezināt precīzu attēlu datumu. Tomēr, ja attēliem ir derīgi laika zīmogi, izmantojiet iespēju <b>Apkope—>Kārtot visu pēc datuma un laika</b> vai <b>Skatīt —&gt; Kārtot atlasīto pēc datuma un laika</b>.</p>

# @title
source: Reorder Thumbnails
ar: أعِد ترتيب الصور المصغرة
lv: Pārkārtot sīktēlus

source: Error Deleting Files
ar: خطأ في حذف الملفات
lv: Kļūda, dzēšot datnes

source: Unable to copy '%1' to '%2'.
ar: غير قادر على نسخ '%1' إلى '%2'.
lv: Neizdodas nokopēt „%1“ uz „%2“.

source: Unable to create folder '%1' needed for demo.
ar: تعذر إنشاء المجلد '%1' المطلوب للتجربة.
lv: Neizdodas izveidot datni „%1“, kas nepieciešama demonstrācijai.

source: <p>Could not locate the demo database in any of the following standard locations:</p><p>%1</p>
ar: <p>تعذر العثور على قاعدة بيانات التجربة في أي من المواقع القياسية التالية:</p><p>%1</p>
lv: <p>Neizdodas atrast demonstrācijas datubāzi nevienā no standarta vietām:</p><p>%1</p>

source: <b>File Name: </b>
ar: <b>اسم الملف: </b>
lv: <b>Datnes nosaukums: </b>

source: <b>Date: </b>
ar: <b>التاريخ: </b>
lv: <b>Datums: </b>

# short for: x megapixels
source: (%1MP)
ar: (%1م.بكسل)

source: <b>Image Size: </b>
ar: <b>قياس الصورة: </b>
lv: <b>Attēla izmērs: </b>

source: <b>Label: </b>
ar: <b>التسمية: </b>
lv: <b>Etiķete: </b>

source: <b>Description: </b>
ar: <b>الوصف: </b>
lv: <b>Apraksts: </b>

# Like "up to 6 years" old
source: (up to %1)
ar: (حتى %1)
lv: (līdz %1)

# Like "6 years to 7 years" old
source: (%1 to %2)
ar: (%1 إلى %2)
lv: (no %1 līdz %2)

# Like "The baby is '8 days' old"
source: %1 day
ar: %1 يوم
lv: %1 dienu

# Like "The baby is '4 months' old"
source: %1 month
ar: %1 شهر
lv: %1 mēnesi

# Like "The person is '28 years' old"
source: %1 year
ar: %1 سنة
lv: %1 gadu

# Like "The baby is "4 months" old"
source: %1 month
ar: شهر واحِد
lv: %1 mēnesi

source: (today)
ar: (اليوم)
lv: (šodien)

source: (yesterday)
ar: (الأمس)
lv: (vakar)

# Like "6 years ago"
source: (%1 ago)
ar: (منذ %1)
lv: (pirms %1)

# Like "6 to 7 years ago"
source: (%1 to %2 ago)
ar: (من %1 إلى %2 مضت)
lv: (pirms starp %1 un %2)

# Like "This happened '6 days' ago"
source: %1 day
ar: %1 يوم
lv: %1 dienas

# Like "This happened '3 weeks' ago"
source: %1 week
ar: أسبوع واحد
lv: %1 nedēļas

# Like "This happened 'ca. 6 weeks' ago"
source: ca. %1 week
ar: قرابة أسبوع واحد
lv: apt. %1 nedēļas

# Like "This happened '2 months' ago"
source: %1 month
ar: شهر واحِد
lv: %1 mēneša

# Like "This happened 'ca. 2 months' ago"
source: ca. %1 month
ar: قرابة شهر واحِد
lv: apt. %1 mēneša

# Like "This happened '2 years' ago"
source: %1 year
ar: %1 سنة
lv: %1 gada

source: %1 and %2
ar: %1 و%2
lv: %1 un %2

# @title
source: Assign Macro
ar: إسناد ماكرو
lv: Piešķirt makrokomandu

source: Select item for macro key <b>%1</b>
ar: اختر عنصرًا لمفتاح الماكرو <b>%1</b>
lv: Atlasiet vienumu makrokomandas atslēgai <b>%1</b>

source: Tag Item
ar: وسم العنصر
lv: Birkot vienumu

source: Select tag for image
ar: اختر وسمًا للصورة
lv: Atlasiet birku attēlam

# @title:window
source: Configure Category Image
ar: اضبط صورة الفئة
lv: Konfigurēt kategorijas attēlu

# @label:listbox As in 'select the tag category'
source: Category:
ar: الصنف:
lv: Kategorija:

# @label:listbox As in 'select a tag'
source: Tag:
ar: الوسم:
lv: Birka:

# @label The current category image
source: Current image:
ar: الصورة الحالية:
lv: Pašreizējais attēls:

# @label Preview of the new category imape
source: New image:
ar: صورة جديدة:
lv: Jaunais attēls:

# @action:button As in 'Set the category image'
source: Set
ar: عيّن
lv: Iestatīt

source: Insufficient color depth for this filter
ar: عمق اللون غير كافٍ لهذا المرشح
lv: Nepietiekams filtra krāsu dziļums

source: [ zoom x%1 ]
ar: [ كبّر x%1 ]
lv: [ tuvinājums ×%1 ]

source: Show the geographic position of this image on a map
ar: اعرض الموقع الجغرافي لهذه الصورة على الخريطة
lv: Rādīt kartē attēla ģeogrāfisko atrašanās vietu

source: Error playing media
ar: حدث خطأ أثناء تشغيل الوسائط
lv: Kļūda, atskaņojot multividi

source: Type name of category and item
ar: اكتب اسم الفئة والعنصر
lv: Ievadiet kategorijas un vienuma nosaukumu

source: Add New
ar: أضف جديدًا
lv: Pievienot jaunu

source: Key
ar: المفتاح
lv: Atslēga

source: Tag
ar: الوسم
lv: Birka

# @action:inmenu
source: Clear assignment
ar: امسح التعيين
lv: Notīrīt piešķiršanu

source: Dialog
ar: حواريّ
lv: Lodziņš

source: TextLabel
ar: تسمية نصّيّة
lv: Teksta etiķete

source: Add new Tag
ar: أضف وسمًا جديدًا
lv: Pievienot jaunu birku

source: Title
ar: العنوان
lv: Nosaukums

source: Existing Assignments
ar: التعيينات الموجودة
lv: Pastāvošie piešķīrumi

# @action:inmenu
source: Set as First Image in Stack
ar: اضبط كأول صورة في الكدس
lv: Iestatīt kā pirmo attēlu grēdā

# @action:inmenu
source: Copy image to ...
ar: انسخ الصورة إلى ...
lv: Kopēt attēlu uz...

# @action:inmenu
source: Link image to ...
ar: اربط الصورة بـ ...
lv: Saitēt attēlu uz...

# @action:inmenu
source: Close
ar: أغلق
lv: Aizvērt

# @title:inmenu
source: Rotate
ar: دوّر
lv: Pagriezt

# @action:inmenu
source: Rotate clockwise
ar: أدر باتجاه عقارب الساعة
lv: Pagriezt pulksteņrādītāja virzienā

# @action:inmenu
source: Flip Over
ar: اعكس
lv: Apmest

# @action:inmenu
source: Rotate counterclockwise
ar: أدر عكس عقارب الساعة
lv: Pagriezt pretēji pulksteņrādītājam

# @title:inmenu As in 'skip 2 images'
source: Skip
ar: تخطّى
lv: Izlaist

# @action:inmenu Go to first image
source: First
ar: الأول
lv: Pirmā

# @action:inmenu Go to last image
source: Last
ar: الأخير
lv: Pēdējā

# @action:inmenu
source: Show Next
ar: أظهر التالي
lv: Rādīt nākamo

# @action:inmenu
source: Skip 10 Forward
ar: تخطى 10 للأمام
lv: Iet 10 uz priekšu

# @action:inmenu
source: Skip 100 Forward
ar: تخطى 100 للأمام
lv: Iet 100 uz priekšu

# @action:inmenu
source: Skip 1000 Forward
ar: تخطى 1000 للأمام
lv: Iet 1000 uz priekšu

# @action:inmenu
source: Show Previous
ar: اعرض السابق
lv: Rādīt iepriekšējo

# @action:inmenu
source: Skip 10 Backward
ar: تخطى 10 للخلف
lv: Izlaist 10 atpakaļ

# @action:inmenu
source: Skip 100 Backward
ar: تخطى 100 للخلف
lv: Izlaist 100 atpakaļ

# @action:inmenu
source: Skip 1000 Backward
ar: تخطى 1000 للخلف
lv: Izlaist 1000 atpakaļ

# @action:inmenu
source: Delete Image
ar: احذف الصورة
lv: Dzēst attēlu

# @action:inmenu
source: Remove Image from Display List
ar: أزل الصورة من قائمة العرض
lv: Noņemt attēlu no parādāmā saraksta

# @action:inmenu
source: Zoom
ar: تكبير
lv: Tuvināšana

# @action:inmenu
source: Zoom In
ar: قرّب
lv: Tuvināt

# @action:inmenu
source: Zoom Out
ar: بعّد
lv: Tālināt

# @action:inmenu
source: Full View
ar: كامل العرض
lv: Pilns skats

# @action:inmenu
source: Pixel for Pixel View
ar: عرض بكسل لبكسل
lv: Pikselis pret pikseli skats

# @action:inmenu
source: Toggle Full Screen
ar: بدّل ملء الشّاشة
lv: Pārslēgt pilnekrānu

# @title:inmenu
source: Slideshow
ar: عرض الشرائح
lv: Slīdrāde

# @action:inmenu
source: Run Slideshow
ar: شغل عرض الشرائح
lv: Palaist slīdrādi

# @action:inmenu
source: Run Faster
ar: شغل أسرع
lv: Paātrināt

# @action:inmenu
source: Run Slower
ar: شغل أبطء
lv: Palēnināt

source: File not available
ar: الملفّ غير متوفّر
lv: Datne nav pieejama

# @action:inmenu Start video playback
source: Play
ar: شغّل
lv: Atskaņot

# @action:inmenu Pause video playback
source: Pause
ar: ألبث
lv: Pauzēt

source: locked
ar: مقفل
lv: slēgts

source: annotating
ar: يشرح
lv: anotēšana

source: tokenizing
ar: يرمّز
lv: žetonizēšana

source: Change display mode to %1
ar: غيّر نمط العرض إلى %1
lv: Mainīt parādīšanas režīmu uz „%1“

# OSD for slideshow
source: Ending Slideshow
ar: ينهي عرض الشرائح
lv: Pabeidz slīdrādi

# @action:inmenu
source: Stop Slideshow
ar: أوقف عرض الشرائح
lv: Apturēt slīdrādi

# OSD for slideshow
source: Starting Slideshow<br/>%1 makes the slideshow faster<br/>%2 makes the slideshow slower
ar: يبدأ عرض الشرائح<br/>%1 يجعل عرض الشرائح أسرع<br/>%2 يجعل عرض الشرائح أبطأ
lv: Sāk slīdrādi<br/>„%1“ slīdrādi paātrina<br/>„%2“ palēnina slīdrādi

# OSD for slideshow, num of seconds per image
source: %1&nbsp;s
ar: %1&nbsp;ث
lv: %1&nbsp;sek.

# @title
source: Edit Image Description
ar: حرر وصف الصورة
lv: Rediģēt attēla aprakstu

# @label:textbox
source: Image Description
ar: وصف صورة
lv: Attēla apraksts

# @title:inmenu
source: Seek
ar: اطلب
lv: Pārlēkt

# @action:inmenu
source: 10 minutes backward
ar: ارجع 10 دقائق للخلف
lv: 10 minūšu atpakaļ

# @action:inmenu
source: 1 minute backward
ar: ارجع دقيقة واحدة للخلف
lv: 1 minūti atpakaļ

# @action:inmenu
source: 10 seconds backward
ar: ارجع 10 ثوان للخلف
lv: 10 sekunžu atpakaļ

# @action:inmenu
source: 1 seconds backward
ar: ارجع ثانية واحدة للخلف
lv: 1 sekundi atpakaļ

# @action:inmenu
source: 100 milliseconds backward
ar: ارجع 100 ميلي ثانية للخلف
lv: 100 milisekunžu atpakaļ

# @action:inmenu
source: 100 milliseconds forward
ar: تقدم 100 ميلي ثانية للأمام
lv: 100 milisekunžu uz priekšu

# @action:inmenu
source: 1 seconds forward
ar: تقدم ثانية واحدة للأمام
lv: 1 sekundi uz priekšu

# @action:inmenu
source: 10 seconds forward
ar: تقدم 10 ثوان للأمام
lv: 10 sekunžu uz priekšu

# @action:inmenu
source: 1 minute forward
ar: تقدم دقيقة واحدة للأمام
lv: 1 minūti uz priekšu

# @action:inmenu
source: 10 minutes forward
ar: تقدم 10 دقائق للأمام
lv: 10 minūšu uz priekšu

# @action:inmenu Stop video playback
source: Stop
ar: أوقف
lv: Apturēt

# @action:inmenu
source: Use current frame in thumbnail view
ar: استخدم الإطار الحالي في عرض الصور المصغرة
lv: Izmantot pašreizējo kadru sīktēla skatam

# @action:inmenu Restart video playback.
source: Restart
ar: أعد التّشغيل
lv: Pārstartēt

# @title:inmenu
source: Filters
ar: المرشّحات
lv: Filtri

# @action:inmenu
source: Remove All Filters
ar: أزِل جميع المرشحات
lv: Noņemt visus filtrus

# @action:inmenu
source: Apply Grayscale Filter
ar: طبّق مرشح التدرج الرمادي
lv: Pielietot pelēktoņu filtru

# @action:inmenu
source: Apply Contrast Stretching Filter
ar: طبّق مرشح تمدد التباين
lv: Pielietot kontrasta izstiepšanas filtru

# @action:inmenu
source: Apply Histogram Equalization Filter
ar: طبّق مرشح معادلة المدرج التكراري
lv: Pielietot histogrammas izlīdzināšanas filtru

# @action:inmenu
source: Apply Monochrome Filter
ar: طبّق مرشح أحادي اللون
lv: Pielietot vienas krāsas filtru

source: <p>It seems that KPhotoAlbum previously crashed during video playback. On some platforms, this is a common problem with some video players.</p><p>Press <i>Continue</i> to let KPhotoAlbum try a different backend...</p>
ar: <p>يبدو أن دفتر الصور تعطل سابقًا أثناء تشغيل الفيديو. في بعض المنصات، هذه مشكلة شائعة مع بعض مشغلات الفيديو.</p><p>اضغط على <i>متابعة</i> للسماح لـ دفتر الصور بتجربة واجهة خلفية مختلفة...</p>
lv: <p>Izskatās, ka „KPhotoAlbum“ iepriekš avarēja video atskaņošanas laikā. Dažās platformās tā ir bieža video atskaņotāju problēma.</p><p>Spiediet <i>Turpināt</i>, lai ļautu „KPhotoAlbum“ izmēģināt citu aizmugursistēmu...</p>

source: <p>Video backend that was interrupted: <tt>%1</tt></p><p>Video backend that will be used instead: <tt>%2</tt></p>
ar: <p>الواجهة الخلفية للفيديو التي تمت مقاطعتها: <tt>%1</tt></p><p>الواجهة الخلفية للفيديو التي ستُستخدم بدلاً من ذلك: <tt>%2</tt></p>
lv: <p>Apturētā video aizmugursistēma: <tt>%1</tt></p><p>Turpmāk izmantotā video aizmugursistēma: <tt>%2</tt></p>

source: <p>KPhotoAlbum has tried out all available video backends, but every one crashed at some point.</p><p>Crash detection is now turned off.</p>
ar: <p> جُرّبت جميع الواجهات الخلفية المتاحة للفيديو في دفتر الصور، ولكن كل منها تعطل في مرحلة ما.</p><p>أوقف كشف التعطيل الآن.</p>
lv: <p>„KPhotoAlbum“ ir izmēģinājis visas pieejamās video aizmugursistēmas, bet visas kādā brīdī ir avarējušas.</p><p>Avāriju konstatēšana tagad tiks izslēgta.</p>

source: Annotate
ar: اشرح
lv: Anotēt

# @action:inmenu
source: Help
ar: مساعدة
lv: Palīdzība

# @action:inmenu
source: Annotation Dialog
ar: حوار إضافة التعليق
lv: Anotācijas lodziņš

# @action:inmenu
source: Add tag
ar: أضف وسمًا
lv: Pievienot birku

# @action:inmenu
source: Copy Data from Previous Image
ar: انسخ البيانات من الصورة السابقة
lv: Kopēt datnes no iepriekšējā attēla

# @action:inmenu
source: Edit Description
ar: حرر الوصف
lv: Rediģēt aprakstu

source: Annotation Mode
ar: وضع الشرح
lv: Anotēšanas režīms
