Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

# @action:inmenu
source: Locked
ar: مقفل
lv: Slēgts

# @action:inmenu
source: Assign Tags
ar: عيّن الوسوم
lv: Piešķirt birkas

# @action:inmenu
source: Assign Tokens
ar: عيّن الرموز
lv: Piešķirt žetonus

source: Token %1
ar: الرّمز %1
lv: Žetons „%1“

source: Show...
ar: اعرض...
lv: Rādīt...

source: Show
ar: اعرض
lv: Rādīt

source: Show Info Box
ar: اعرض صندوق المعلومات
lv: Rādīt informācijas lodziņu

source: Show Label
ar: اعرض التسمية
lv: Rādīt etiķeti

source: Show Description
ar: اعرض الوصف
lv: Rādīt aprakstu

source: Show Date
ar: اعرض التاريخ
lv: Rādīt datumu

source: Show Time
ar: اعرض الوقت
lv: Rādīt laiku

source: Show Filename
ar: اعرض اسم الملف
lv: Rādīt datnes nosaukumu

source: Show Exif
ar: أظهر بيانات Exif
lv: Rādīt „Exif“

source: Show Image Size
ar: اعرض قياس الصورة
lv: Rādīt attēla izmēru

source: Show Rating
ar: أظهر التقييم
lv: Rādīt reitingu

source: Read Video Length
lv: Lasīt video garumu

source: file.kim
lv: datne.kim

source: Read Exif Info from Files...
lv: Nolasīt „Exif“ informāciju no datnēm...

source: <html><p>Unfortunately, there is no video player which just works out of the box for everyone.</p><p>KPhotoAlbum therefore comes with two different back-ends, choose the one that works the best for you</p><p><b>VLC</b> seems to be the best supported video player back-end, meaning it can play most video formats. It has one drawback though, it requires X11. If you use Wayland, then you will find that the videos shows up in a window of their own, and in this case VLC is likely not a very good fit for you. If on the other hand you do use X11 then VLC is likely your best choice.</p><p>Traditionally KPhotoAlbum has been using <b>Phonon</b> as the video player back-end. We've unfortunately seen it crash on many different video formats - possibly because our system wasn't correctly configured.</p><p><b><font color=red>You can at any time change the backend from Settings -> Viewer</font></b></p></html>
lv: <html><p>Diemžēl nav tāda videoceliņu atskaņotāja, kas darbotos bez problēmām visās sistēmās.</p><p>Līdz ar to „KPhotoAlbum“ nāk ar divām dažādām aizmugursistēmām, ļaujot izvēlēties, kura no tām darbojas labāk jums.</p><p><b>VLC</b>, iespējams, ir vislabāk atskaņotā video aizmugursistēma, kas nozīmē, ka tā ļauj atskaņot lielāko daļu video formātu. Tomēr tai ir viens trūkums — tai nepieciešams X11. Ja izmantojat „Wayland“, video atvērsies paši savos logos, bet šāda programmas darbība var nebūt ērta. No otras puses, ja izmantojat X11, tad VLC varētu būt labākā izvēle.</p><p>Tradicionāli kā video atskaņošanas aizmugursistēmu „KPhotoAlbum“ izmanto <b>Phonon</b>. Diemžēl pieredze rāda, ka tā avarē, mēģinot atskaņot dažādos video formātus, bet, iespējams, mūsu sistēma nebija korekti konfigurēta.</p><p><b><font color=red>Aizmugursistēmu varat mainīt jebkurā brīdī, ejot uz Iestatījumi—>Skatītājs</font></b></p></html>
