Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

# NAME OF TRANSLATORS
source: Your names
ar: Mohamed SAAD محمد سعد,زايد السعيدي
lv: Toms Trasūns

# EMAIL OF TRANSLATORS
source: Your emails
ar: metehyi@free.fr,zayed.alsaidi@gmail.com
lv: toms.trasuns@posteo.net

source: Tag is already used for another area
ar: وسم مستخدم فعلًا لمنطقة أخرى
lv: Birka jau tiek izmantota citā zonā

source: tomorrow
ar: غداً
lv: rīt

source: today
ar: اليوم
lv: šodien

source: yesterday
ar: البارحة
lv: vakar

source: Description
ar: الوصف
lv: Apraksts

source: (You have differing descriptions on individual images. Enter text to append to or replace the descriptions.)
ar: (لديك أوصاف مختلفة للصور الفردية، أدخل النص المراد إضافته إلى الأوصاف أو استبدالها.)
lv: (Katram attēlam ir atsevišķs apraksts. Ierakstiet tekstu, ko pievienot aprakstiem vai ar kuru aprakstus aizvietot.)

source: Label and Dates
ar: التسمية و التاريخ
lv: Etiķetes un datumi

source: Image Preview
ar: معاينة الصورة
lv: Attēla priekšskatījums

source: Cancel
ar: ألغِ
lv: Atcelt

source: Map
ar: الخريطة
lv: Karte

# @info:whatsthis
source: The map widget allows you to view the location of images if GPS coordinates are found in the Exif information.
ar: تتيح لك أداة الخريطة عرض موقع الصور إذا عُثر على إحداثيات GPS في معلومات Exif.
lv: Kartes logdaļa ļauj apskatīt attēlu uzņemšanas vietas, ja tā „Exif“ informācija satur GPS koordinātas.

source: Revert This Item
ar: استرجع هذا العنصر
lv: Atjaunot šo vienumu

source: Clear Form
ar: امحُ الاستمارة
lv: Notīrīt veidni

source: Options...
ar: الخيارات...
lv: Opcijas...

source: &Done
ar: &تمّ
lv: &Pabeigt

source: Continue &Later
ar: تابع لا&حقًا
lv: &Turpināt vēlāk

# @action:button
source: &Search
ar: ا&بحث
lv: &Meklēt

source: Label:
ar: التسمية:
lv: Etiķete:

source: Label
ar: التسمية
lv: Etiķete

source: Date:
ar: التاريخ:
lv: Datums:

source: Time:
ar: الوقت:
lv: Laiks:

source: Use Fuzzy Date
ar: استخدم تاريخ مبهم
lv: Izmanto aptuvenu datumu

# @info
source: <para>In KPhotoAlbum, images can either have an exact date and time, or a <emphasis>fuzzy</emphasis> date which happened any time during a specified time interval. Images produced by digital cameras do normally have an exact date.</para><para>If you don't know exactly when a photo was taken (e.g. if the photo comes from an analog camera), then you should set <interface>Use Fuzzy Date</interface>.</para>
ar: <para>في دفتر الصور، يمكن أن يكون للصور تاريخ ووقت محددان، أو تاريخ <emphasis>تقريبي</emphasis> حدث في أي وقت خلال فترة زمنية محددة. الصور المنتجة بواسطة الكاميرات الرقمية يكون لها عادةً تاريخ محدد.</para><para>إذا لم تكن تعرف بالضبط متى أُخذت الصورة (مثلًا إذا كانت الصورة من كاميرا تماثلية)، فيجب عليك تعيين <interface>استخدام التاريخ التقريبي</interface>.</para>
lv: <para>„KPhotoAlbum“ programmā attēliem var būt precīzs datums un laiks vai arī <emphasis>aptuvens</emphasis> datums, izmantojot noteiktu laika intervālu. Parasti ar digitālo kameru uzņemtiem attēliem ir precīzs datums.</para><para>Ja nezināt, kad tieši fotogrāfija ir uzņemta (piemēram, ja fotogrāfijas avots ir analoga kamera), ieslēdziet iespēju <interface>Izmantot aptuvenu datumu</interface>.</para>

source: Minimum megapixels:
ar: الحد الأدنى للميغابكسل:
lv: Minimālie megapikseļi:

source: Maximum megapixels:
ar: الحد الأقصى للميغابكسل:
lv: Maksimālie megapikseļi:

source: Rating:
ar: التقييم:
lv: Vērtējums:

source: Rating search mode:
ar: وضع بحث التقييم:
lv: Reitinga meklēšanas režīms:

source: File Name Pattern:
ar: نمط اسم الملف:
lv: Datnes nosaukuma paraugs:

source: File Name Pattern
ar: نمط اسم الملف
lv: Datnes nosaukuma paraugs

source: Search only for RAW files
ar: ابحث عن ملفات RAW فقط
lv: Meklēt tikai RAW datnes

source: Append
ar: ألحق
lv: Pievienot

source: Append new text to each description
ar: ألحق نصًا جديدًا بكل وصف
lv: Pievienot tekstu katram aprakstam

source: Replace
ar: استبدل
lv: Aizvietot

source: Replace each description with the new text
ar: استبدل بكل وصف النص الجديد
lv: Aizvietot katru aprakstu ar jauno tekstu

# @info:whatsthis
source: <para>A descriptive text of the image.</para><para>If <emphasis>Use Exif description</emphasis> is enabled under <interface>Settings|Configure KPhotoAlbum...|General</interface>, a description embedded in the image Exif information is imported to this field if available.</para>
ar: <para>نص وصفي للصورة.</para><para>إذا كان خيار <emphasis>استخدام وصف Exif</emphasis> مفعلاً تحت <interface>الإعدادات|ضبط دفتر الصور...|عام</interface>، سيُستورد الوصف المضمن في معلومات Exif الخاصة بالصورة إلى هذا الحقل إذا كان متاحًا.</para>
lv: <para>Attēlu aprakstošs teksts.</para><para>Ja ir ieslēgts <emphasis>Izmantot „Exif“ aprakstu</emphasis>, kas atrodams <interface>Iestatījumi|Konfigurēt „KPhotoAlbum“...|Pamata</interface> sadaļā, apraksts, kas ir iegults „Exif“ informācijā tiek importēts šajā laukā, ja tas ir pieejams.</para>

# @title:window image %1 of %2 images
source: Annotations (%1/%2)
ar: الشروح (%1/%2)
lv: Anotācijas (%1/%2)

# @title:window title of the 'find images' window
source: Search
ar: ابحث
lv: Meklēt

source: Done
ar: تمّ
lv: Pabeigt

# @title:window
source: Annotations
ar: الشروح
lv: Anotācijas

source: Configure Window Layout...
ar: اضبط تخطيط النافذة...
lv: Konfigurēt logu izkārtojumu...

source: Save Current Window Setup
ar: أحفظ تعيين النافذة الحالي
lv: Saglabāt pašreizējo logu iestatījumu

source: Reset layout
ar: صفّر التخطيط
lv: Atiestatīt izkārtojumu

source: Sort Alphabetically (Tree)
ar: افرز أبجديًا (شجري)
lv: Kārtot alfabētiski (koks)

source: Sort Alphabetically (Flat)
ar: افرز أبجديًا (مسطح)
lv: Kārtot alfabētiski (plakans)

source: Sort by Date
ar: رتب بالتّاريخ
lv: Kārtot pēc datuma

source: Match Tags from the First Character
ar: طابق الوسوم من الحرف الأول
lv: Meklēt birku atbilsmi no pirmās rakstzīmes

source: Match Tags from Word Boundaries
ar: طابق الوسوم من حدود الكلمات
lv: Meklēt birkas no vārdu robežām

source: Match Tags Anywhere
ar: طابق الوسوم في أي مكان
lv: Meklēt birkas visur

source: Show Only Selected Ctrl+S
ar: أظهر المحدّد فقط Ctrl+S
lv: Rādīt tikai atlasīto „Ctrl+S“

source: Settings saved!
ar: حُفظت الإعدادات!
lv: Iestatījumi ir saglabāti!

source: Save current window setup
ar: أحفظ تعيين النافذة الحالي
lv: Saglabāt pašreizējo loga iestatījumu

source: <p>Some changes are made to annotations. Do you really want to discard all recent changes for each affected file?</p>
ar: <p>أُجريت بعض التغييرات على الشروح التوضيحية. هل تريد حقًا تجاهل جميع التغييرات الحديثة لكل ملف متأثر؟</p>
lv: <p>Anotācijās ir izdarītas izmaiņas. Vai tiešām vēlaties izmest nesen veiktās izmaiņas katrai izmainītajai datnei?</p>

# @title
source: Discard changes?
ar: ارفض التّغييرات
lv: Vai noraidīt izmaiņas?

source: <p>You have just opened the advanced search dialog; to get the most out of it, it is suggested that you read the section in the manual on <a href="help:/kphotoalbum/sect-general-image-searches.html">advanced searching</a>.</p><p>This dialog is also used for typing in information about images; you can find extra tips on its usage by reading about <a href="help:/kphotoalbum/chp-typingIn.html">typing in</a>.</p>
ar: <p>لقد فتحت للتو حوار البحث المتقدم؛ للاستفادة القصوى منه، يُقترح قراءة القسم في الدليل حول <a href="help:/kphotoalbum/sect-general-image-searches.html">البحث المتقدم</a>.</p><p>يُستخدم هذا الحوار أيضًا لإدخال معلومات حول الصور؛ يمكنك العثور على نصائح إضافية حول استخدامه من خلال قراءة <a href="help:/kphotoalbum/chp-typingIn.html">الإدخال</a>.</p>
lv: <p>Jūs tikai atvērāt papildu meklēšanas logu. Lai uzzinātu, kā to vislabāk izmantot, iesakām izlasīt rokasgrāmatu par <a href="help:/kphotoalbum/sect-general-image-searches.html">papildu meklēšanu</a>.</p><p>Tāpat šajā lodziņā varat ierakstīt informāciju par attēliem. Vairāk padomu par tā lietošanu varat uzzināt, lasot par <a href="help:/kphotoalbum/chp-typingIn.html">ierakstīšana</a>.</p>

source: <p>You have just opened one of the most important windows in KPhotoAlbum; it contains lots of functionality which has been optimized for fast usage.</p><p>It is strongly recommended that you take 5 minutes to read the <a href="help:/kphotoalbum/chp-typingIn.html">documentation for this dialog</a></p>
ar: <p>لقد فتحت للتو إحدى النوافذ الأكثر أهمية في دفتر الصور؛ فهي تحتوي على الكثير من الوظائف المحسنة للاستخدام السريع.</p><p>يُوصى بشدة أن تأخذ 5 دقائق لقراءة <a href="help:/kphotoalbum/chp-typingIn.html">الوثائق الخاصة بهذا الحوار</a></p>
lv: <p>Varat atvērt vienu no svarīgākajiem „KPhotoAlbum“ logiem, kas satur ātrai lietošanai optimizētu plašu funkcionalitāti.</p><p>Ieteicams pavadīt piecas minūtes, lai izlasītu <a href="help:/kphotoalbum/chp-typingIn.html">šī lodziņa dokumentāciju.</a></p>

source: Sort Most Recently Used
ar: افرز الأحدث استعمال
lv: Kārtot pēc pēdējā lietotā

source: Toggle Sorting
ar: اقلب حالة الفرز
lv: Pārslēgt kārtošanu

source: Toggle Showing Selected Items Only
ar: بدّل إظهار العناصر المحددة فقط
lv: Pārslēgt tikai atlasīto vienumu rādīšanu

source: Annotate Next
ar: اشرح التالي
lv: Anotēt nākamo

source: Annotate Previous
ar: اشرح السابق
lv: Anotēt iepriekšējo

source: OK dialog
ar: حوار الموافقة
lv: „Labi“ lodziņš

source: Copy tags from previous image
ar: انسخ الوسوم من الصورة السابقة
lv: Kopēt birkas no iepriekšējā attēla

source: Rotate counterclockwise
ar: أدر عكس عقارب الساعة
lv: Pagriezt pretēji pulksteņrādītājam

source: Rotate clockwise
ar: أدر باتجاه عقارب الساعة
lv: Pagriezt pulksteņrādītāja virzienā

source: Toggle fullscreen preview
ar: بدّل معاينة ملء الشاشة
lv: Pārslēgt pilnekrāna priekšskatījumu

source: <p><b>Can't associate tag "%2"</b></p><p>The category "%1" the tag "%2" belongs to is not positionable.</p><p>If you want to use this tag, change this in the settings dialog. If this tag shouldn't be in the recognition database anymore, it can be deleted in the settings.</p>
ar: <p><b>لا يمكن ربط الوسم "%2"</b></p><p>الفئة "%1" التي ينتمي إليها الوسم "%2" ليست قابلة للتحديد المكاني.</p><p>إذا كنت تريد استخدام هذا الوسم، فغيّر هذا في حوار الإعدادات. إذا كان هذا الوسم لا ينبغي أن يكون في قاعدة بيانات التعرف بعد الآن، فيمكن حذفه في الإعدادات.</p>
lv: <p><b>Nevar sasaistīt birku „%2“</b></p><p>Kategorijas „%1“, pie kuras pieder birka „%2“, nav pozicionējama.</p><p>Ja vēlaties izmantot šo birku, mainiet to iestatījumu lodziņā. Ja šai birkai vairs nav jābūt atpazīšanas datubāzē, to var dzēst iestatījumos.</p>

source: <p><b>Can't associate tag "%2"</b></p><p>The category "%1" the tag "%2" belongs to does not exist.</p><p>If you want to use this tag, add this category and mark it as positionable. If this tag shouldn't be in the recognition database anymore, it can be deleted in the settings dialog.</p>
ar: <p><b>لا يمكن ربط الوسم "%2"</b></p><p>الفئة "%1" التي ينتمي إليها الوسم "%2" غير موجودة.</p><p>إذا كنت تريد استخدام هذا الوسم، فأضف هذه الفئة وعلّمها كقابلة للتحديد المكاني. إذا كان هذا الوسم لا ينبغي أن يكون في قاعدة بيانات التعرف بعد الآن، فيمكن حذفه في حوار الإعدادات.</p>
lv: <p><b>Nevar sasaistīt birku „%2“</b></p><p>Kategorija „%1“, pie kuras pieder birka „%2“, nepastāv.</p><p>Ja vēlaties izmantot šo birku, pievienojiet šo kategoriju un atzīmēt to kā pozicionējamu. Ja šai birkai vairs nav jābūt atpazīšanas datubāzei, to varat dzēst iestatījumu lodziņā.</p>

source: Annotate previous image (Page Up)
ar: اشرح الصورة السابقة (Page Up)
lv: Anotēt iepriekšējo attēlu („Page Up“)

source: Annotate next image (Page Down)
ar: اشرح الصورة التالية (Page Down)
lv: Anotēt nākamo attēlu („Page Down“)

# @info:whatsthis
source: <para>Set the same tags on this image than on the previous one. The image date, label, rating, and description are left unchanged.</para>
ar: <para>اضبط نفس الوسوم على هذه الصورة كما في الصورة السابقة. تاريخ الصورة، التسمية، التقييم، والوصف تبقى دون تغيير.</para>
lv: <para>Iestatīt tās pašas birkas šim attēlam, kādas ir iepriekšējam. Attēla datums, etiķete, reitings un apraksta paliek bez izmaiņām.</para>

source: Category for new areas:
ar: الفئة للمناطق الجديدة:
lv: Kategorija jaunām zonām:

# @info:tooltip
source: Hide or show areas on the image
ar: أخفِ أو أظهر المناطق على الصورة
lv: Slēpt vai rādīt zonas attēlā

# @info:tooltip
source: If you enable <emphasis>positionable tags</emphasis> for at least one category in <interface>Settings|Configure KPhotoAlbum...|Categories</interface>, you can associate specific image areas with tags.
ar: إذا مكّنت <emphasis>الوسوم القابلة للتحديد المكاني</emphasis> لفئة واحدة على الأقل في <interface>الإعدادات|اضبط دفتر الصور...|الفئات</interface>، يمكنك ربط مناطق صورة محددة بالوسوم.
lv: Ieslēdzot <emphasis>pozicionālas birkas</emphasis> vismaz vienai kategorijai iestatījums, kas atrodami <interface>Iestatījumi|Konfigurēt „KPhotoAlbum“...|Kategorijas</interface>, varat sasaistīt noteiktas attēlu zonas ar birkām.

# @info:tooltip
source: Areas on an image can only be shown in single-image annotation mode.
ar: يمكن عرض المناطق على الصورة فقط في وضع الشرح للصورة المفردة.
lv: Zonas attēlam var redzēt tikai viegla attēla anotācijas režīmā.

# @info:tooltip
source: Toggle full-screen preview
ar: بدّل معاينة ملء الشاشة
lv: Pārslēgt pilnekrāna priekšskatījumu

# @info:tooltip
source: Rotate counterclockwise
ar: أدر عكس عقارب الساعة
lv: Pagriezt pretēji pulksteņrādītājam

# @info:tooltip
source: Rotate clockwise
ar: أدر باتجاه عقارب الساعة
lv: Pagriezt pulksteņrādītāja virzienā

# @info:tooltip
source: Copy tags from previously tagged image
ar: انسخ الوسوم من الصورة الموسومة مسبقًا
lv: Kopēt birkas no iepriekšējā birkotā attēla

# @info:tooltip
source: Delete image
ar: احذف الصورة
lv: Dzēst attēlu

# @label:textbox
source: Enter a tag ...
ar: أدخل وسمًا ...
lv: Ierakstiet birku...

source: or
ar: أو
lv: vai

source: and
ar: و
lv: un

source: Sort by date
ar: افرز حسب التاريخ
lv: Kārtot pēc datuma

source: Show only selected Ctrl+S
ar: أظهر المحدّد فقط Ctrl+S
lv: Rādīt tikai atlasīto „Ctrl+S“

source: The tag you entered is the tag that is set automatically for newly found, untagged images (cf. <interface>Settings|Configure KPhotoAlbum...|Categories|Untagged Images</interface>). It will not show up here as long as it is selected for this purpose.
ar: الوسم الذي أدخلته هو الوسم المعين آليًا للصور غير الموسومة التي عُثر عليها حديثًا (راجع <interface>إعدادات|اضبط دفتر الصور...|الفئات|الصور غير الموسومة</interface>). لن يظهر هنا طالما حُدد لهذا الغرض.
lv: Ierakstītā birka ir birka, kas tiek automātiski pievienota attēliem bez birkām (sal. <interface>Iestatījumi|Konfigurēt „KPhotoAlbum“...|Kategorijas|Attēli bez birkām</interface>). Tā te nebūs redzama, kamēr tiek izmantota šādam mērķim.

source: No Item Selected
ar: لم يحدد أي عنصر
lv: Nekas nav atlasīts

source: Delete
ar: احذف
lv: Dzēst

source: Rename...
ar: غيّر الاسم...
lv: Pārdēvēt...

source: <b>Tag Groups</b>
ar: <b>مجموعات الوسوم</b>
lv: <b>Birku grupas</b>

source: Tag groups
ar: مجموعات الوسوم
lv: Birku grupas

source: Add this tag to a new tag group...
ar: أضف هذا الوسم إلى مجموعة وسوم جديدة...
lv: Pievienojiet šo birku jaunai birku grupai...

source: Make this tag a tag group and add a tag...
ar: اجعل هذا الوسم مجموعة وسوم وأضف وسم...
lv: Padarīt šo birku par birku grupu un pievienot birku...

source: Remove from tag group %1
ar: أزل من مجموعة الوسوم %1
lv: Noņemt no birku grupas „%1“

source: <b>Sorting</b>
ar: <b>الفرز</b>
lv: <b>Kārtošana</b>

source: Usage
ar: الاستعمالية
lv: Lietojums

source: Alphabetical (Flat)
ar: أبجدي (مسطح)
lv: Alfabētisks (plakans)

source: Alphabetical (Tree)
ar: أبجدي (شجري)
lv: alfabētisks (koks)

source: <p>Do you really want to delete "%1"?<br/>Deleting the item will remove any information about it from any image containing the item.</p>
ar: <p>هل تريد حقًا حذف "%1"؟<br/>سيؤدي حذف العنصر إلى إزالة أي معلومات عنه من أي صورة تحتوي على العنصر.</p>
lv: <p>Vai tiešām vēlaties dzēst „%1“?<br/>Vienuma dzēšana noņems visu informāciju par to no jebkura attēla, kas to satur.</p>

source: Really Delete %1?
ar: محو %1 حقاً ؟
lv: Vai tiešām dzēst „%1“?

# @title
source: Rename Item
ar: غيّر التسمية
lv: Pārdēvēt vienumu

source: Enter new name:
ar: أدخل الاسم الجديد:
lv: Ierakstiet jauno nosaukumu:

source: <p>Do you really want to rename "%1" to "%2"?<br/>Doing so will rename "%3" on any image containing it.</p>
ar: <p>هل تريد حقًا إعادة تسمية "%1" إلى "%2"؟<br/>سيؤدي القيام بذلك إلى إعادة تسمية "%3" على أي صورة تحتويه.</p>
lv: <p>Vai tiešām vēlaties pārdēvēt „%1“ par „%2“?<br/>Šī rīcība pārdēvēs „%3“ jebkurā attēlā, kas to satur.</p>

# @title
source: Rename %1?
ar: هل أغيّر الاسم %1؟
lv: Vai pārdēvēt „%1“?

# @action:button
source: Rename
ar: غيّر الاسم
lv: Pārdēvēt

source: New tag group
ar: مجموعة وسوم جديدة
lv: Jauna birku grupa

source: Name for the new tag group the tag will be added to:
ar: اسم مجموعة الوسوم الجديدة التي ستُضاف الوسم إليها:
lv: Jaunās birku grupas nosaukums, kurai birka tiks pievienota:

source: Add a tag
ar: أضف وسمًا
lv: Pievienot birku

source: Name for the tag to be added to this tag group:
ar: اسم الوسم المراد إضافته إلى مجموعة الوسوم هذه:
lv: Šīs birkas nosaukums tiks pievienots šai birku grupai:

# area of an image; rectangle that is overlayed upon the image
source: Remove area
ar: أزل المنطقة
lv: Noņemt zonu

source: <p>%1 has already been tagged in another area on this image.</p><p>If you continue, the previous tag will be removed...</p>
ar: <p>وُضع وسم %1 فعلًا في منطقة أخرى على هذه الصورة.</p><p>إذا تابعت، سيُزال الوسم السابق...</p>
lv: <p>„%1“ ir jau pievienota citai attēla zonai.</p><p>Ja turpināsit, iepriekšējā birka tiks noņemta...</p>

source: Replace existing area?
ar: هل استبدال المنطقة الموجودة؟
lv: Vai aizvietot pastāvošo zonu?

# As in: remove tag %1 in category %2 [from this marked area of the image]
source: Remove tag %1 (%2)
ar: أزل الوسم %1 (%2)
lv: Vai noņemt birku „%1“ („%2“)

source: Associate with
ar: اربط بـ
lv: Sasaistīt ar

source: Associate with
ar: اربط بـ
lv: Sasaistīt ar

source: Extracting Thumbnail
ar: يستخرج المصغرة
lv: Izvelk sīktēlu

source: Extract Video Thumbnail
ar: استخراج صورة مصغرة للفيديو
lv: Izvilkt video sīktēlu

source: Read Video Metadata
ar: اقرأ البيانات الوصفية للفيديو

source: Search for videos without length information
ar: ابحث عن مقاطع الفيديو التي لا تحتوي على معلومات الطول
lv: Meklēt video bez garuma informācijas

source: Searching for videos without video thumbnails
ar: يبحث عن مقاطع الفيديو التي لا تحتوي على صور مصغرة
lv: Meklēt video bez video sīktēliem

source: Not Started
ar: لم يبدأ
lv: Nav sākts

# @title:column Background job id
source: ID
ar: المُعرّف

# @title:column Background job title
source: Title
ar: العنوان
lv: Nosaukums

# @title:column Additional information on background job
source: Details
ar: تفاصيل
lv: Informācija

# @title:column Elapsed time
source: Elapsed
ar: المنقضي
lv: Pavadīts

# @title:window
source: Background Job Viewer
ar: عارض المهام الخلفية
lv: Fona darbu skatītājs

source: Pause
ar: ألبِث
lv: Pauzēt

source: Continue
ar: تابع
lv: Turpināt

source: <p>Active jobs: %1<br/>Pending jobs: %2<hr/><br/>Color codes:<ul><li><b>blinking green</b>: Active background jobs</li><li><b>gray</b>: No active jobs</li><li><b>solid yellow</b>: Job queue is paused</li><li><b>blinking yellow</b>: Job queue is paused for background jobs, but is executing a foreground job (like extracting a thumbnail for a video file, which is currently shown in the thumbnail viewer)</li></ul></p>
ar: <p>المهام النشطة: %1<br/>المهام المعلقة: %2<hr/><br/>رموز الألوان:<ul><li><b>أخضر وامض</b>: مهام خلفية نشطة</li><li><b>رمادي</b>: لا توجد مهام نشطة</li><li><b>أصفر ثابت</b>: طابور المهام متوقف مؤقتًا</li><li><b>أصفر وامض</b>: طابور المهام متوقف مؤقتًا للمهام الخلفية، ولكنه ينفذ مهمة أمامية (مثل استخراج صورة مصغرة لملف فيديو، معروضة حاليًا في عارض الصور المصغرة)</li></ul></p>
lv: <p>Aktīvie darbi: %1<br/>Ierindotie darbi: %2<hr/><br/>Krāsu kodi:<ul><li><b>mirgo zaļš</b>: aktīvi fona darbi</li><li><b>pelēks</b>: bez aktīviem darbiem</li><li><b>nemirgojošs dzeltens</b>: darbu rinda ir pauzēta</li><li><b>mirgojošs dzeltens</b>: darbu rinda ir pauzēta fona darbiem, bet tiek izpildīts priekšplāna darbs (piemēram, notiek video datnes sīktēla veidošana, kas šobrīd tiek parādīts sīktēlu skatītājā)</li></ul></p>

# As in No persons, no locations etc.
source: None
ar: لا شيء
lv: Nav

# As in no other persons, or no other locations.
source: No other
ar: لا شيء آخر
lv: Nav citu

# @item:intable number of images with a specific tag.
source: 1 image
ar: لا صور
lv: %1 attēls

# @item:intable number of videos with a specific tag.
source: 1 video
ar: لا فيديوهات

source: Images
ar: الصور
lv: attēli

source: Videos
ar: المرئيات
lv: Video

source: Start Date
ar: تاريخ البدء
lv: Sākuma datums

source: End Date
ar: تاريخ الانتهاء
lv: Beigu datums

# As in 'all pictures'.
source: All
ar: الكل
lv: Viss

source: Geo Position
ar: الموقع الجغرافي
lv: Ģeogr. vieta

source: Exif Info
ar: معلومات Exif
lv: „Exif“ informācija

# @action Search button in the browser view.
source: Search
ar: ابحث
lv: Meklēt

source: Untagged Images
ar: الصور غير الموسومة
lv: Attēli bez birkām

source: Show Thumbnails
ar: أظهر المصغرات
lv: Rādīt sīktēlus

source: Search did not match any images or videos.
ar: البحث لم يتبق أي صور أو أي مرئيات.
lv: Meklēšana neatrada atbilstošus attēlus vai video.

source: Empty Search Result
ar: أفرغ نتائج البحث
lv: Iztukšot meklēšanas rezultātus

source: Exif Search
ar: بحث Exif
lv: „Exif“ meklēšana

# Breadcrumb denoting that we 'browsed' to a search result.
source: search
ar: ابحث
lv: meklēt

source: <p>You have not yet configured which tag to use for indicating untagged images.</p><p>Please follow these steps to do so:<ul><li>In the menu bar choose <b>Settings</b></li><li>From there choose <b>Configure KPhotoAlbum</b></li><li>Now choose the <b>Categories</b> icon</li><li>Now configure section <b>Untagged Images</b></li></ul></p>
ar: <p> لم تضبط بعد الوسم الذي سيُستخدم للإشارة إلى الصور غير الموسومة.</p><p>يرجى اتباع هذه الخطوات للقيام بذلك:<ul><li>في شريط القوائم اختر <b>إعدادات</b></li><li>من هناك اختر <b>ضبط دفتر الصور</b></li><li>الآن اختر أيقونة <b>الفئات</b></li><li>الآن اضبط قسم <b>الصور غير الموسومة</b></li></ul></p>
lv: <p>Vēl nav konfigurēts, kuru birku izmantot, lai norādītu attēlus bez birkas.</p><p>Lai to izdarīto, veiciet šādas darbības:<ul><li>Izvēļņu joslā atlasiet <b>Iestatījumi</b></li><li>No turienes izvēlieties <b>Konfigurēt „KPhotoAlbum“</b></li><li>Tagad izvēlieties <b>Kategorijas</b> ikonu</li><li>Tagad konfigurējiet sadaļu <b>Attēli bez birkas</b></li></ul></p>

source: Feature has not been configured
ar: لم تُضبط الميزة
lv: Iespēja vēl nav konfigurēta

source: "%1" and "%2"
ar: "%1" و "%2"
lv: „%1“ un „%2“

source: and "%1"
ar: و "%1"
lv: un „%1“
