Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: <p>You have just dragged an item onto another. This will make the target item a tag group and define the dragged item as a member of this group. Tag groups may be used to denote facts such as 'Las Vegas is in the USA'. In that example you would drag Las Vegas onto USA. When you have set up tag groups, you can, for instance, see all images from the USA by simply selecting that item in the Browser.</p><p>Was it really your intention to make "%3" a tag group and add "%2" as a member?</p>
ar: <p>لقد سحبت عنصر واحد على عنصر آخر. هذا سيجعل العنصر الهدف مجموعة وسوم ويُعرِّف العنصر المسحوب كعضو في هذه المجموعة. يمكن استخدام مجموعات الوسوم للإشارة إلى حقائق مثل 'لاس فيغاس في الولايات المتحدة الأمريكية'. في هذا المثال، ستسحب لاس فيغاس على الولايات المتحدة الأمريكية. عندما تقوم بإعداد مجموعات الوسوم، يمكنك على سبيل المثال رؤية جميع الصور من الولايات المتحدة الأمريكية بمجرد تحديد ذلك العنصر في المتصفح.</p><p>هل كان حقًا من نيتك جعل "%3" مجموعة وسوم وإضافة %2 كأعضاء؟</p>
lv: <p>Tu ievilki vienu vai vairākus vienumus uz cita vienuma. Tas mērķa vienumu padarīs par vienumu grupu un definēs ievilkto vienumu kā šīs grupas daļu. Birku grupas var izmantot, lai atzīmētus tādus faktus kā „Berlīne Eiropā“. Šajā piemērā varat vilkt „Berlīne“ birku uz „Eiropas“ birkas. Veidojot birkas grupas, varat, piemēram, redzēt visus ASV attēlos, vienkāršo atlasot šo vienumu pārlūkā.</p><p>Vai tiešām tava vēlme bija „%3“ par birku grupu un tai kā locekli pievienot „%2“?</p>

source: Move Items
ar: انقل العناصر
lv: Pārvietot vienumus

# Accessible name for the date bar widget
source: Datebar
ar: شريط التاريخ
lv: Datumu josla

source: Scroll right
ar: مرّر لليمين
lv: Ritināt pa labi

source: Scroll left
ar: مرّر لليسار
lv: Ritināt pa kreisi

source: Zoom in
ar: قرّب
lv: Tuvināt

source: Zoom out
ar: بعّد
lv: Tālināt

# The button clears the selection of a date range in the date bar.
source: Clear date selection
ar: امحُ نطاق التاريخ المحدد
lv: Notīrīt datumu atlasi

# @info
source: <title>The date bar</title><para><list><item>Scroll using the arrow buttons, the scrollwheel, or the middle mouse button.</item><item>Use the home and end buttons to scroll to the start or end.</item><item>Zoom using the +/- buttons or Ctrl + scrollwheel.</item><item>Restrict the view to a date range selection: Click/drag below the timeline.</item><item>Jump to a date by clicking on the histogram bar.</item></list></para>
ar: <title>شريط التاريخ</title><para><list><item>مرر باستخدام أزرار الأسهم، عجلة التمرير، أو زر الفأرة الأوسط.</item><item>استخدم أزرار Home و End للتمرير إلى البداية أو النهاية.</item><item>كبّر/صغّر باستخدام أزرار +/- أو Ctrl + عجلة التمرير.</item><item>تقييد العرض لتحديد نطاق تاريخي: انقر/اسحب أسفل الخط الزمني.</item><item>انتقل إلى تاريخ بالنقر على شريط الرسم البياني.</item></list></para>
lv: <title>Datuma josla</title><para><list><item>Ritiniet ar bultiņu pogām, peles ritentiņu vai peles vidējo pogu.</item><item>Izmantojiet „Home“ un „End“ pogas uz tastatūras, lai ritinātu uz sākumu vai beigām.</item><item>Mainiet tālummaiņu ar +/− pogām vai turiet „Ctrl“ un ritiniet peles ritentiņu.</item><item>Ierobežojiet skatu uz noteiktu datumu diapazonu, klikšķinot/velkot zem laika joslas.</item><item>Ejiet uz noteiktu datumu, klikšķinot uz histogrammas joslas.</item></list></para>

source: Show Ranges
ar: أظهر النطاقات
lv: Rādīt diapazonus

source: Show Resolution Indicator
ar: اعرض مؤشر الدقة
lv: Rādīt izšķirtspējas indikatoru

# @info:status images that fall in the given date range
source: 1 exact
ar: لا يوجد تطابق
lv: %1 atbilsme

source: + 1 range
ar: + نطاق واحد
lv: + %1 diapazons

# @info:status total image count
source: = 1 total
ar: المجموع= %1
lv: = %1 kopā

# @info:status image count
source: %1 image/video
ar: %1 صور/مرئيات
lv: %1 attēls/video

source: 1 Year
ar: سنة واحِدة
lv: 1 gads

source: 1 Month
ar: شهر واحِد
lv: 1 mēnesis

source: 1 Week
ar: أسبوع واحِد
lv: 1 nedēļa

source: 1 Day
ar: يوم واحِد
lv: 1 diena

source: 2 Hours
ar: ساعتين
lv: 2 stundas

source: 10 Minutes
ar: عشرة دقائق
lv: 10 minūtes

source: 1 Minute
ar: دقيقة
lv: 1 minūte

source: 10 Seconds
ar: 10 ثواني
lv: 10 sekunžu

source: Unable to create folder '%1'.
ar: تعذّر إنشاء المجلّد ’%1‘.
lv: Neizdodas izveidot mapi „%1“.

source: Unable to Create Folder
ar: تعذّر إنشاء المجلّد
lv: Neizdodas izveidot mapi

source: Error when saving image '%1'.
ar: خطأ عند حفظ الصورة '%1'.
lv: Kļūda, saglabājot attēlu „%1“.

source: Error Saving Image
ar: خطأ حفظ الصورة
lv: Kļūda, saglabājot attēlu

# Abbreviated month name
source: jan
ar: يناير
lv: janv.

# Abbreviated month name
source: feb
ar: فبراير
lv: febr.

# Abbreviated month name
source: mar
ar: مارس
lv: marts

# Abbreviated month name
source: apr
ar: أبريل

# Abbreviated month name
source: may
ar: مايو
lv: maijs

# Abbreviated month name
source: jun
ar: يونيو
lv: jūn.

# Abbreviated month name
source: jul
ar: يوليو
lv: jūl.

# Abbreviated month name
source: aug
ar: أغسطس

# Abbreviated month name
source: sep
ar: سبتمبر
lv: sept.

# Abbreviated month name
source: oct
ar: أكتوبر
lv: okt.

# Abbreviated month name
source: nov
ar: نوفمبر

# Abbreviated month name
source: dec
ar: ديسمبر

source: Autosave file '%1' exists (size %3 KB) and is newer than '%2'. Should the autosave file be used?
ar: يوجد ملف حفظ آلي '%1' (حجمه %3ك.بايت) و هو أجدد من '%2'. هل أستعمل ملف الحفظ الآلي ؟
lv: Automātiskās saglabāšanas datne „%1“ jau pastāv (izmērs ir %3 KB) un tā ir jaunāka par „%2“. Vai izmantot automātiskās saglabāšanas datni?

source: Found Autosave File
ar: وجدتُ ملف حفظ آلي
lv: Atrasta automātiskās saglabāšanas datne

source: Loading information from images
ar: يحمّل المعلومات من الصور
lv: Ielādē informāciju no attēliem

source: Media Type
ar: نوع الوسائط
lv: Multivides tips

source: Image
ar: صورة
lv: Attēls

source: Video
ar: فيديو

source: KPhotoAlbum - manual repair needed (%1)
ar: دفتر الصور - يحتاج إلى إصلاح يدوي (%1)
lv: „KPhotoAlbum“ — nepieciešama manuāla labošana (%1)

source: <p><b>Loading information from new files</b></p><p>Depending on the number of images, this may take some time.<br/>However, there is only a delay when new images are found.</p>
ar: <p><b>تحميل معلومات من ملفات جديدة</b></p><p>قد يستغرق ذلك بعض الوقت حسب عدد الصور.<br/>ولكن سيكون هناك تأخير عند العثور على صور جديدة.</p>
lv: <p><b>Ielādē informāciju no jaunajām datnēm</b></p><p>Tas var aizņemt kādu laiku atkarībā no attēlu skaita.<br/>Aizture ir tikai tad, kad ir atrasti jauni attēli.</p>

source: <p><b>Calculating checksum for %1 file</b></p>
ar: <p><b>لا يحسب تدقيق مجموع أي ملف</b></p>
lv: <p><b>Aprēķina kontrolsummu %1 datnei</b></p>

source: <p>By storing a checksum for each image KPhotoAlbum is capable of finding images even when you have moved them on the disk.</p>
ar: <p>من خلال تخزين مجموع اختباري لكل صورة، يستطيع دفتر الصور العثور على الصور حتى بعد نقلها على القرص.</p>
lv: <p>Kontrolsummas saglabāšana katram attēlam ļauj „KPhotoAlbum“ attēlus atrast arī tad, ja diskā tie ir pārvietoti citur.</p>

source: Following files could not be read:
ar: الملفات التالية لا يمكن قراءتها:
lv: Šīs datnes nolasīt neizdevās:

source: No %1
ar: لا يوجد %1
lv: Nav „%1“

source: not
ar: ليس
lv: ne

source: No other %1
ar: لا يوجد %1 أخرى
lv: Nekā cita kategorijā „%1“

source: <p>The XML database file is from a newer version of KPhotoAlbum!</p><p>Chances are you will be able to read this file, but when writing it back, information saved in the newer version will be lost</p>
ar: <p>ملف قاعدة بيانات XML من إصدار أحدث من دفتر الصور!</p><p>من المحتمل أن تتمكن من قراءة هذا الملف، ولكن عند إعادة كتابته، ستُفد المعلومات المحفوظة في الإصدار الأحدث</p>
lv: <p>XML datubāzes datne ir izveidota jaunākā „KPhotoAlbum“ versijā!</p><p>Iespējams, programmai izdosies datni nolasīt, tomēr, to atkal saglabājot, būs zudusi papildinformācija, kas atradās tās jaunākajā versijā</p>

source: XML database file version mismatch
ar: عدم تطابق إصدار ملف قاعدة بيانات XML
lv: XML datubāzes datnes versiju neatbilstība

source: Folder
ar: المجلّد
lv: Mape

source: Tokens
ar: العلّامات
lv: Žetoni

source: <p>Line %1, column %2: duplicate category '%3'</p><p>Choose continue to ignore the duplicate category and try an automatic repair, or choose cancel to quit.</p>
ar: <p>السطر %1، العمود %2: فئة مكررة '%3'</p><p>اختر 'متابعة' لتجاهل الفئة المكررة ومحاولة إصلاح تلقائي، أو اختر 'إلغاء' للخروج.</p>
lv: <p>%1. rinda, %2. kolonna: dublējas kategorija „%3“</p><p>Izvēlieties, vai turpināt un ignorēt dublējošos kategoriju un mēģināt to automātiski labot, vai arī atcelt darbību un iziet.</p>

source: Error in database file
ar: خطأ في ملف قاعدة البيانات
lv: Kļūda datubāzes datnē

source: <p><b>This version of KPhotoAlbum does not translate "standard" categories any more.</b></p><p>This may mean that – if you use a locale other than English – some of your categories are now displayed in English.</p><p>You can manually rename your categories any time and then save your database.</p><p>In some cases, you may get two additional empty categories, "Folder" and "Media Type". You can delete those.</p>
ar: <p><b>إصدار دفتر الصور هذا لم يعد يترجم الفئات "القياسية".</b></p><p>قد يعني هذا – إذا كنت تستخدم لغة غير الإنجليزية – أن بعض فئاتك ستظهر الآن باللغة الإنجليزية.</p><p>يمكنك إعادة تسمية فئاتك يدويًا في أي وقت ثم حفظ قاعدة البيانات.</p><p>في بعض الحالات، قد تحصل على فئتين إضافيتين فارغتين، "Folder" و "Media Type". يمكنك حذفهما.</p>
lv: <p><b>Šī „KPhotoAlbum“ versija vairs netulko „standarta“ kategorijas.</b></p><p>Tas var nozīmēt, ka, ja izmantojat citu valodu, kas nav angļu valoda, dažas kategorijas tagad būs angļu valodā.</p><p>Varat tagad vai vēlā manuāli pārdēvēt kategorijas un datubāzi saglabāt.</p><p>Dažos gadījumos programma var izveidot divas tukšas papildu kategorijas — „Folder“ un „Media Type“ —, kuras varat izdzēst.</p>

source: Changed standard category names
ar: غُيرت أسماء الفئات القياسية
lv: Mainīt standarta kategoriju nosaukumus

source: <p>Line %1, column %2: duplicate entry for file '%3' with different MD5 sum.</p><p>Manual repair required!</p>
ar: <p>السطر %1، العمود %2: إدخال مكرر للملف '%3' بقيمة MD5 مختلفة.</p><p>يحتاج إلى إصلاح يدوي!</p>
lv: <p>%1. rinda, %2. kolonna: dublējas ieraksts datnei „%3“ ar atšķirīgu MD5 kontrolsummu.</p><p>Nepieciešams to manuāli salabot!</p>

source: <p>Your images/videos are not sorted, which means that navigating using the date bar will only work suboptimally.</p><p>In the <b>Maintenance</b> menu, you can find <b>Display Images with Incomplete Dates</b> which you can use to find the images that are missing date information.</p><p>You can then select the images that you have reason to believe have a correct date in either their Exif data or on the file, and execute <b>Maintenance->Read Exif Info</b> to reread the information.</p><p>Finally, once all images have their dates set, you can execute <b>Maintenance->Sort All by Date & Time</b> to sort them in the database. </p>
ar: <p>الصور/مقاطع الفيديو الخاصة بك غير مرتبة، مما يعني أن التنقل باستخدام شريط التاريخ لن يعمل بشكل أمثل.</p><p>في قائمة <b>الصيانة</b>، يمكنك العثور على <b>عرض الصور ذات التواريخ غير المكتملة</b> والتي يمكنك استخدامها للعثور على الصور التي تفتقر إلى معلومات التاريخ.</p><p>يمكنك بعد ذلك تحديد الصور التي تعتقد أن لديها تاريخًا صحيحًا في بيانات Exif الخاصة بها أو على الملف، وتنفيذ <b>الصيانة->قراءة معلومات Exif</b> لإعادة قراءة المعلومات.</p><p>أخيرًا، بمجرد تعيين جميع التواريخ للصور، يمكنك تنفيذ <b>الصيانة->ترتيب الكل حسب التاريخ والوقت</b> لفرزها في قاعدة البيانات. </p>
lv: <p>Jūsu attēli/videoceliņi nav sakārtoti, kas nozīmē, ka pārvietošanās pa datumu joslu nedarbosies optimāli.</p><p>Varat atvērt <b>Apkope</b> izvēlni, tajā atrast iestatījumu <b>Parādīt attēlus ar nepilnīgiem datumiem</b>, kas ļaus atrast attēlus, kuriem trūkst datuma informācijas.</p><p>Pēc tam varat atlasīt attēlus, kuriem, jūsuprāt, ir pareizs datums „Exif“ datos vai datnē, un izpildīt <b>Apkope->Nolasīt „Exif“ informāciju</b>, kas no jauna nolasīs informāciju.</p><p>Pēdīgi, kad visiem attēliem būs norādīti datumi, varat izpildīt <b> Apkope->Kārtot visu pēc datuma un laika</b>, kas sakārtos visus datubāzes vienumus. </p>

source: Images/Videos Are Not Sorted
ar: الصور/المرئيات هي غير مفرزة
lv: Attēli/videoceliņi nav sakārtoti

source: <p>Not all the images in the database have information about image sizes; this is needed to get the best result in the thumbnail view. To fix this, simply go to the <b>Maintenance</b> menu, and first choose <b>Remove All Thumbnails</b>, and after that choose <tt>Build Thumbnails</tt>.</p><p>Not doing so will result in extra space around images in the thumbnail view - that is all - so there is no urgency in doing it.</p>
ar: <p>ليس جميع الصور في قاعدة البيانات تحتوي على معلومات حول أحجام الصور؛ هذا مطلوب للحصول على أفضل نتيجة في عرض الصور المصغرة. لإصلاح هذا، انتقل ببساطة إلى قائمة <b>الصيانة</b>، واختر أولاً <b>إزالة كل الصور المصغرة</b>، وبعد ذلك اختر <tt>بناء الصور المصغرة</tt>.</p><p>عدم القيام بذلك سيؤدي إلى وجود مساحة إضافية حول الصور في عرض الصور المصغرة - هذا كل شيء - لذا لا توجد ضرورة عاجلة للقيام بذلك.</p>
lv: <p>Ne visiem attēliem datubāzē ir informāciju par to izmēriem. Programmai ir jāzina izmērs, lai tā labāk darbotos ar sīktēlu skatu. To varat izlabot, ejot uz <b>Apkope</b> izvēlni un izvēloties <b>Noņemt visus sīktēlus</b>, bet pēc tam izvēloties <tt>Izveidot sīktēlus</tt>.</p><p>Ja to nedarīsiet, ap attēliem vienkārši būs papildu vieta, līdz ar to ar šo darbību nav jāsteidzas.</p>

source: Not All Images Have Size Information
ar: ليست كلّ الصور تحتوي على معلومات عن القياس
lv: Ne visiem attēliem ir informācija par to izmēru

# repair merged tags
source: <p>Inconsistencies were found and repaired in your database. Some categories now contain tags that were merged during the repair.</p><p>The following tags require manual inspection:<ul>
ar: <p>عُثر على عدم اتساق وأصلح في قاعدة بياناتك. بعض الفئات تحتوي الآن على وسوم دُمجت أثناء الإصلاح.</p><p>الوسوم التالية تحتاج إلى فحص يدوي:<ul>
lv: <p>Datubāzē ir atrasti un izlaboti nekonsekventi dati. Dažas kategorijas tagad satur birkas, kas labošanas laikā ir apvienotas.</p><p>Šīs birkas ir jāpārbauda manuāli:<ul>

# repair merged tags
source: </ul></p><p>All affected images have also been marked with a tag <em>KPhotoAlbum - manual repair needed</em>.</p>
ar: </ul></p><p>جميع الصور المتأثرة قد وُضع وسم عليها أيضًا <em>دفتر الصور - يحتاج إلى إصلاح يدوي</em>.</p>
lv: </ul></p><p>Visi skartie attēli tāpat ir atzīmēti ar birku<em>„KPhotoAlbum“ — nepieciešama manuāla labošana</em>.</p>

source: Database repair required
ar: مطلوب إصلاح قاعدة البيانات
lv: Datubāze ir jālabo

source: <p>KPhotoAlbum was unable to load a default setup, which indicates an installation error</p><p>If you have installed KPhotoAlbum yourself, then you must remember to set the environment variable <b>KDEDIRS</b>, to point to the topmost installation folder.</p><p>If you for example ran cmake with <b>-DCMAKE_INSTALL_PREFIX=/usr/local/kde</b>, then you must use the following environment variable setup (this example is for Bash and compatible shells):</p><p><b>export KDEDIRS=/usr/local/kde</b></p><p>In case you already have KDEDIRS set, simply append the string as if you where setting the <b>PATH</b> environment variable</p>
ar: <p>تعذر على دفتر الصور تحميل الإعدادات المبدئية، مما يشير إلى خطأ في التثبيت</p><p>إذا تثبت دفتر الصور بنفسك، فيجب أن تتذكر تعيين متغير البيئة <b>KDEDIRS</b> ليشير إلى مجلد التثبيت الأعلى.</p><p>إذا قمت بتشغيل cmake باستخدام <b>-DCMAKE_INSTALL_PREFIX=/usr/local/kde</b> على سبيل المثال، فيجب عليك استخدام إعداد متغير البيئة التالي (هذا المثال لـ Bash والأصداف المتوافقة):</p><p><b>export KDEDIRS=/usr/local/kde</b></p><p>في حال كان KDEDIRS معيّنًا مسبقًا، قم بإلحاق السلسلة كما لو كنت تقوم بتعيين متغير البيئة <b>PATH</b></p>
lv: <p>„KPhotoAlbum“ neizdevās ielādēt noklusējuma instalāciju, kas norāda ir kļūdu programmas instalācijā.</p><p>Ja „KPhotoAlbum“ instalējāt pats, atcerieties iestatīt vides mainīgo <b>KDEDIRS</b>, lai tas norādītu uz instalācijas augstākā līmeņa mapi.</p><p>Ja, piemēram, palaidāt „cmake“ ar <b>-DCMAKE_INSTALL_PREFIX=/usr/local/kde</b>, izmantojiet šādu vides mainīto (piemērs darbojas ar „Bash“ un saderīgām čaulām):</p><p><b>export KDEDIRS=/usr/local/kde</b></p><p>Tādā gadījumā, ja KDEDIRS ir jau iestatīts, vienkārši pievienojiet šo tekstu it kā jūs iestatītu <b>PATH</b> vides mainīgo</p>

source: No default setup file found
ar: لم أعثر على ملف تثبيت مبدئي
lv: Nav atrasta noklusējuma instalācijas datne

source: People
ar: الأشخاص
lv: Cilvēki

source: Places
ar: الأمكنة
lv: Vietas

source: Events
ar: الأحداث
lv: Notikumi

source: untagged
ar: (غير الموسوم)
lv: bez birkas

source: Error Running Demo
ar: خطأ تنفيذ العرض التوضيحي
lv: Kļūda, palaižot demonstrāciju

source: Unable to open '%1' for reading
ar: غير قادر على فتح '%1' للقراءة
lv: Neizdevās lasīšanai atvērt „%1“

source: line %1 column %2 in file %3: %4
ar: السطر %1 العمود %2 في الملف %3: %4
lv: %1. rinda, %2. kolonna datnē „%3“: %4

source: Failed to recover the backup: %1
ar: فشل استعادة النسخة الاحتياطية: %1
lv: Neizdevās atjaunot dublējumkopiju: %1

source: Error in file %1: No elements found
ar: خطأ في الملف %1: لم أجد إي عنصر
lv: Kļūda datnē „%1“: nav atrasts neviens elements

source: Error in file %1: expected 'KPhotoAlbum' as top element but found '%2'
ar: خطأ في الملف %1: كنت أتوقع 'دفتر الصور' ككل عنصر الأعلى و لكنني وجدتُ '%2'
lv: Kļūda datnē „%1“: kā augstāko elementu gaidīja „KPhotoAlbum“, bet atrada „%2“

source: <p>Could not save the image database to XML.</p>File %1 could not be opened because of the following error: %2
ar: <p>تعذر حفظ قاعدة بيانات الصور إلى XML.</p>تعذر فتح الملف %1 بسبب الخطأ التالي: %2
lv: <p>Neizdevās saglabāt attēlu datubāzi uz XML.</p>Datni „%1“ nevarēja atvērt šādas kļūdas dēļ: %2

source: Error while saving...
ar: خطأ أثناء الحفظ...
lv: Kļūda saglabājot...

source: <p>Failed to remove old version of image database.</p><p>Please try again or replace the file %1 with file %2 manually!</p>
ar: <p>فشل إزالة الإصدار القديم من قاعدة بيانات الصور.</p><p>يرجى المحاولة مرة أخرى أو استبدال الملف %1 بالملف %2 يدويًا!</p>
lv: <p>Neizdevās noņemt veco attēlu datubāzes versiju.</p><p>Mēģiniet vēlreiz vai manuāli aizvietojiet datni „%1“ ar datni „%2“!</p>

source: <p>Failed to move temporary XML file to permanent location.</p><p>Please try again or rename file %1 to %2 manually!</p>
ar: <p>فشل نقل ملف XML المؤقت إلى موقعه الدائم.</p><p>يرجى المحاولة مرة أخرى أو إعادة تسمية الملف %1 إلى %2 يدويًا!</p>
lv: <p>Neizdevās pārvietot pagaidu XML datni un pastāvīgo vietu.</p><p>Mēģiniet vēlreiz vai manuāli pārdēvējiet datni „%1“ par „%2“!</p>

source: Error creating zip file %1
ar: خطأ خلال إنشاء ملف zip %1
lv: Kļūda, veidojot ZIP datni „%1“

source: Error Making Numbered Backup
ar: خطأ في إنشاء نسخة احتياطية مرقمة
lv: Kļūda, veidojot numurētu dublējumkopiju

source: Error writing file %1 to zip file %2
ar: خطأ في كتابة الملف %1 إلى ملف zip %2
lv: Kļūda, rakstot datni „%1“ uz ZIP datni „%2“

source: Error reading next element
ar: خطأ في قراءة العنصر التالي
lv: Kļūda, lasot nākamo elementu

source: Expected to read a start or stop element, but read %1
ar: كان متوقعًا قراءة عنصر بدء أو توقف، ولكن قرأ %1
lv: Gaidīja nolasīt sākuma vai beigu elementu, bet nolasīja „%1“

source: Expected to read %1, but read %2
ar: كان متوقعًا قراءة %1، ولكن قرأ %2
lv: Gaidīja nolasīt „%1“, bet nolasīja „%2“

source: Expected to read an end element but read %1
ar: كان متوقعًا قراءة عنصر نهاية ولكن قرأ %1
lv: Gaidīja nolasīt beigu elementu, bet nolasīja „%1“

source: Expected to read start element '%1'
ar: كان متوقعًا قراءة عنصر البدء '%1'
lv: Gaidīja nolasīt sākuma elementu „%1“

source: <p>An error was encountered on line %1, column %2:<nl/><message>%3</message></p>
ar: <p>صادف خطأ في السطر %1، العمود %2:<nl/><message>%3</message></p>
lv: <p>%1. rindā un %2. kolonnā programma saskārās ar kļūdu:<nl/><message>%3</message></p>

source: <p>Additional error information:<nl/><message>%1</message></p>
ar: <p>معلومات خطأ إضافية:<nl/><message>%1</message></p>
lv: <p>Papildu informācija par kļūdu:<nl/><message>%1</message></p>

source: <p>Database path: <filename>%1</filename></p>
ar: <p>مسار قاعدة البيانات: <filename>%1</filename></p>
lv: <p>Ceļš uz datubāzi: <filename>%1</filename></p>

source: Error while reading database file
ar: حدث خطأ أثناء قراءة ملف قاعدة البيانات
lv: Kļūda, nolasot datubāzes datni

# @title:window
source: Exif Information and file metadata
ar: معلومات Exif وبيانات وصفية للملف
lv: „Exif“ informācija un datnes metadati

# @label:textbox The search box allows the user to filter by exif label names
source: Filter labels ...
ar: رشّح التسميات ...
lv: Filtrēt etiķetes...

source: IPTC character set:
ar: مجموعة أحرف IPTC:
lv: IPTC rakstzīmju kopa:

source: Exif info
ar: معلومات Exif
lv: „Exif“ informācija

source: File metadata
ar: بيانات وصفية للملف
lv: Datnes metadati

source: Absolute path:
ar: المسار المطلق:
lv: Absolūtais ceļš:

source: MIME type:
ar: نوع تنسيق الملف:
lv: MIME tips:

source: Size:
ar: الحجم:
lv: Izmērs:

source: Created:
ar: أُنشئ في:
lv: Izveidots:

source: Changed:
ar: مُعدل:
lv: Mainīts:

source: Owner:
ar: المالك:
lv: Īpašnieks:

source: Group:
ar: المجموعة:
lv: Grupa:

source: Permissions:
ar: الأذونات:
lv: Atļaujas:

source: Open folder with a file manager
ar: افتح المجلد باستخدام مدير الملفات
lv: Atvērt mapi datņu pārvaldniekā

source: %1 (%2 B)
ar: %1 (%2 بايت)

# File permission shortcut for "reading allowed"
source: r
ar: ق‌

# File permission shortcut for "writing allowed"
source: w
ar: ك

# File permission shortcut for "executing allowed"
source: x
ar: ت

# @title:window
source: Read Exif Info from Files
ar: اقرأ معلومات Exif من الملفات
lv: Nolasīt „Exif“ informāciju no datnēm

source: Update Exif search database
ar: حدّث قاعدة بيانات بحث Exif
lv: Atjaunināt „Exif“ meklēšanas datubāzi

source: Update image date
ar: حدِث تاريخ الصورة
lv: Atjaunināt attēla datumu

source: Use modification date if Exif not found
ar: استخدم تاريخ التعديل إذا لم يعثر على Exif
lv: Ja „Exif“ nav atrasts, izmantot datnes izmaiņu datumu

source: Update image orientation from Exif information
ar: حدّث اتجاه الصورة من معلومات Exif
lv: Atjaunināt attēla orientāciju, ievērojot „Exif“ informāciju

source: Update image description from Exif information
ar: حدّث وصف الصورة من معلومات Exif
lv: Atjaunināt attēla aprakstu no „Exif“ informācijas

source: Affected Files
ar: الملفات المتأثرة
lv: Skartās datnes

source: <p>Be aware that setting the data from Exif may <b>overwrite</b> data you have previously entered manually using the image configuration dialog.</p>
ar: <p>كن على علم أن تعيين البيانات من Exif قد <b>يكتب فوق</b> البيانات التي أدخلتها يدويًا مسبقًا باستخدام حوار ضبط الصورة.</p>
lv: <p>Uzmanieties — „Exif“ datu izmantošana var <b>pārrakstīt</b> datus, kurus iepriekš manuāli ievadījāt, izmantojot attēla konfigurācijas lodziņu.</p>

source: Override image dates
ar: تجاوز تواريخ الصور
lv: Pārrakstīt attēla datumus

# @title:window
source: Exif Search
ar: بحث Exif
lv: „Exif“ meklēšana

source: Settings
ar: التعيينات
lv: Iestatījumi

source: Aperture (F Number)
ar: فتحة العدسة (رقم F)
lv: Diafragma (F skaitlis)

source: Focal Length
ar: طول البؤرة
lv: Fokusa attālums

# As in 'A range from x to y'
source: to
ar: إلى
lv: līdz

# This is millimeter for focal length, like 35mm
source: mm
ar: مم

source: Camera
ar: الكاميرا
lv: Kamera

source: Lens
ar: العدسة
lv: Lēca

source: Miscellaneous
ar: متنوّع
lv: Dažādi

source: Iso setting
ar: تعيينات الــ Iso
lv: ISO iestatījums

# Example 1.6 secs (as in seconds)
source: secs.
ar: ثا
lv: sek.

source: 1 second
ar: ثانية واحدة
lv: 1 sekunde

source: Exposure time
ar: زمن التعرض
lv: Ekspozīcijas laiks

source: Exposure Program
ar: برنامج التعرض
lv: Ekspozīcijas režīms

source: Orientation
ar: الاتّجاه
lv: Orientācija

source: Metering Mode
ar: نمط القياس
lv: Gaismas mērīšanas režīms
