Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: Auto saving.... Done
ar: انتهى الحفظ الآليّ....
lv: Automātiskā saglabāšana... pabeigta

source: <p>Do you want to create this database file?<br />%1</p>
ar: <p>هل تريد إنشاء ملف قاعدة البيانات هذا؟<br />%1</p>
lv: <p>Vai vēlaties izveidot šo datubāzes datni?<br />%1</p>

# @title
source: Create database
ar: أنشئ قاعدة بيانات
lv: Izveidot datubāzi

source: <p>You have configured a tag for untagged images, but either the tag itself or its category does not exist in the database.</p><p>Please review your untagged tag setting under <interface>Settings|Configure KPhotoAlbum...|Categories</interface></p>
ar: <p>لقد ضبطت وسم للصور غير الموسومة، ولكن إما أن الوسم نفسه أو فئته غير موجود في قاعدة البيانات.</p><p>يرجى مراجعة إعداد الوسم غير الموسوم الخاص بك تحت <interface>الإعدادات|ضبط دفتر الصور...|الفئات</interface></p>
lv: <p>Jūs konfigurējāt birku attēliem bez birkas, tomēr pati birka vai tās kategorija datubāzē nepastāv.</p><p>Lūdzu, pārskatiet nebirkoto birku iestatījumu izvēlnē <interface>Iestatījumi|Konfigurēt „KPhotoAlbum“...|Kategorijas</interface></p>

source: General
ar: عام
lv: Pamata

source: Viewer
ar: المستعرض
lv: Skatītājs

# I.e. the timeline histogram widget
source: Date Bar
ar: شريط التاريخ
lv: Datumu josla

source: Annotation Dialog
ar: حوار إضافة التعليق
lv: Anotācijas lodziņš

source: Thumbnail View
ar: عرض المصغرات
lv: Sīktēlu skats

source: <p>Really enable all message boxes where you previously checked the do-not-show-again check box?</p>
ar: <p>هل تريد حقًا تمكين جميع مربعات الرسائل حيث حددت سابقًا خانة الاختيار 'عدم الإظهار مرة أخرى'؟</p>
lv: <p>Vai tiešām ieslēgt visus ziņojumu lauciņus vietās, kur norādījāt, lai programma tos vairāk nerāda?</p>

# @title
source: Reset hidden dialogs
ar: صفّر الحوارات المخفية
lv: Atiestatīt slēptos lodziņus

source: <p>KPhotoAlbum hit an internal error (missing plug-in menu in MainWindow::Window::setupPluginMenu). This indicate that you forgot to do a make install. If you did compile KPhotoAlbum yourself, then please run make install. If not, please report this as a bug.</p><p>KPhotoAlbum will continue execution, but it is not entirely unlikely that it will crash later on due to the missing make install.</p>
ar: <p>واجه دفتر الصور خطأً داخليًا (قائمة المكونات الإضافية مفقودة في MainWindow::Window::setupPluginMenu). يشير هذا إلى أنك نسيت إجراء make install. إذا قمت بتجميع دفتر الصور بنفسك، فيرجى تشغيل make install. إذا لم تقم بذلك، فيرجى الإبلاغ عن هذا كخطأ.</p><p>سيستمر دفتر الصور في التنفيذ، ولكن ليس من المستبعد تمامًا أن يتعطل لاحقًا بسبب عدم إجراء make install.</p>
lv: <p>„KPhotoAlbum“ saskārās ar iekšēju kļūdu (trūkst spraudņa izvēlnes vietā: MainWindow::Window::setupPluginMenu). Tas nozīmē, ka aizmirsāt veikt „make install“. Ja „KPhotoAlbum“ kompilējāt šajā ierīce, palaidiet „make install“. Ja ne, ziņojiet par šo kļūdu.</p><p>„KPhotoAlbum“ turpinās darboties, bet ir ļoti iespējams, ka tas kādā brīdī avarēs, jo tam trūkst „make install“.</p>

source: Internal Error
ar: خطأ داخليّ
lv: Iekšēja kļūda

source: Successfully shared image(s). Copying location to clipboard...
ar: شارك الصور بنجاح. ينسخ الموقع إلى الحافظة...
lv: Veiksmīgi kopīgots attēls(-i). Kopē atrašanās vietu starpliktuvē...

source: Successfully shared image(s).
ar: شارك الصور بنجاح.
lv: Veiksmīgi kopīgots attēls(-i).

source: Image sharing failed with message: %1
ar: فشلت مشاركة الصور مع الرسالة: %1
lv: Attēlu kopīgošana neizdevās ar ziņojumu: %1

source: Open List of Files
ar: افتح قائمة الملفات
lv: Atvērt datņu sarakstu

source: You can open a set of files in KPhotoAlbum's database by listing the files here.
ar: يمكنك فتح مجموعة من الملفات في قاعدة بيانات دفتر الصور عن طريق سرد الملفات هنا.
lv: Varat „KPhotoAlbum“ programmā atvērt uzreiz vairākas datnes, tās uzskaitot te.

source: No images matching your input were found.
ar: لم يعثر على أي صور تطابق إدخالك.
lv: Nav atrasti attēlu, kas atbilstu ievadei.

source: No Matches
ar: لا يوجد تطابق
lv: Nav atbilstību

source: Rereading Exif information from all images
ar: يعيد قراءة معلومات Exif من جميع الصور
lv: No jauna nolasa „Exif“ informāciju no visiem attēliem

# @info:status
source: Thumbnail width: %1px (storage size: %2px)
ar: عرض الصورة المصغرة: %1 بكسل (حجم التخزين: %2 بكسل)
lv: Sīktēlu skats: %1 piks. (glabāšanas izmērs: %2 piks.)

source: <p>Unable to find ffmpeg on the system.</p><p>Without it, KPhotoAlbum will not be able to display video thumbnails and video lengths. Please install the ffmpeg package</p>
ar: <p>تعذر العثور على ffmpeg على النظام.</p><p>بدونه، لن يتمكن دفتر الصور من عرض الصور المصغرة للفيديو وأطوال الفيديو. يرجى تثبيت حزمة ffmpeg</p>
lv: <p>Neizdodas sistēmā atrast „ffmpeg“.</p><p>Bez tā „KPhotoAlbum“ nespēs parādīt video sīktēlus un noteikt video garumu. Ieinstalējiet „ffmpeg“ pakotni</p>

source: Video thumbnails are not available
ar: الصور المصغرة للفيديو غير متوفرة
lv: Video sīktēli nav pieejami

source: Save the current map settings
ar: احفظ إعدادات الخريطة الحالية
lv: Saglabāt pašreizējos kartes iestatījumus

source: Go to last map position
ar: انتقل إلى آخر موضع على الخريطة
lv: Iet uz kartes vietu

source: Show thumbnails
ar: أظهر المصغرات
lv: Rādīt sīktēlus

# @action to group, as in aggregate thumbnails into clusters
source: Group adjacent thumbnails into clickable clusters
ar: جمّع الصور المصغرة المتجاورة في عناقيد قابلة للنقر
lv: Grupēt blakus esošos sīktēlus klikšķināmos kopumos

# @action Decrease size of the markers (i.e. thumbnails) drawn on the map
source: Decrease marker size
ar: صغّر حجم العلامات
lv: Samazināt marķiera izmēru

# @action Increase size of the markers (i.e. thumbnails) drawn on the map
source: Increase marker size
ar: كبّر حجم العلامات
lv: Palielināt marķiera izmēru

source: Map view
ar: عرض الخريطة
lv: Kartes skats

source: <i>Loading coordinates from the images ...</i>
ar: <i>يحمل الإحداثيات من الصور ...</i>
lv: <i>Ielādē koordinātas no attēliem...</i>

source: <i>This image does not contain geographic coordinates.</i>
ar: <i>هذه الصورة لا تحتوي على إحداثيات جغرافية.</i>
lv: <i>Šis attēls nesatur ģeogrāfiskas koordinātas.</i>

source: <i>Some of the selected images do not contain geographic coordinates.</i>
ar: <i>بعض الصور المحددة لا تحتوي على إحداثيات جغرافية.</i>
lv: <i>Daži no atlasītajiem attēliem nesatur ģeogrāfiskās koordinātas.</i>

source: <i>Search for geographic coordinates.</i>
ar: <i>ابحث عن إحداثيات جغرافية.</i>
lv: <i>Meklēt ģeogrāfiskās koordinātas.</i>

source: <i>None of the selected images contain geographic coordinates.</i>
ar: <i>لا تحتوي أي من الصور المحددة على إحداثيات جغرافية.</i>
lv: <i>Neviens no atlasītajiem attēliem nesatur ģeogrāfiskās koordinātas.</i>

source: Share
ar: شارك
lv: Kopīgot

source: This icon indicates if KPhotoAlbum is connected to an android device. Click on the icon to toggle listening for clients in the local area network. If the local area network doesn't allow broadcast packages between the android client and KPhotoAlbum, then right click on the icon and specify the android device's address. The android client can be downloaded from google play.
ar: أندرويد الأيقونة إلى ما إذا كان دفتر الصور متصلاً بجهاز أندرويد. انقر على الأيقونة لتبديل الاستماع للعملاء في شبكة المنطقة المحلية. إذا لم تسمح شبكة المنطقة المحلية بحزم البث بين عميل الأندرويد ودفتر الصور، فانقر بزر الفأرة الأيمن على الأيقونة وحدد عنوان جهاز الأندرويد. يمكن تنزيل عميل الأندرويد من متجر جوجل بلاي.
lv: Šī ikona norāda, a „KPhotoAlbum“ ir savienots ar „Android“ ierīci. Klikšķiniet uz ikonas, lai ieslēgtu vai izslēgtu klientu meklēšanu lokālajā tīklā. Ja lokālais tīkls neļauj pārraidīt pakotnes starp „Android“ klientu un „KPhotoAlbum“, spiediet ar peles labo pogu uz ikonas un norādiet „Android“ ierīces adresi. „Android“ klientu varat lejupielādēt no „Google Play“.

source: Android device address:
ar: عنوان جهاز أندرويد:
lv: „Android“ ierīces adrese:

source: Unable to bind to socket
ar: تعذر الربط بالمقبس
lv: Neizdodas piesaistīt ligzdai

source: Unable to listen for remote Android connections. This is likely because you have another KPhotoAlbum application running.
ar: تعذر الاستماع لاتصالات أندرويد البعيدة. يُرجح أن ذلك بسبب تشغيل تطبيق دفتر الصور آخر.
lv: Neizdodas klausīties attālus „Android“ savienojumus. Iespējams, sistēmā ir palaista vēl viena „KPhotoAlbum“ programmas instance.

source: Invalid Version
ar: إصدار غير صالح
lv: Nederīga versija

source: Version mismatch between Remote Client and KPhotoAlbum on the desktop. Desktop protocol version: %1 Remote Control protocol version: %2
ar: عدم تطابق الإصدار بين العميل البعيد ودفتر الصور على سطح المكتب. إصدار ميفاق سطح المكتب: %1 إصدار ميفاق التحكم عن بعد: %2
lv: Versiju neatbilstība starp attālā klienta un „KPhotoAlbum“ datora versiju. Darbvirsmas protokola versija: %1 Attālās kontroles protokola versija: %2

# @label:textedit
source: Filter ... (%1)
ar: المرشح... (%1)
lv: Filtrēt... (%1)

source: Remove birthday
ar: أزل تاريخ الميلاد
lv: Noņemt dzimšanas dienu

source: Set the date of birth for items (say people) here, and then see their age when viewing the images.
ar: اضبط تاريخ الميلاد للعناصر (كالأشخاص) هنا، ثم شاهد أعمارهم عند عرض الصور.
lv: Te varat norādīt dzimšanas datumu cilvēkiem vai objektiem, lai, skatot attēlus, redzētu to vecumu.

source: Name
ar: الاسم
lv: Vārds/nosaukums

source: Birthday
ar: عيد ميلاد
lv: Dzimšanas diena

source: Birthday of %1:
ar: تاريخ ميلاد %1:
lv: %1 dzimšanas diena:

source: Enter a date...
ar: أدخل تاريخًا...
lv: Norādiet datumu...

source: <i>Select an item on the left to edit the birthday</i>
ar: <i>حدد عنصرًا على اليسار لتعديل تاريخ الميلاد</i>
lv: <i>Atlasiet vārdu/nosaukumu kreisajā pusē, lai rediģētu dzimšanas dienu</i>

source: Category Settings
ar: إعدادات الفئة
lv: Kategorijas iestatījumi

source: New
ar: جديد
lv: Jauna

source: Rename
ar: غيّر الاسم
lv: Pārdēvēt

source: Positionable tags:
ar: الوسوم القابلة للتحديد:
lv: Pozicionējamās birkas:

source: Tags in this category can be associated with areas within images
ar: يمكن ربط الوسوم في هذه الفئة بمناطق داخل الصور
lv: Birkas šajā kategorijā iespējams sasaistīt ar zonām attēlos

source: Icon:
ar: الأيقونة:
lv: Ikona:

source: Preferred view:
ar: العرض المفضل:
lv: Vēlamais skats:

source: List View
ar: عرض مسرد
lv: Saraksta skats

source: List View with Custom Thumbnails
ar: عرض قائمة مع مصغرات مخصصة
lv: Saraksta skats ar pielāgotiem sīktēliem

source: Icon View
ar: عرض أيقوني
lv: Ikonu skats

source: Icon View with Custom Thumbnails
ar: عرض أيقونة مع مصغرات مخصصة
lv: Ikonu skats ar pielāgotiem sīktēliem

source: <font color='red'>The database has unsaved changes. As long as those are not saved,<br/>the names of categories can't be changed and new ones can't be added.</font>
ar: <font color='red'>قاعدة البيانات تحتوي على تغييرات غير محفوظة. طالما لم تحفظ هذه التغييرات،<br/>لا يمكن تغيير أسماء الفئات ولا يمكن إضافة فئات جديدة.</font>
lv: <font color='red'>Datubāze satur nesaglabātas izmaiņas. Kamēr tās nav saglabātas<br/>kategoriju nosaukumus nevar mainīt, kā arī nevar pievienot jaunas kategorijas.</font>

source: Save the DB now
ar: احفظ قاعدة البيانات الآن
lv: Saglabāt DB

source: Settings for category <b>%1</b>
ar: إعدادات الفئة <b>%1</b>
lv: <b>%1</b> kategorijas iestatījumi

source: <i>Pending change: rename to "%1"</i>
ar: <i>تغيير معلق: إعادة تسمية إلى "%1"</i>
lv: <i>Gaida izmaiņas: pārdēvēt par „%1“</i>

source: <p>Can't change the name of category "%1" to "%2":</p><p>"%2" is a special category name which is reserved and can't be used for a normal category.</p>
ar: <p>لا يمكن تغيير اسم الفئة "%1" إلى "%2":</p><p>"%2" هو اسم فئة خاص محجوز ولا يمكن استخدامه لفئة عادية.</p>
lv: <p>Neizdodas pārdēvēt „%1“ kategoriju par „%2“:</p><p>„%2“ ir speciālas kategorijas nosaukums, kas ir rezervēts, tāpēc to nevar izmantot parastai kategorijai.</p>

source: Invalid category name
ar: اسم فئة غير صالح
lv: Nederīgs kategorijas nosaukums

source: <p>Can't change the name of category "%1" to "%2":</p><p>A category with this name already exists.</p>
ar: <p>لا يمكن تغيير اسم الفئة "%1" إلى "%2":</p><p>فئة بهذا الاسم موجودة فعلًا.</p>
lv: <p>Neizdodas pārdēvēt „%1“ kategoriju par „%2“:</p><p>Kategorija ar šādu nosaukumu jau pastāv.</p>

source: <p>Can't change the name of category "%1" to "%2":</p><p>There's a pending rename action on the category "%2". Please save this change first.</p>
ar: <p>لا يمكن تغيير اسم الفئة "%1" إلى "%2":</p><p>يوجد إجراء إعادة تسمية معلق على الفئة "%2". يرجى حفظ هذا التغيير أولاً.</p>
lv: <p>Neizdodas pārdēvēt „%1“ kategoriju par „%2“:</p><p>Kategorijā „%2“ jau rindā ir pārdēvēšanas darbība. Vispirms nomainiet nosaukumu.</p>

source: Unsaved pending renaming action
ar: إجراء إعادة تسمية معلق غير محفوظ
lv: Nesaglabāta rindā esoša pārdēvēšanas darbība

source: <p>Do you really want to make "%1" non-positionable?</p><p>All areas linked against this category will be discarded!</p>
ar: <p>هل تريد حقًا جعل "%1" غير قابلة للتحديد؟</p><p>سيتجاهل جميع المناطق المرتبطة بهذه الفئة!</p>
lv: <p>Vai tiešām vēlaties „%1“ padarīt par nepozicionējamu?</p><p>Visas zonas, kas sasaistītas ar šo kategoriju, tiks izmestas!</p>

# @title
source: Confirm Action
ar: أكّد إجراء
lv: Darbības apstiprināšana

source: New category
ar: فئة جديدة
lv: Jauna kategorija

source: <p>Really delete category "%1"?</p>
ar: <p>هل تريد حقًا حذف الفئة "%1"؟</p>
lv: <p>Vai tiešām dzēst kategoriju „%1“?</p>

source: Confirm Action
ar: أكد الإجراء
lv: Apstipriniet darbību

source: <i>Choose a category to edit it</i>
ar: <i>اختر فئة لتعديلها</i>
lv: <i>Izvēlieties rediģējamo kategoriju</i>

source: Choose speed over readability for the XML database file
ar: اختر السرعة على قابلية القراءة لملف قاعدة بيانات XML
lv: Izvēlēties ātrumu pāri nolasamībai XML datubāzes datnei

source: Compress backup files
ar: اضغط ملفات النسخ الاحتياطي
lv: Saspiest dublējumdatnes

source: Auto save every:
ar: احفظ آليّاً كلّ:
lv: Automātiski saglabāt ik pēc:

source: min.
ar: دقائق

source: Number of backups to keep:
ar: عدد النسخ الاحتياطية المحافظ عليها:
lv: Paturamo dublējumkopiju skaits:

source: Infinite
ar: لا نهائي
lv: Bezgalīgs

source: <p>KPhotoAlbum is capable of backing up the the XML database file by keeping copies (for example, for a database file named index.xml, the backups are named index.xml~0001~, index.xml~0002~ etc.) and you can use the spinbox to specify the number of backup files to keep. KPhotoAlbum will delete the oldest backup file when it reaches the maximum number of backup files.</p><p>The the XML database file may grow substantially if you have many images, and in that case it is useful to ask KPhotoAlbum to zip the backup files to preserve disk space.</p>
ar: <p> يستطيع دفتر الصور عمل نسخ احتياطية لملف قاعدة بيانات XML عن طريق الاحتفاظ بنسخ (على سبيل المثال، لملف قاعدة بيانات باسم index.xml، تُسمى النسخ الاحتياطية index.xml~0001~, index.xml~0002~ إلخ.) ويمكن استخدام مربع التدوير لتحديد عدد ملفات النسخ الاحتياطي المطلوب الاحتفاظ بها. سيحذف دفتر الصور أقدم ملف نسخ احتياطي عند الوصول إلى الحد الأقصى لعدد ملفات النسخ الاحتياطي.</p><p>قد ينمو ملف قاعدة بيانات XML بشكل كبير إذا كان لديك العديد من الصور، وفي هذه الحالة من المفيد طلب ضغط ملفات النسخ الاحتياطي من دفتر الصور للحفاظ على مساحة القرص.</p>
lv: <p>„KPhotoAlbum“ var izveidot XML datubāzes rezerves kopijas (piemēram, datubāzes datnei ar nosaukumu „index.xml“ dublējumkopijas datnes tiks nosauktas „index.xml~0001~“, „index.xml~0002~“ utt.), kā arī skaitļu rūtiņā varat norādīt paturamo dublējumu datņu skaitu. Sasniedzot maksimālo dublējumu datņu skaitu, „KPhotoAlbum“ izdzēsīs vecāko dublējuma datni.</p><p>XML datubāzes datne var strauji pieaugt, ja jums ir daudz attēlu. Šādā gadījumā ir lietderīgi lūgt „KPhotoAlbum“ saspiest dublējumu datnes, lai ietaupītu vietu.</p>

source: <p>KPhotoAlbum is using a single XML file as its <i>data base</i>. With lots of images it may take a long time to read this file. You may cut down this time to approximately half, by checking this check box. The disadvantage is that the XML database file is less readable by human eyes.</p>
ar: <p>يستخدم دفتر الصور ملف XML واحدًا كـ <i>قاعدة بيانات</i> له. مع الكثير من الصور، قد يستغرق قراءة هذا الملف وقتًا طويلاً. يمكن تقليل هذا الوقت إلى النصف تقريبًا، بوضع علامة في مربع الاختيار هذا. العيب هو أن ملف قاعدة بيانات XML يصبح أقل قابلية للقراءة بالعين البشرية.</p>
lv: <p>„KPhotoAlbum“ kā <i>datubāzi</i> izmanto atsevišķu XML datni. Daudzu attēlu gadījumā šīs datnes nolasīšana var aizņemt vairāk laika. Nolasīšanu var padarīt aptuveni divreiz ātrāku, atzīmējot šo rūtiņu. Mīnuss tam ir tāds, ka XML datubāzes datni būs grūtāk nolasīt cilvēkam.</p>

source: Exif/IPTC info to show in the viewer
ar: معلومات Exif/IPTC التي تظهر في العارض
lv: „Exif“/IPTC informācija parādīšanai skatītājā

source: Exif/IPTC info to show in the Exif dialog
ar: معلومات Exif/IPTC التي تظهر في حوار Exif
lv: „Exif“/IPTC informācija parādīšanai „Exif“ lodziņā

source: Character set for image metadata:
ar: مجموعة الأحرف لبيانات وصفية للصورة:
lv: Rakstzīmju kopa attēlu metadatiem:

source: New File Searches
ar: عمليات البحث عن ملفات جديدة
lv: Jaunu datņu meklēšanas

source: Search for new images and videos on startup
ar: ابحث عن الصور و الفيديوهات الجديدة عند بدء التشغيل
lv: Palaižot programmu, meklēt jaunus attēlus un video

source: Ignore file extensions when searching for new images and videos
ar: تجاهل امتدادات الملفات عند البحث عن صور وفيديوهات جديدة
lv: Meklējot jaunus attēlus un video, ignorēt datņu paplašinājumus

source: Skip symbolic links when searching for new images
ar: تخطى الروابط الرمزية عند البحث عن صور جديدة
lv: Meklējot jaunus attēlus, izlaist simboliskās saites

source: Do not read RAW files if a matching JPEG/TIFF file exists
ar: لا تقرأ ملفات RAW إذا كان هناك ملف JPEG/TIFF مطابق موجود
lv: Ja pastāv atbilstošs JPEG/TIFF, nelasīt attiecīgās RAW datnes.

source: Directories to exclude from new file search:
ar: المجلدات التي تستثنى من البحث عن ملفات جديدة:
lv: Mapes, ko izlaist no jaunas datnes meklēšanas:

source: <p>Specify a comma-separated list of folder names to ignore.</p><p>For example, specifying "<tt>.thumbs,.thumbnails</tt>" here will cause KPhotoAlbum to ignore these two folder names in any folder when searching for new images.</p>
ar: <p>حدد قائمة بأسماء المجلدات التي يجب تجاهلها، مفصولة بفواصل.</p><p>على سبيل المثال، تحديد"<tt>.thumbs,.thumbnails</tt>" هنا سيجعل دفتر الصور يتجاهل هذين الاسمين في أي مجلد عند البحث عن صور جديدة.</p>
lv: <p>Norādiet ar komatu atdalītu mapju sarakstu, kuras ignorēt.</p><p>Piemēram, te norādot „<tt>.thumbs,.thumbnails</tt>“, „KPhotoAlbum“ ignorēs mapes ar šādiem diviem nosaukumiem jebkurā vietā, kur programma meklēs attēlus.</p>

source: <p>KPhotoAlbum is capable of searching for new images and videos when started, this does, however, take some time, so instead you may wish to manually tell KPhotoAlbum to search for new images using <b>Maintenance->Rescan for new images</b></p>
ar: <p>يستطيع دفتر الصور البحث عن صور وفيديوهات جديدة عند بدء التشغيل، لكن هذا يستغرق بعض الوقت، لذا قد تفضل إخبار دفتر الصور يدويًا بالبحث عن صور جديدة باستخدام <b>الصيانة->إعادة فحص للبحث عن صور جديدة</b></p>
lv: <p>„KPhotoAlbum“ var programmas atvēršanas laikā pārskatīt, vai norādītajās mapēs nav jaunu video un attēlu, tomēr tas var prasīt laiku, tāpēc tā vietā varat izvēlēties likt „KPhotoAlbum“ jaunus attēlus meklēt tikai tad, kad to norādāt, izmantojot <b>Apkope—>Pārskenēt mapes</b></p>

source: <p>KPhotoAlbum will normally search new images and videos by their file extension. If this option is set, <em>all</em> files neither in the database nor in the block list will be checked by their Mime type, regardless of their extension. This will take significantly longer than finding files by extension!</p>
ar: <p>سيبحث دفتر الصور عادةً عن الصور والفيديوهات الجديدة عن طريق امتداد ملفها. إذا عينت هذا الخيار، سيفحص <em>جميع</em> الملفات غير الموجودة في قاعدة البيانات أو في قائمة الحظر حسب نوع Mime الخاص بها، بغض النظر عن امتدادها. هذا سيستغرق وقتًا أطول بكثير من إيجاد الملفات بالامتداد!</p>
lv: <p>Parasti „KPhotoAlbum“ jaunus attēlus un datnes meklēs pēc datņu paplašinājuma. Atlasot šo opciju, <em>visas</em> datnes, kas nav datubāzē un bloķēšanas sarakstā tiks pārskatītas pēc to MIME tipa, neskatoties uz to paplašinājumu. Tas aizņems daudz vairāk laika nekā meklēšana pēc paplašinājuma!</p>

source: <p>KPhotoAlbum attempts to read all image files whether actual files or symbolic links. If you wish to ignore symbolic links, check this option. This is useful if for some reason you have e.g. both the original files and symbolic links to these files within your image folder.</p>
ar: <p>يحاول دفتر الصور قراءة جميع ملفات الصور سواء كانت ملفات فعلية أو روابط رمزية. إذا أردت تجاهل الروابط الرمزية، ضع علامة على هذا الخيار. هذا مفيد إذا كان لديك لسبب ما، على سبيل المثال، كل من الملفات الأصلية والروابط الرمزية لهذه الملفات داخل مجلد الصور الخاص بك.</p>
lv: <p>Parasti „KPhotoAlbum“ jaunus attēlus un datnes meklēs pēc datņu paplašinājuma. Atlasot šo opciju, <em>visas</em> datnes, kas nav datubāzē un bloķēšanas sarakstā tiks pārskatītas pēc to MIME tipa, neskatoties uz to paplašinājumu. Tas aizņems daudz vairāk laika nekā meklēšana pēc paplašinājuma!</p>

source: <p>KPhotoAlbum is capable of reading certain kinds of RAW images. Some cameras store both a RAW image and a matching JPEG or TIFF image. This causes duplicate images to be stored in KPhotoAlbum, which may be undesirable. If this option is checked, KPhotoAlbum will not read RAW files for which matching image files also exist.</p>
ar: <p>يستطيع دفتر الصور قراءة أنواع معينة من صور RAW. بعض الكاميرات تخزن كل من صورة RAW وصورة JPEG أو TIFF مطابقة. هذا يتسبب في تخزين صور مكررة في دفتر الصور، وهو ما قد يكون غير مرغوب فيه. إذا وُضعت علامة على هذا الخيار، فلن يقرأ دفتر الصور ملفات RAW التي توجد لها ملفات صور مطابقة أيضًا.</p>
lv: <p>„KPhotoAlbum“ spēj nolasīt noteikta veida RAW attēlus. Dažas fotokameras saglabā gan RAW attēlu, gan tam atbilstošu JPEG vai TIFF attēlu. Tas var novest pie dublējošos attēlu uzglabāšanas „KPhotoAlbum“, kas var nebū vēlams. Atzīmējot šo opciju, „KPhotoAlbum“ nelasīs RAW datnes, kurām pastāv arī attiecīga attēla datne.</p>

source: <p>Directories defined here (separated by comma <tt>,</tt>) are skipped when searching for new photos. Thumbnail directories of different tools should be configured here. E.g. <tt>xml,ThumbNails,.thumbs,.thumbnails</tt>.</p>
ar: <p> المجلدات المعرفة هنا (مفصولة بفاصلة <tt>,</tt>) ستُتخطى عند البحث عن صور جديدة. يجب ضبط مجلدات الصور المصغرة للأدوات المختلفة هنا. مثال: <tt>xml,ThumbNails,.thumbs,.thumbnails</tt>.</p>
lv: <p>Te varat definēt mapes (atdalot ar komatu <tt>,</tt>), kuras programma izlaidīs, meklējot jaunus attēlus. Te ir konfigurējamas dažādu rīku sīktēlu mapes. Piemēram, <tt>xml,ThumbNails,.thumbs,.thumbnails</tt>.</p>

source: File Version Detection Settings
ar: إعدادات اكتشاف إصدار الملف
lv: Datnes versijas noteikšanas iestatījumi

source: Try to detect multiple versions of files
ar: حاول اكتشاف إصدارات متعددة للملفات
lv: Mēģināt noteikt, vai datnei ir vairākas versijas

source: File versions search regexp:
ar: التعبير النمطي للبحث عن إصدارات الملف:
lv: Datnes versijas meklēšanas regulārā izteiksme:

source: Original file replacement text:
ar: نص استبدال الملف الأصلي:
lv: Oriģinālās datnes aizstāšanas teksts:

source: Move meta-data (i.e. delete tags from the original)
ar: انقل البيانات الوصفية (أي احذف الوسوم من الأصل)
lv: Pārvietot metadatus (piemēram, dzēst birkas oriģinālajā datnē)

source: Automatically stack new versions of images
ar: كدّس إصدارات الصور الجديدة آليًا
lv: Automātiski grēdot jaunas attēlu versijas
