Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: <h2><a name="video">Video support</a></h2><p>KPhotoAlbum relies on phonon or VLC for displaying videos</p><h2><a name="videoPreview">Video thumbnail support</a></h2><p>KPhotoAlbum can use <tt>ffmpeg</tt> to extract thumbnails from videos. These thumbnails are used to preview videos in the thumbnail viewer.</p><p>This feature is only available if FFmpeg is installed.</p><h2><a name="videoInfo">Video metadata support</a></h2><p>KPhotoAlbum can use <tt>ffprobe</tt> to extract length information from videos. Correct length information is necessary for correct rendering of video thumbnails.</p><p>This feature is only available if ffprobe is installed. Usually, ffprobe is also part of the FFmpeg package.</p>
ar: <h2><a name="video">دعم الفيديو</a></h2><p>يعتمد دفتر الصور على phonon أو VLC لعرض مقاطع الفيديو</p><h2><a name="videoPreview">دعم الصور المصغرة للفيديو</a></h2><p>يمكن لـ دفتر الصور استخدام <tt>ffmpeg</tt> لاستخراج صور مصغرة من مقاطع الفيديو. تُستخدم هذه الصور المصغرة للمعاينة المسبقة لمقاطع الفيديو في عارض الصور المصغرة.</p><p>هذه الميزة متاحة فقط إذا كان FFmpeg مثبتًا.</p><h2><a name="videoInfo">دعم بيانات وصف الفيديو</a></h2><p>يمكن لـ دفتر الصور استخدام <tt>ffprobe</tt> لاستخراج معلومات الطول من مقاطع الفيديو. معلومات الطول الصحيحة ضرورية لعرض صور الفيديو المصغرة بشكل صحيح.</p><p>هذه الميزة متاحة فقط إذا كان ffprobe مثبتًا. عادةً، يكون ffprobe جزءًا من حزمة FFmpeg أيضًا.</p>
lv: <h2><a name="video">Video atbalsts</a></h2><p>„KPhotoAlbum“ video atskaņošanai izmanto „phonon“ vai VLC</p><h2><a name="videoPreview">Video sīktēlu atbalsts</a></h2><p>„KPhotoAlbum“ sīktēlu izveidošanai no izmanto <tt>ffmpeg</tt>. Šie sīktēli tiek izmantoti videoceliņu priekšskatīšanai sīktēlu skatā.</p><p>Šī iespēja darbojas tikai tad, ja ir instalēts „FFmpeg“.</p><h2><a name="videoInfo">Video meatadatu atbalsts</a></h2><p>Video garuma uzzināšanai „KPhotoAlbum“ izmanto <tt>ffprobe</tt>. Lai pareizi izveidotu video sīktēlus, programmai ir jāzina video garums.</p><p>Šī iespēja ir pieejama tikai tad, ja ir instalēts „ffprobe“. Parasti „ffprobe“ ir daļa no „FFmpeg“ pakotnes.</p>

# This should match the heading in the text above
source: Purpose plugin support
ar: إتاحة إضافة Purpose
lv: „Purpose“ spraudņa atbalsts

# This should match the heading in the text above
source: Map view for geotagged images.
ar: عرض الخريطة للصور ذات الوسم الجغرافي.
lv: Kartes skates attēliem ar saglabātām koordinātēm.

# This should match the heading in the text above
source: SQLite database support
ar: دعم قاعدة بيانات SQLite
lv: „SQLite“ datubāzes atbalsts

# This should match the heading in the text above
source: Video thumbnail support
ar: إتاحة مصغرات الفيديو
lv: Video sīktēla atbalsts

# This should match the heading in the text above
source: Video metadata support
ar: إتاحة بيانات وصف للفيديو
lv: Video metadatu atbalsts

# Feature available
source: Yes
ar: نعم
lv: Jā

# Feature not available
source: No
ar: لا
lv: Nē

source: Showing 1 thumbnail
ar: لا يُظهر أي مصغّرة
lv: Rādīt %1 sīktēlu

source: (%1 selected)
ar: (%1 محدّد)
lv: (%1 atlasīts)

source: Total: %1
ar: المجموع: %1
lv: Kopā: %1

source: 1 match
ar: لا يوجد تطابق
lv: %1 atbilsme

# @title:window
source: Search for Images and Videos with Missing Dates
ar: ابحث عن الصور ومقاطع الفيديو التي تفتقد التواريخ
lv: Meklēt attēlus un video ar trūkstošiem datumiem

source: Which Images and Videos to Display
ar: أي صور و مرئيات للعرض
lv: Kurus attēlus un video parādīt

source: Search for images and videos with a valid date but an invalid time stamp
ar: ابحث عن الصور و المرئيات ذات التاريخ الصالح و لكن ذات دمغة التوقيت غير الصالحة
lv: Meklēt attēlus un video ar derīgu datumu, bet nederīgu laika zīmogu

source: Search for images and videos missing date and time
ar: ابحث عن الصور و المرئيات ذات التاريخ و دمغة التوقيت المفقودة
lv: Meklēt attēlus un video ar trūkstošu datumu un laiku

source: Search for images and videos with only partial dates (like 1971 vs. 11/7-1971)
ar: ابحث عن الصور و المرئيات ذات التاريخ غير التام ( مثلاً 1971 عن 11/7/1971 )
lv: Meklēt attēlus un video ar tikai daļējiem datumiem (piemēram, 1971, bet ne 07.11.1971.)

# @title:window
source: Image Info
ar: معلومات الصورة
lv: Attēla informācija

source: <h1>Here you may see the date changes for the displayed items.</h1>
ar: <h1>يمكنك هنا مشاهدة تغييرات التاريخ للعناصر المعروضة.</h1>
lv: <h1>Te ir redzamas parādīto vienumu datumu izmaiņas.</h1>

# @title:window
source: Reading File Properties
ar: يقرأ خصائص الملف
lv: Lasa datnes īpašības

source: Use <databaseFile> instead of the default. Deprecated - use '--db <databaseFile>' instead.
ar: استخدم <databaseFile> بدلاً من الافتراضي. مهمل - استخدم '--db <databaseFile>' بدلاً من ذلك.
lv: Noklusējuma vietā lietojiet <datubāzesDatne>. Novecojis — tā vietā lietojiet „--db <datubāzesDatne>“.

source: databaseFile
ar: ملف قاعدة البيانات
lv: datubāzesDatne

source: Application rc file.
ar: ملف rc للتطبيق.
lv: Pielietojuma „rc“ datne.

source: Use <databaseFile> instead of the default.
ar: استخدم <databaseFile> بدلاً من المبدئي.
lv: Noklusējuma vietā lietot <datubāzesDatne>.

source: Starts KPhotoAlbum with a prebuilt set of demo images.
ar: يبدأ دفتر الصور بمجموعة صور تجريبية مسبقة البناء.
lv: Sāk „KPhotoAlbum“ ar iepriekš iebūvētajiem demonstrācijas attēliem.

source: Import file.
ar: استورد ملف
lv: Importēt datni.

source: Listen for network connections.
ar: استمع لاتصالات الشبكة.
lv: Klausīties tīkla savienojumus.

source: Listen for network connections on address <interface_address>.
ar: استمع لاتصالات الشبكة على العنوان <interface_address>.
lv: Klausīties tīkla savienojumus adresē <saskarknes_adrese>.

source: interface_address
ar: عنوان_الواجهة
lv: saskarnes_adrese

source: Save the database and immediately quit after showing the main window.
ar: احفظ قاعدة البيانات والخروج فورًا بعد عرض النافذة الرئيسية.
lv: Saglabāt datubāzi un nekavējoties iziet pēc pamata loga parādīšanas.

source: Search for new images on startup.
ar: ابحث عن صور جديدة عند بدء التشغيل.
lv: Palaižot programmu, meklēt jaunus attēlus

source: <p>Enter your command to run below:</p><p><i>%all will be replaced with a file list</i></p>
ar: <p>أدخل الأمر الذي تريد تنفيذه أدناه:</p><p><i>سيُستبدل بـ %all قائمة ملفات</i></p>
lv: <p>Ievadiet palaižamo komandu:</p><p><i>„%all“ tiks aizstāts ar datņu sarakstu</i></p>

source: <p>Enter the command you want to run on your image file(s). KPhotoAlbum will run your command and replace any '%all' tokens with a list of your files. For example, if you entered:</p><ul><li>cp %all /tmp</li></ul><p>Then the files you selected would be copied to the /tmp folder</p><p>You can also use %each to have a command be run once per file.</p>
ar: <p>أدخل الأمر الذي تريد تنفيذه على ملف(ات) الصور الخاصة بك. سينفذ دفتر الصور أمرك واستبدال أي علامات '%all' بقائمة ملفاتك. على سبيل المثال، إذا أدخلت:</p><ul><li>cp %all /tmp</li></ul><p>فسينسخ الملفات التي حددتها إلى مجلد /tmp</p><p>يمكنك أيضًا استخدام %each لتشغيل الأمر مرة واحدة لكل ملف.</p>
lv: <p>Norādiet komandu, ko vēlaties palaist uz attēla datni(-ēm). „KPhotoAlbum“ palaidīs norādīto komandu un aizstās visus „%all“ marķierus ar datņu sarakstu. Piemēram ja norādījāt:</p><ul><li>cp %all /tmp</li></ul><p>Tad atlasītās datnes tiks nokopētas uz „/tmp“ mapi</p><p>Tāpat varat izmantot „%each“, lai komandu palaistu katrai datnei atsevišķi.</p>

source: %all
ar: %الكل

source: %each
ar: %لكل

# Name/title of the search bar toolbar widget
source: Search Bar
ar: شريط البحث
lv: Meklēšanas josla

# @label:textbox
source: Search ...
ar: ابحث ...
lv: Meklēt...

source: <h1>Description</h1><table><tr><td># of Items</td><td>This is the number of different items in the category</td></tr><tr><td>Tags Total</td><td>This is a count of how many tags was made,<br/>i.e. a simple counting though all the images</td></tr><tr><td>Tags Per Picture</td><td>This tells you how many tags are on each picture on average</td></tr></table><br/><br/>Do not get too attached to this dialog, it has the problem that it counts categories AND subcategories,<br/>so if an image has been taken in Las Vegas, Nevada, USA, then 3 tags are counted for that image,<br/>while it should only be one.<br/>I am not really sure if it is worth fixing that bug (as it is pretty hard to fix),<br/>so maybe the dialog will simply go away again
ar: <h1>الوصف</h1><table><tr><td>عدد العناصر</td><td>هذا هو عدد العناصر المختلفة في الفئة</td></tr><tr><td>إجمالي الوسوم</td><td>هذا هو عدد الوسوم الموضوعة،<br/>أي عملية عد بسيطة عبر جميع الصور</td></tr><tr><td>الوسوم لكل صورة</td><td>هذا يخبرك بعدد الوسوم على كل صورة في المتوسط</td></tr></table><br/><br/>لا تتعلق كثيرًا بهذا الحوار، فهو يعاني من مشكلة أنه يقوم بعد الفئات والفئات الفرعية،<br/>لذا إذا التقطت صورة في لاس فيغاس، نيفادا، الولايات المتحدة الأمريكية، فسيعد 3 وسوم لتلك الصورة،<br/> بينما ينبغي أن يكون واحدًا فقط.<br/>لست متأكدًا حقًا مما إذا كان من المجدي إصلاح هذا الخطأ (لأنه من الصعب إصلاحه)،<br/>لذلك ربما سيختفي الحوار مرة أخرى ببساطة
lv: <h1>Apraksts</h1><table><tr><td>Vienumu skaits</td><td>Šis ir dažādu vienumu skaits kategorijā</td></tr><tr><td>Birku kopā</td><td>Šis ir izveidoto birku skaits,<br/>proti, vienkārša birku saskaitīšana visos attēlos</td></tr><tr><td>Birku uz attēlu</td><td>Parāda, cik daudz vidēji katram attēlam ir birku</td></tr></table><br/><br/>Pārāk nepaļaujieties uz šo lodziņu, jo tas diemžēl skaita kategorijas UN apakškategorijas,<br/>tāpēc, ja fotogrāfija ir uzņemta Lasvegasā, Nevadā, ASV, tad šai fotogrāfijai jau tiks ieskaitītas trīs birkas,<br/>lai gan patiesībā vajadzētu būt vienai.<br/>Man nav skaidrs, vai šo nepilnību ir vērts novērst, jo to izdarīt ir diezgan sarežģīti,<br/>tāpēc, iespējams, šis lodziņš drīzumā pazudīs

source: <h1>Statistics</h1>
ar: <h1>الإحصائيّات</h1>
lv: <h1>Statistika</h1>

source: Category
ar: الصنف
lv: Kategorija

source: # of Items
ar: # العناصر
lv: Vienumu skaits

source: Tags Totals
ar: مجموع الوسوم
lv: Birku kopā

source: Tags Per Picture
ar: الوسوم لكل صورة
lv: Birku uz attēlu

source: Tag indication completed annotation
ar: وسم الدال على اكتمال الشرح
lv: Birka, kas norāda pabeigtu anotēšanu

source: If you use a specific tag to indicate that an image has been tagged, then specify it here.
ar: إذا كنت تستخدم وسمًا محددًا للإشارة إلى أن الصورة قد وُضع وسوم عليها، فحدده هنا.
lv: Ja izmantojat noteiktu birku, lai norādītu, ka attēlam ir pievienotas visas birkas, varat to norādīt te.

source: Category:
ar: الصنف:
lv: Kategorija:

source: Tag:
ar: الوسم:
lv: Birka:

# @item:inlistbox meaning 'no category'
source: None
ar: لا شيء
lv: Nav

# As in 'all images'
source: All
ar: الكل
lv: Visas

source: Total
ar: المجموع
lv: Kopā

source: Thumbnail settings...
ar: إعدادات الصور المصغرة...
lv: Sīktēlu iestatījumi...

# @title:window
source: Remove Tokens
ar: أزِل الرموز
lv: Noņemt marķierus

source: Select tokens to remove from all images and videos:
ar: اختر العلامات التي تحذف من كلّ الصور و المرئيات:
lv: Atlasiet marķierus, ko noņemt no visiem attēliem un video:

source: Select None
ar: اختر لا شيئ
lv: Neatlasīt nevienu

source: <h1>Welcome to KPhotoAlbum</h1><p>KPhotoAlbum is a powerful free tool to archive, tag and manage your photos and videos. It will not modify or change your precious files, it only indexes them and lets you easily find and manage your photos and videos.</p><p>Start by showing KPhotoAlbum where your photos are by pressing on Create My Own Database. Select this button also if you have an existing KPhotoAlbum database that you want to start using again.</p><p>If you feel safer first trying out KPhotoAlbum with prebuilt set of images, press the Load Demo button.</p>
ar: <h1>مرحبًا بك في دفتر الصور</h1><p>دفتر الصور هو أداة مجانية قوية لأرشفة الصور والفيديوهات ووضع الوسوم عليها وإدارتها. لن يعدل أو يغير ملفاتك الثمينة، بل يقوم فقط بفهرستها ويسمح لك بالعثور على صورك وفيديوهاتك وإدارتها بسهولة.</p><p>ابدأ بإظهار مكان صورك لـ دفتر الصور بالضغط على إنشاء قاعدة البيانات الخاصة بي. حدد هذا الزر أيضًا إذا كان لديك قاعدة بيانات موجودة لـ دفتر الصور تريد البدء في استخدامها مرة أخرى.</p><p>إذا كنت تشعر بمزيد من الأمان لتجربة دفتر الصور أولاً بمجموعة صور مُعدة مسبقًا، اضغط على زر تحميل العرض التوضيحي.</p>
lv: <h1>Laipni lūgti „KPhotoAlbum“!</h1><p>„KPhotoAlbum“ ir jaudīga brīva programma, kas ļauj arhivēt, birkot un pārvaldīt fotogrāfijas un video. Tā neveiks nekādas izmaiņas pašās attēlu un video datnēs, bet tikai tās uzskaitīs, ļaus tās vieglāk atrast un pārvaldīt.</p><p>Sāciet darbu, parādot „KPhotoAlbum“, kur glabājas jūsu fotogrāfijas, spiežot uz „Izveidot manu datubāzi“. Spiediet šo pogu arī tad, ja jums jau ir „KPhotoAlbum“ datubāze, ko vēlaties turpināt lietot.</p><p>Ja vēlaties vispirms izmēģināt „KPhotoAlbum“ ar ne saviem, bet programmā iepriekš iebūvētiem izmēģinājuma attēliem, spiediet „Ielādēt demonstrāciju“ pogu.</p>

source: Create My Own Database...
ar: أنشئ قاعدة البيانات الخاصة بك...
lv: Izveidot savu datubāzi...

source: Load Demo
ar: حمّل العرض التوضيحي
lv: Ielādēt demonstrāciju

source: Check My Feature Set
ar: استكشف مجموعة مميزاتي
lv: Pārbaudīt programmas iespējas

source: <h1>KPhotoAlbum database creation</h1><p>You need to show where the photos and videos are for KPhotoAlbum to find them. They all need to be contained by a single folder, for example /home/user/Images. In this folder you can have as many subfolders as you want, KPhotoAlbum will find them all for you.</p><p>Feel safe, KPhotoAlbum will not modify or edit any of your images, so you can simply point KPhotoAlbum to the folder where you already have all your images.</p><p>If you have an existing KPhotoAlbum database and image folder somewhere, point KPhotoAlbum to that folder to start using it again.</p>
ar: <h1>إنشاء قاعدة بيانات دفتر الصور</h1><p>تحتاج إلى إظهار مكان وجود الصور والفيديوهات لـ دفتر الصور للعثور عليها. يجب أن تكون جميعها موجودة داخل مجلد واحد، على سبيل المثال /home/user/Images. في هذا المجلد يمكنك الحصول على أي عدد تريده من المجلدات الفرعية، سيجدها دفتر الصور جميعًا لك.</p><p>اشعر بالأمان، لن يقوم دفتر الصور بتعديل أو تحرير أي من صورك، لذا يمكنك ببساطة توجيه دفتر الصور إلى المجلد حيث لديك جميع صورك فعلًا.</p><p>إذا كان لديك قاعدة بيانات موجودة لـ دفتر الصور ومجلد صور في مكان ما، فوجّه دفتر الصور إلى ذلك المجلد لبدء استخدامها مرة أخرى.</p>
lv: <h1>„KPhotoAlbum“ datubāzes izveide</h1><p>Norādiet, kur „KPhotoAlbum“ meklēt fotogrāfijas un video. Tiem visiem jābūt ietvertiem vienā mapē, piemēram, „/home/lietotājs/Attēli“. Šajā mapē varat glabāt tik apakšmapju, cik vēlaties, bet „KPhotoAlbum“ tās visas atradīs.</p><p>Varat justies droši — „KPhotoAlbum“ neizmainīs un nerediģēs jūsu attēlus, tāpēc varat droši norādīt uz mapi, kurā visi attēli glabājas.</p><p>Ja ierīce jau ir kāda „KPhotoAlbum“ datubāze un attēlu mapi, norādiet KPhotoAlbum uz šo mapi, lai atsāktu to lietot.</p>

source: Image/Video root folder:
ar: المجلد الجذري للصور/الفيديو:
lv: Attēlu/video saknes mape:

source: Folder does not exist, create it?
ar: المجلد غير موجود، هل تنشئه؟
lv: Mape nepastāv. Vai to izveidot?

source: Could not create folder %1
ar: تعذّر إنشاء المجلد %1
lv: Neizdevās izveidot mapi „%1“

source: %1 exists, but is not a folder
ar: %1 موجود، ولكنه ليس مجلدًا
lv: „%1“ pastāv, bet man mape

source: <p>KPhotoAlbum does not seem to be built with support for all its features. The following is a list indicating what you may be missing:<ul>%1</ul></p><p>For details on how to solve this problem, please choose <b>Help</b>|<b>KPhotoAlbum Feature Status</b> from the menus.</p>
ar: <p>يبدو أن دفتر الصور لم يُبنى بدعم لجميع ميزاته. فيما يلي قائمة توضح ما قد يكون مفقودًا لديك:<ul>%1</ul></p><p>للحصول على تفاصيل حول كيفية حل هذه المشكلة، يرجى اختيار <b>المساعدة</b>|<b>حالة ميزات دفتر الصور</b> من القوائم.</p>
lv: <p>Izskatās, ka šis „KPhotoAlbum“ nav būvēts ar visu pieejamo iespēju atbalstu. Šajā sarakstā ir uzskaitītas trūkstošās iespējas:<ul>%1</ul></p><p>Lai uzzinātu, kā novērst šo problēmu, izvēlnē atlasiet <b>Palīdzība</b>|<b>„KPhotoAlbum“ iespēju statuss</b>.</p>

source: Feature Check
ar: استكشف الميزات
lv: Iespēju pārbaude

source: Congratulations: all dynamic features have been enabled.
ar: مبارك: مكّنت جميع الميزات الديناميكية.
lv: Lieliski: visas dinamiskās iespējas ir ieslēgtas.

source: Searching for New Files
ar: يبحث عن ملفات جديدة
lv: Meklēt jaunas datnes

source: <p><b>Delete Your Temporary Demo Database</b></p><p>I hope you enjoyed the KPhotoAlbum demo. The demo database was created in the folder <tt>/tmp</tt>, should it be deleted now? If you do not delete it, it will waste disk space; on the other hand, if you want to come back and try the demo again, you might want to keep it around with the changes you made through this session.</p>
ar: <p><b>حذف قاعدة البيانات المؤقتة للعرض التوضيحي</b></p><p>آمل أن تكون قد استمتعت بعرض دفتر الصور التوضيحي. أنشئت قاعدة بيانات العرض التوضيحي في المجلد <tt>/tmp</tt>، هل يجب حذفها الآن؟ إذا لم تحذفها، فستستهلك مساحة القرص؛ من ناحية أخرى، إذا كنت ترغب في العودة وتجربة العرض التوضيحي مرة أخرى، فقد ترغب في الاحتفاظ بها مع التغييرات التي أجريتها خلال هذه الجلسة.</p>
lv: <p><b>Pagaidu demonstrācijas datubāzes dzēšana</b></p><p>Ceram, ka „KPhotoAlbum“ demonstrācija bija noderīga. Demonstrācijas datubāze tika izveidota mapē <tt>/tmp</tt>. Vai to tagad dzēst? Ja to nedzēsīsiet, tā aizņems vietu diskā. Tomēr, ja vēlaties atgriezties un turpināt demonstrāciju, varat vēlēties paturēt šajā sesijā veiktās izmaiņas.</p>

# @title
source: Delete Demo Database
ar: احذف قاعدة بيانات العرض التوضيحي
lv: Dzēst demonstrācijas datubāzi

source: Do you want to save the changes?
ar: هل تريد حفظ التغييرات ؟
lv: Vai vēlaties saglabāt izmaiņas?

# @title
source: Save Changes?
ar: حفظ التغييرات ؟
lv: Vai saglabāt izmaiņas?

source: Some of the selected images already belong to a stack. Do you want to remove them from their stacks and create a completely new one?
ar: بعض الصور المحددة تنتمي فعلًا إلى مجموعة مكدسة. هل تريد إزالتها من مجموعاتها المكدسة وإنشاء مجموعة جديدة تمامًا؟
lv: Daži no atlasītajiem attēliem jau pieder pie grēdas. Vai vēlaties tos noņemt no savas grēdas un izveidot jaunu?

# @title
source: Stacking problem
ar: مشكلة في التكديس
lv: Grēdošanas problēma

source: Unknown error, stack creation failed.
ar: خطأ غير معروف، فشل إنشاء المكدس.
lv: Nezināma kļūda, grēdu izveidot neizdevās.

source: Stacking Error
ar: خطأ في التكديس
lv: Grēdošanas kļūda

source: No item is selected.
ar: لم تحدد عنصر
lv: Neviens vienums nav atlasīts.

source: No Selection
ar: لا خيار
lv: Nav atlases

source: Saving...
ar: يحفظ...
lv: Saglabā...

source: Saving... Done
ar: انتهيت من الحفظ
lv: Saglabā... Pabeigts

source: There are no images to be shown.
ar: لا توجد صور لعرضها.
lv: Nav attēlu, ko parādīt.

source: Limit View to Selection
ar: تقييد العرض إلى التحديد
lv: Ierobežot skatu uz atlasi

source: No images are selected!
ar: لم تُحدد أي صور!
lv: Nav atlasīts neviens attēls!

source: Generate HTML...
ar: توليد لغة علامات النص الفائق HTML
lv: Ģenerēt HTML...

source: Import...
ar: استورد...
lv: Importēt...

source: Export/Copy Images...
ar: صدّر/انسخ الصور...
lv: Eksportēt/kopēt attēlus...

# Delete selected images
source: Delete Selected
ar: امحُ المحدد
lv: Dzēst atlasīto

source: Remove Tokens...
ar: أزِل الرموز...
lv: Noņemt marķierus...

source: Open List of Files...
ar: افتح قائمة الملفات...
lv: Atvērt datņu sarakstu...

source: Annotate Individual Items
ar: أضف تعليقات على العناصر الفردية
lv: Anotēt atsevišķus vienumus

source: Annotate Multiple Items at a Time
ar: أضف تعليقات على العناصر المتعددة بوقت واحد
lv: Anotēt uzreiz vairākus vienumus

source: Merge Images into a Stack
ar: ادمج الصور في مكدس
lv: Apvienot attēlus grēdā

source: Remove Images from Stack
ar: أزِل الصور من المكدس
lv: Izņemt attēlus no grēdas

source: Set as First Image in Stack
ar: عيّن كأول صورة في المكدس
lv: Iestatīt kā pirmo attēlu grēdā

source: View
ar: اعرض
lv: Skatīt

source: View (In New Window)
ar: اعرض ( في نافذة جديدة )
lv: Skatīt (jaunā logā)

source: Run Slide Show
ar: شغّل عرض الشرائح
lv: Palaist slīdrādi

source: Run Randomized Slide Show
ar: شغّل عرض الشرائح العشوائي
lv: Palaist slīdrādi nejaušā secībā

source: Collapse all stacks
ar: اطو جميع المكدسات
lv: Sakļaut visas grēdas

source: Expand all stacks
ar: وسّع جميع المكدسات
lv: Izvērst visas grēdas

source: Show &Oldest First
ar: اعرض ال&أقدم أولاً
lv: Rādīt &vecākos vispirms

source: Show &Newest First
ar: اعرض الأ&حدث أولاً
lv: Rādīt &jaunākos vispirms

source: Sort Selected by Date && Time
ar: أفرز الخيار حسب التاريخ و الوقت
lv: Kārtot atlasītos pēc datuma un laika

source: Jump to Context
ar: أقفز إلى السياق
lv: Iet uz kontekstu

source: Lock Images
ar: أقفل الصور
lv: Slēgt attēlus

source: Unlock
ar: فك القفل
lv: Atslēgt

source: Lock Away All Other Items
ar: فك قفل كلّ العناصر الأخرى
lv: Slēgt visus pārējos vienumus

source: Lock Away Current Set of Items
ar: فك قفل طاقم العناصر الحالي
lv: Slēgt pašreizējo vienumu kopumu

source: Configure Current View
ar: اضبط العرض الحالي
lv: Konfigurēt pašreizējo skatu

source: Tree
ar: شجرة
lv: Koks

source: Tree with User Icons
ar: شجرة مع أيقونات المستخدم
lv: Koks ar lietotāja ikonām

source: Icons
ar: الأيقونات
lv: Ikonas

source: Use natural sort order
ar: استخدام ترتيب الفرز الطبيعي
lv: Lietot dabīgu kārtošanas secību

source: Show Tooltips in Thumbnails Window
ar: اعرض تلميحات الأدوات في نافذة المصغرات
lv: Sīktēlu logā rādīt paskaidres

source: Show Labels in Thumbnails Window
ar: أظهر التسميات في نافذة الصور المصغرة
lv: Sīktēlu logā rādīt etiķetes

source: Show Categories in Thumbnails Window
ar: أظهر الفئات في نافذة الصور المصغرة
lv: Sīktēlu logā rādīt kategorijas

source: Choose Color Scheme
ar: اختر مخطط الألوان
lv: Izvēlēties krāsu shēmu

source: Display Images and Videos Not on Disk
ar: اعرض الصور و المرئيات غير الموجودة على القرص
lv: Parādīt attēlus un video, kas neatrodas uz diska

source: Display Images and Videos with Incomplete Dates...
ar: اعرض الصور و المرئيات ذي التواريخ غير الكاملة...
lv: Parādīt attēlus un video ar nepilnīgiem datumiem...

source: Merge duplicates
ar: ادمج التكرارات
lv: Apvienot dublējošās datnes

source: Refresh Selected Thumbnails and Checksums
ar: حدّث الصور المصغرة المحددة ومجموعات التحقق
lv: Pārlādēt atlasītos sīktēlus un kontrolsummas

source: Rescan for Images and Videos
ar: إعادة المسح للصور و المرئيات
lv: Pārskenēt attēlus un video

source: Recreate Exif Search Database
ar: أعد إنشاء قاعدة بيانات بحث Exif
lv: No jauna izveidot „Exif“ meklēšanas datubāzi

source: Read Metadata from Files...
ar: اقرأ البيانات الوصفية من الملفات…

source: Sort All by Date && Time
ar: افرز الكل حسب التاريخ والوقت
lv: Kārtot visu pēc datuma un laika

source: Automatically Stack Selected Images...
ar: كدّس الصور المحددة آليًا...
lv: Automātiski grēdot atlasītos attēlus...

source: Build Thumbnails
ar: ابنِ المصغرات
lv: Veidot sīktēlus

source: Statistics...
ar: الإحصائيّات...
lv: Statistika...

source: Mark As Untagged
ar: ضع علامة غير موسوم
lv: Atzīmēt kā bez birkas

source: Enable All Messages
ar: مكّن كلّ الرسائل
lv: Ieslēgt visus ziņojumus

source: Run KPhotoAlbum Demo
ar: شغّل عرض دفتر الصور التوضيحي
lv: Palaist „KPhotoAlbum“ demonstrāciju

source: KPhotoAlbum Feature Status
ar: حالة الميزات لـ دفتر الصور
lv: „KPhotoAlbum“ iespēju statuss

source: Show Demo Videos
ar: اعرض فيديوهات العرض التوضيحي
lv: Rādīt demonstrācijas video

source: Show Exif Info and file metadata
ar: أظهر معلومات Exif وبيانات وصفية للملف
lv: Rādīt „Exif“ informāciju un datnes metadatus

source: Use next video thumbnail
ar: استخدام الصورة المصغرة التالية للفيديو
lv: Lietot nākamo video sīktēlu

source: Use previous video thumbnail
ar: استخدام الصورة المصغرة السابقة للفيديو
lv: Lietot iepriekšējo video sīktēlu

source: Copy image to ...
ar: انسخ صورة إلى ...
lv: Kopēt attēlu(-us) uz...

source: Link image to ...
ar: اربط الصورة بـ ...
lv: Saitēt attēlu(-us) uz...

source: Auto saving....
ar: يحفظ آليًّا...
lv: Notiek automātiskā saglabāšana...
