Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: <p>When KPhotoAlbum searches for new files and finds a file that matches the <i>modified file search regexp</i> it is assumed that an original version of the image may exist. The regexp pattern will be replaced with the <i>original file replacement text</i> and if that file exists, all associated metadata (category information, ratings, etc) will be copied or moved from the original file to the new one.</p>
ar: <p>عندما يبحث دفتر الصور عن ملفات جديدة ويعثر على ملف مطابق لـ <i>التعبير النمطي للبحث عن الملف المعدل</i> ، يُفترض أن إصدارًا أصليًا من الصورة قد يكون موجودًا. سيستبدل نمط التعبير النمطي بـ <i>نص استبدال الملف الأصلي</i> وإذا كان ذلك الملف موجودًا، فسينسخ أو يُنقل جميع البيانات الوصفية المرتبطة (معلومات الفئة، التقييمات، إلخ) من الملف الأصلي إلى الملف الجديد.</p>
lv: <p>Kad „KPhotoAlbum“ meklē jaunas datnes un atrod datni, kas atbilst <i>modificētās datnes meklēšanas regulārajai izteiksmei</i>, programma pieņem, ka pastāv šī attēla oriģinālā versija. Regulārās izteiksmes paraugu aizstās <i>oriģinālās datnes aizstāšanas teksts</i> un ja šāda datne pastāv, visi saistītie metadati (kategorijas informācija, reitings u.c.) tiks nokopēti vai pārvietoti no oriģinālās datnes uz jauno.</p>

source: <p>A perl regular expression that should match a modified file. <ul><li>A dot matches a single character (<tt>\.</tt> matches a dot)</li> <li>You can use the quantifiers <tt>*</tt>,<tt>+</tt>,<tt>?</tt>, or you can match multiple occurrences of an expression by using curly brackets (e.g. <tt>e{0,1}</tt> matches 0 or 1 occurrences of the character "e").</li> <li>You can group parts of the expression using parenthesis.</li> </ul>Example: <tt>-modified\.(jpg|tiff)</tt> </p>
ar: <p>تعبير نمطي من نوع perl يجب أن يطابق ملفًا معدلاً. <ul><li>النقطة تطابق حرفًا واحدًا (<tt>\.</tt> تطابق نقطة)</li> <li>يمكن استخدام المحددات الكمية <tt>*</tt>,<tt>+</tt>,<tt>؟</tt>، أو يمكن مطابقة تكرارات متعددة للتعبير باستخدام الأقواس المعقوفة (مثال: <tt>e{0,1}</tt> تطابق 0 أو 1 تكرارًا للحرف "e").</li> <li>يمكن تجميع أجزاء من التعبير باستخدام الأقواس.</li> </ul>مثال: <tt>-modified\.(jpg|tiff)</tt> </p>
lv: <p>„Perl“ regulārā izteiksme, kurai jāatbilst izmainītajai datnei. <ul><li>Punkts nozīmē vienu rakstzīmi (<tt>\.</tt> nozīmē punktu)</li> <li>Varat izmantot kvantifikatorus <tt>*</tt>,<tt>+</tt>,<tt>?</tt> vai arī atrast vairākas izteiksmes atbilsmes, izmantojot figūriekavas (piemēram, <tt>e{0,1}</tt> atbildīs nevienam vai vienam rakstzīmes „e“ atkārtojumam).</li> <li>Izteiksmju daļas varat grupēt ar iekavām.</li> </ul>Piemērs: <tt>-izmainīts\.(jpg|tiff)</tt> </p>

source: <p>A string that is used to replace the match from the <i>File versions search regexp</i>. This can be a semicolon (<tt>;</tt>) separated list. Each string is used to replace the match in the new file's name until an original file is found or we run out of options.</p>
ar: <p>سلسلة تُستخدم لاستبدال المطابقة من <i>التعبير النمطي للبحث عن إصدارات الملف</i>. يمكن أن تكون هذه قائمة مفصولة بفاصلة منقوطة (<tt>;</tt>). كل سلسلة تُستخدم لاستبدال المطابقة في اسم الملف الجديد حتى يعثر على ملف أصلي أو نفاد الخيارات.</p>
lv: <p>Virkne, kas tiek izmantota, lai aizvietotu atbilsmi no <i>Datņu versiju meklēšanas regulārās izteiksmes</i>. Tā var būt ar semikolu (<tt>;</tt>) atdalīts saraksts. Katra virkne tiek izmantota, lai aizvietotu atbilsmi jaunās datnes nosaukuma līdz tiek atrasta oriģinālā datne vai izbeidzas opciju.</p>

source: <p>The tagging is moved from the original file to the new file. This way only the latest version of an image is tagged.</p>
ar: <p> نُقل الوسم من الملف الأصلي إلى الملف الجديد. بهذه الطريقة، يُوضع الوسم على أحدث إصدار من الصورة فقط.</p>
lv: <p>Birkas ir pārvietotas no oriģinālās datnes uz jauno datni. Tādējādi birkas satur tikai attēla pēdējā versija.</p>

source: <p>If this option is set, new versions of an image are automatically stacked and placed to the top of the stack. This way the new image is shown when the stack is in collapsed state - the default state in KPhotoAlbum.</p>
ar: <p> إذا عُين هذا الخيار، فسيرص الإصدارات الجديدة من الصورة آليًا ووضعها في أعلى الكدس. بهذه الطريقة، تظهر الصورة الجديدة عندما تكون الكدس في حالة مطوية - الحالة المبدئية في دفتر الصور.</p>
lv: <p>Ja ir ieslēgta šī opcija, jaunās attēlu versijas tiek automātiski grēdotas un novietotas grēdas augšpusē. Tādējādi jaunais attēls ir redzams, kad grēda ir izvērstā stāvoklī — „KPhotoAlbum“ noklusējuma stāvoklī.</p>

source: Copy File and Open with an External Application
ar: انسخ الملف وافتحه بتطبيق خارجي
lv: Kopēt datni un atvērt ārējā programmā

source: Copy file search regexp:
ar: التعبير النمطي للبحث عن نسخ الملف:
lv: Kopēt datnes meklēšanas regulāro izteiksmi:

source: Copy file replacement text:
ar: نص استبدال نسخة الملف:
lv: Kopēt datnes aizvietošanas tekstu:

source: <p>KPhotoAlbum can make a copy of an image before opening it with an external application. This configuration defines how the new file is named.</p><p>The regular expression defines the part of the original file name that is replaced with the <i>replacement text</i>. E.g. regexp <i>"\.(jpg|png)"</i> and replacement text <i>"-mod.\1"</i> would copy test.jpg to test-mod.jpg and open the new file in selected application.</p>
ar: <p>يستطيع دفتر الصور عمل نسخة من صورة قبل فتحها بتطبيق خارجي. هذا الضبط يحدد كيفية تسمية الملف الجديد.</p><p> يحدد التعبير النمطي جزء اسم الملف الأصلي الذي سيستبدل به <i>نص الاستبدال</i>. على سبيل المثال، التعبير النمطي <i>"\.(jpg|png)"</i> ونص الاستبدال <i>"-mod.\1"</i> سينسخ test.jpg إلى test-mod.jpg ويفتح الملف الجديد في التطبيق المحدد.</p>
lv: <p>„KPhotoAlbum“ var izveidot attēla kopiju pirms tā atvēršanas ārējā programmā. Šī konfigurācija nosaka, kā tiks nosaukts jaunais attēls.</p><p>Regulārā izteiksme definēt daļu no oriģinālās datnes nosaukuma, kas ir aizstāts ar <i>aizstāšanas tekstu</i>. Piemēram, regulārā izteiksme <i>"\.(jpg|png)"</i> un aizstāšanas teksts <i>"-mod.\1"</i> nokopētu datni „test.jpg“ uz „test-mod.jpg“ un atvērtu jauno datni atlasītajā programmā.</p>

source: EXPERIMENTAL: Tune new image loading for best performance.
ar: تجريبي: اضبط تحميل الصور الجديدة للحصول على أفضل أداء.
lv: EKSPERIMENTĀLI: pielāgojiet jaunu attēlu ielādēšanu ātrākai programmas darbībai.

source: Type of media on which your images are stored.
ar: نوع الوسائط التي تخزن عليها صورك.
lv: Datu nesēja tips, kurā attēli ir saglabāti.

source: Hard Disk
ar: قرص صلب
lv: Cietais disks

source: Network
ar: الشبكة
lv: Tīkls

source: Slow PCIe/NVMe
ar: PCIe/NVMe بطيء
lv: Lēna „PCIe“/„NVMe“ karte

source: Fast PCIe/NVMe
ar: PCIe/NVMe سريع
lv: Ātra „PCIe“/„NVMe“ karte

source: Manual Settings
ar: الإعدادات اليدوية
lv: Manuāli iestatījumi

source: <p>Tune image loading for best performance based on the type of storage your image database resides on. If your image database resides on multiple media, choose the slowest media type used.</p><p>Use Manual Settings to configure details of how the loading is performed.</p>
ar: <p>اضبط تحميل الصور للحصول على أفضل أداء بناءً على نوع التخزين الذي توجد عليه قاعدة بيانات الصور الخاصة بك. إذا كانت قاعدة بيانات الصور موجودة على وسائط متعددة، فاختر أبطأ نوع وسائط مستخدم.</p><p>استخدم الإعدادات اليدوية لضبط تفاصيل كيفية إجراء التحميل.</p>
lv: <p>Pielāgojiet attēla ielādēšanu labākai veiktspējai, ievērojot attēlu datubāzes krātuves veidu. Ja attēlu datubāze atrodas uz dažādiem datu nesējiem, izvēlieties lēnāko no tiem.</p><p>Izmantojiet manuālos iestatījumus, lai konfigurētu to, kā notiks ielāde.</p>

source: Calculate MD5 checksum while images are being preloaded
ar: احسب المجموع الاختباري MD5 أثناء التحميل المسبق للصور
lv: Aprēķināt MD5 kontrolsummas laikā, kad attēli tiek priekšielādēti

source: <p>Calculate MD5 checksums while images are being preloaded. This works well if the storage is very fast, such as an NVMe drive. If the storage is slow, this degrades performance as the checksum calculation has to wait longer for the images to be preloaded.</p>
ar: <p>يُحسَب مجموع التحقق MD5 أثناء تحميل الصور مسبقًا. يعمل هذا بشكل جيد إذا كان التخزين سريعًا جدًا، مثل محرك NVMe. إذا كان التخزين بطيئًا، فإن هذا يقلل الأداء حيث يتعين على حساب مجموع التحقق الانتظار لفترة أطول حتى تُحمل الصور مسبقًا.</p>
lv: <p>Aprēķināt MD5 kontrolsummas laikā, kad attēli tiek priekšielādēti. Tas darbojas labi, ja krātuve ir ļoti ātra, piemēram, „NVMe“ diskdzinis. Ja krātuvē trūkst vietas, tas samazina veiktspēju, jo kontrolsummas aprēķināšanai ir jāgaida rindā līdz tiek priekšielādēti attēli.</p>

source: Number of threads to use for preloading (scouting) images
ar: عدد الخيوط المستخدمة لتحميل الصور مسبقًا (استكشاف)
lv: Priekšielādēšanai (izpētei) izmantoto pavedienu skaits

source: <p>Number of threads to use for preloading images to have them in memory when their checksums are calculated. This should generally be set higher for faster storage, but not more than the number of cores in your CPU. Default is 1, which works well for mechanical hard disks.</p>
ar: <p>عدد الخيوط المستخدمة لتحميل الصور مسبقًا لتكون في الذاكرة عند حساب مجاميع التحقق الخاصة بها. يجب عادةً ضبط هذا الرقم أعلى للتخزين الأسرع، ولكن لا يزيد عن عدد نوى المعالج. القيمة الافتراضية هي 1، والتي تعمل بشكل جيد مع الأقراص الصلبة الميكانيكية.</p>
lv: <p>Pavedienu skaits, ko izmantot attēlu priekšielādēšanai, lai tos paturētu atmiņa kontrolsummu aprēķināšanas laikā. Ātrākām krātuvēm parasti šim iestatījumam jābūt augstākam, bet tas nedrīkst pārsniegt CPU pavedienu skaitu. Noklusējums ir viens, kas ir piemērots mehāniskajiem cietajiem diskiem.</p>

source: Number of threads to use for thumbnailPreloading (scouting) images
ar: عدد الخيوط المستخدمة لتحميل الصور المصغرة مسبقًا (استكشاف)
lv: Sīktēlu priekšielādēšanai (izpētei) izmantoto pavedienu skaits

source: <p>Number of threads to use for preloading images prior to building thumbnails. Normally this should be set to 1; the exception might be if you have very fast storage.</p>
ar: <p>عدد الخيوط المستخدمة لتحميل الصور مسبقًا قبل إنشاء الصور المصغرة. عادةً يجب ضبط هذا على 1؛ الاستثناء قد يكون إذا كان لديك تخزين سريع جدًا.</p>
lv: <p>Pavedienu skaits, ko izmantot attēlu priekšielādēšanai pirms sīktēlu veidošanas. Parasti šis iestatījums ir viens, bet to varat mainīt, ja ierīcē ir ļoti ātra krātuve.</p>

source: Number of threads to use for building thumbnails
ar: عدد الخيوط المستخدمة لإنشاء الصور المصغرة
lv: Sīktēlu būvēšanai izmantoto pavedienu skaits

source: <p>Number of threads to use for building thumbnails. If set to 0 this will be set automatically one less than the number of cores, at least one and no more than three. If you have fast storage and a CPU with many cores, you may see benefit from setting this to a larger value.</p><p>KPhotoAlbum must be restarted for changes to take effect.</p>
ar: <p>عدد الخيوط المستخدمة لإنشاء الصور المصغرة. إذا ضُبط على 0، فسيضبط آليا على واحد أقل من عدد النوى، على الأقل واحد ولا يزيد عن ثلاثة. إذا كان لديك تخزين سريع ومعالج به العديد من النوى، فقد تستفيد من ضبط هذا على قيمة أكبر.</p><p>يجب إعادة تشغيل دفتر الصور لتفعيل التغييرات.</p>
lv: <p>Pavedienu skaits, ko izmantot sīktēlu būvēšanai. Ja ir norādīta nulle, tad šis iestatījums automātiski tiks iestatīts par ciparu, kas ir par vienu mazāks par kodolu skaitu, bet ne lielāks par trīs. Gadījumā, ja jums ir ātra krātuve un CPU ar daudziem kodoliem, varat paātrināt programmas darbību, norādot lielāku vērtību.</p><p>Lai izmaiņas stātos spēkā „KPhotoAlbum“ ir jāpārstartē.</p>

source: Loading New Images
ar: تحميل الصور الجديدة
lv: Ielādē jaunus attēlus

source: Trust image dates:
ar: الثقة في تواريخ الصور:
lv: Uzticēties attēlu datumiem:

# As in 'always trust image dates'
source: Always
ar: دائما
lv: Vienmēr

# As in 'ask whether to trust image dates'
source: Ask
ar: اسأل
lv: Jautāt

# As in 'never trust image dates'
source: Never
ar: أبدًا
lv: Nekad

source: Use Exif orientation information
ar: استخدم معلومات اتجاه Exif
lv: Izmantot „Exif“ orientācijas informāciju

source: Use Exif description
ar: استخدم وصف Exif
lv: Izmantot „Exif“ aprakstu

source: Strip out camera generated default descriptions
ar: أزِل الأوصاف الافتراضية المُنشأة بواسطة الكاميرا
lv: Noņemt kameras ģenerētos noklusējuma aprakstus

source: Use the embedded thumbnail in RAW file or halfsized RAW
ar: استخدم الصورة المصغرة المضمنة في ملف RAW أو RAW بنصف الحجم
lv: Izmantot RAW datnes vai pusizmēra RAW datnes iebūvēto sīktēlu

source: Required size for the thumbnail:
ar: الحجم المطلوب للصورة المصغرة:
lv: Pieprasītais sīktēla izmērs:

source: Histogram
ar: المخطّط الدّرجيّ
lv: Histogramma

source: Show histogram
ar: اعرض المدرج التكراري
lv: Rādīt histogrammu

source: Use linear scale for histogram
ar: استخدم مقياس خطي للمدرج التكراري
lv: Histogrammai izmantot lineāru mērogu

source: Size of histogram columns in date bar:
ar: حجم أعمدة المدرج التكراري في شريط التاريخ:
lv: Histogrammas kolonnu izmērs datumu joslā:

source: Show splash screen
ar: اعرض شاشة البداية
lv: Rādīt izlecošo attēlu

source: Listen for Android devices on startup
ar: استمع لأجهزة أندرويد عند بدء التشغيل
lv: Palaižot klausīties „Android“ ierīces

source: <p>KPhotoAlbum will try to read the image date from Exif information in the image. If that fails it will try to get the date from the file's time stamp.</p><p>However, this information will be wrong if the image was scanned in (you want the date the image was taken, not the date of the scan).</p><p>If you only scan images, in contrast to sometimes using a digital camera, you should reply <b>no</b>. If you never scan images, you should reply <b>yes</b>, otherwise reply <b>ask</b>. This will allow you to decide whether the images are from the scanner or the camera, from session to session.</p>
ar: <p>سيحاول دفتر الصور قراءة تاريخ الصورة من معلومات Exif في الصورة. إذا فشل ذلك، سيحاول الحصول على التاريخ من الطابع الزمني للملف.</p><p>ومع ذلك، ستكون هذه المعلومات خاطئة إذا مُسحت الصورة ضوئيًا (أنت تريد تاريخ التقاط الصورة، وليس تاريخ المسح).</p><p>إذا كنت تمسح الصور فقط، على عكس استخدام كاميرا رقمية أحيانًا، فاجب <b>لا</b>. إذا لم تمسح الصور أبدًا، فاجب <b>نعم</b>، وإلا فاجب <b>اسأل</b>. سيسمح لك هذا بتحديد ما إذا كانت الصور من الماسح الضوئي أو الكاميرا، من جلسة إلى أخرى.</p>
lv: <p>„KPhotoAlbum“ mēģinās nolasīt attēlu datus no to „Exif“ informācijas. Ja tas neizdosies, programma mēģinās iegūt datumu un datnes laika zīmoga.</p><p>Tomēr šī informācija būs nepareiza, ja attēls ir skenēts (jums visdrīzāk interesē datums, ka attēls ir uzņemts, bet ne skenēts).</p><p>Ja tikai skenējat attēlus, bet retāk lietojat digitālās kameras, norādiet <b>nē</b>. Ja nekad neskenējat attēlus, atbildiet <b>jā</b>, bet citos gadījumos — <b>jautāt</b>. Tas ļaus katrā sesijā norādīt, vai pievienotie attēli ir skenēti vai fotografēti ar digitālo kameru.</p>

source: <p>JPEG images may contain information about rotation. If you have a reason for not using this information to get a default rotation of your images, uncheck this check box.</p><p>Note: Your digital camera may not write this information into the images at all.</p>
ar: <p>قد تحتوي صور JPEG على معلومات حول التدوير. إذا كان لديك سبب لعدم استخدام هذه المعلومات للحصول على تدوير افتراضي لصورك، ألغِ تحديد خانة الاختيار هذه.</p><p>ملاحظة: قد لا تكتب كاميرتك الرقمية هذه المعلومات في الصور على الإطلاق.</p>
lv: <p>JPEG attēli var saturēt informāciju par rotāciju. Ja pastāv iemesls neizmantot šo informāciju, lai iegūtu attēlu noklusējuma rotāciju, noņemiet šo atzīmi.</p><p>Ievērībai: iespējams, jūsu digitālā fotokamera nemaz attēlos nesaglabā šo informāciju.</p>

source: <p>JPEG images may contain a description. Check this checkbox to specify if you want to use this as a default description for your images.</p>
ar: <p>قد تحتوي صور JPEG على وصف. حدد خانة الاختيار هذه لتحديد ما إذا كنت تريد استخدام هذا كوصف افتراضي لصورك.</p>
lv: <p>JPEG attēli var saturēt aprakstu. Atzīmējiet šo rūtiņu, lai norādītu, vai vēlaties šo izmantot kā noklusējuma attēlu aprakstu.</p>

source: Show the KPhotoAlbum splash screen on start up
ar: اعرض شاشة البداية لِــ دفتر الصور عند بدء التشغيل
lv: Palaižot rādīt „KPhotoAlbum“ izlecošo ekrānu

source: <p>KPhotoAlbum is capable of showing your images on android devices. KPhotoAlbum will automatically pair with the app from android. This, however, requires that KPhotoAlbum on your desktop is listening for multicast messages. Checking this checkbox will make KPhotoAlbum do so automatically on start up. Alternatively, you can click the connection icon in the status bar to start listening.
ar: <p>يستطيع دفتر الصور عرض صورك على أجهزة أندرويد. سيقوم دفتر الصور بإقران نفسه آليًا مع التطبيق من أندرويد. ومع ذلك، يتطلب هذا أن يكون دفتر الصور على جهازك المكتبي يستمع لرسائل البث الجماعي. سيؤدي تحديد خانة الاختيار هذه إلى جعل دفتر الصور يفعل ذلك آليًا عند بدء التشغيل. بدلاً من ذلك، يمكن النقر على أيقونة الاتصال في شريط الحالة لبدء الاستماع.
lv: <p>„KPhotoAlbum“ spēj parādīt attēlus „Android“ ierīcēs. „KPhotoAlbum“ automātiski sapārosies ar programmu „Android“ ierīcē. Tomēr, lai tas darbotos „KPhotoAlbum“ jūsu datorā ir jāklausās multiraides ziņas. Šīs rūtiņās atzīmēšana liks „KPhotoAlbum“ to automātiski darīt programmas palaišanas laikā. Tāpat arī, lai sāktu klausīties, varat spiest savienojuma ikonu statusa joslā.

source: <p>Some cameras automatically store generic comments in each image. These comments can be ignored automatically.</p><p>Enter the comments that you want to ignore in the input field, one per line. Be sure to add the exact comment, including all whitespace.</p>
ar: <p>تقوم بعض الكاميرات آليًا بتخزين تعليقات عامة في كل صورة. يمكن تجاهل هذه التعليقات آليًا.</p><p>أدخل التعليقات التي تريد تجاهلها في حقل الإدخال، واحد في كل سطر. تأكد من إضافة التعليق الدقيق، بما في ذلك كل المسافات البيضاء.</p>
lv: <p>Dažas kameras katrā fotogrāfijā automātiski saglabā vispārīgus komentārus. Šie komentāri var tikt ignorēti automātiski.</p><p>Ievades laukā norādiet komentārus pa vienam rindā, ko vēlaties ignorēt. Rūpīgi ievadiet precīzu komentāru, ievērojot visas atstarpes.</p>

source: File Searching & Versions
ar: بحث الملفات والإصدارات
lv: Datņu meklēšana un versijas

source: Categories
ar: الأصناف
lv: Kategorijas

source: Birthdays
ar: أعياد الميلاد
lv: Dzimšanas dienas

source: Tag Groups
ar: مجموعات الوسوم
lv: Birku grupas

source: Exif/IPTC Information
ar: معلومات Exif/IPTC
lv: „Exif“/IPTC informācija

source: Database Backend
ar: سند قاعدة البيانات
lv: Datubāzes aizmugursistēma

# @title:window
source: Settings
ar: الإعدادات
lv: Iestatījumi

# @label
source: Categories and groups:
ar: الفئات والمجموعات:
lv: Kategorijas un grupas:

# @label/rich
source: <strong>Select a group on the left side to add tags to it</strong>
ar: <strong>اختر مجموعة من الجانب الأيسر لإضافة وسوم إليها</strong>
lv: <strong>Lai grupai pievienotu birku, atlasiet to kreisajā pusē</strong>

# @label/rich
source: <strong>There are pending changes on the categories page.<nl> Please save the changes before working on tag groups.</strong>
ar: <strong>هناك تغييرات معلقة على صفحة الفئات.<nl> يرجى حفظ التغييرات قبل العمل على مجموعات الوسوم.</strong>
lv: <strong>Kategoriju lapā ir neapstiprinātas izmaiņas.<nl> Saglabājiet izmaiņas pirms strādājat ar birku grupām.</strong>

# @action:inmenu
source: Add group ...
ar: أضف مجموعة ...
lv: Pievienot grupu...

# @action:inmenu
source: Rename group "%1"
ar: أعد تسمية المجموعة "%1"
lv: Pārdēvēt grupu „%1“

# @action:inmenu
source: Delete group "%1"
ar: احذف المجموعة "%1"
lv: Dzēst grupu „%1“

# @label
source: Tags in group "%1" of category "%2"
ar: الوسوم في المجموعة "%1" من الفئة "%2"
lv: „%2“ kategorijas grupas „%1“ birkas

# @title:window
source: New Group
ar: مجموعة جديدة
lv: Jauna grupa

# @label:textbox
source: Group name:
ar: اسم المجموعة:
lv: Grupas nosaukums:

# @info
source: <p>The group "%1" already exists.</p>
ar: <p>المجموعة "%1 موجودة فعلًا.</p>
lv: <p>Grupa „%1“ jau pastāv.</p>

# @title:window
source: Cannot add group
ar: تعذرت إضافة المجموعة
lv: Nevar pievienot grupu

# @title:window
source: Rename Group
ar: أعد تسمية المجموعة
lv: Pārdēvēt grupu

# @label:textbox
source: New group name:
ar: اسم المجموعة الجديد:
lv: Jauns grupas nosaukums

# @info
source: <para>Cannot rename group "%1" to "%2": "%2" already exists in category "%3"</para>
ar: <para>تعذرت إعادة تسمية المجموعة "%1" إلى "%2": "%2" موجودة فعلًا في الفئة "%3"</para>
lv: <para>Neizdodas pārdēvēt „%1“ grupu par „%2“: kategorijā „%3“ grupa „%2“ jau pastāv</para>

# @info
source: <para>Really delete group "%1"?</para><para>Sub-categories of this group will be moved to the super category of "%1" ("%2").<nl/> All other memberships of the sub-categories will stay intact.</para>
ar: <para> هل تُحذف المجموعة "%1" حقًا؟</para><para>ستُنقل الفئات الفرعية لهذه المجموعة إلى الفئة الفوقية لـ "%1" ("%2").<nl/> جميع العضويات الأخرى للفئات الفرعية ستبقى سليمة.</para>
lv: <para>Vai tiešām dzēst grupu „%1“?</para><para>Šīs grupas apakškategorijas tiks pārvietotas uz „%1“ superkategoriju („%2“).<nl/> Visas citas apakškategoriju dalības paliks bez izmaiņām.</para>

# @info
source: <para>Really delete group "%1"?</para>
ar: <para>هل تُحذف المجموعة "%1" حقًا؟</para>
lv: <para>Vai tiešām dzēst grupu „%1“?</para>

# @title:window
source: Delete Group
ar: احذف المجموعة
lv: Dzēst grupu

source: &Delete
ar: ا&حذف
lv: &Dzēst

# @action:inmenu
source: Rename "%1"
ar: غيّر الاسم "%1"
lv: Pārdēvēt „%1“

# @action:inmenu
source: Delete "%1"
ar: احذف "%1"
lv: Dzēst „%1“

# @title:window
source: New Tag Name
ar: اسم الوسم الجديد
lv: Jauns birkas nosaukums

# @label:textbox
source: Tag name:
ar: اسم الوسم:
lv: Birkas nosaukums:

# @info
source: <para>Do you really want to delete "%1"?</para><para>Deleting the item will remove any information about it from any image containing the item.</para>
ar: <para>هل تريد حقًا حذف "%1"؟</para><para>سيؤدي حذف العنصر إلى إزالة أي معلومات عنه من أي صورة تحتوي على العنصر.</para>
lv: <para>Vai tiešām vēlaties dzēst „%1“?</para><para>Vienuma dzēšana noņems no attēla, kurā atrodas vienums, visu informāciju par to.</para>

# @title:window
source: Really delete %1?
ar: محو %1 حقاً؟
lv: Vai tiešām dzēst „%1“?

source: Tooltip preview image size:
ar: حجم صورة معاينة تلميح الأدوات:
lv: Paskaidres priekšskatījuma attēla izmērs:

source: No Image Preview
ar: لا معاينة للصور
lv: Nav attēla priekšskatījuma

source: Thumbnail image size:
ar: حجم صورة المصغّرة:
lv: Siktēlu attēlu izmērs:

source: Build thumbnails on demand
ar: أنشئ الصور المصغرة عند الطلب
lv: Veidot sīktēlus pēc pieprasījuma

source: Thumbnail table cells aspect ratio:
ar: نسبة أبعاد خلايا جدول الصور المصغرة:
lv: Sīktēlu tabulu šūnu malu attiecība:

source: Space around cells:
ar: المساحة حول الخلايا:
lv: Vieta ap šūnām:

source: Display grid around thumbnails
ar: اعرض شبكة حول الصور المصغرة
lv: Ap sīktēliem rādīt režģi

source: Display labels in thumbnail view
ar: اعرض التسميات في عرض المصغرات
lv: Sīktēlu skatā rādīt etiķetes

source: Display categories in thumbnail view
ar: اعرض الأصناف في عرض المصغرات
lv: Sīktēlu skatā rādīt kategorijas

source: Threshold for automatic thumbnail view:
ar: عتبة العرض التلقائي للصور المصغرة:
lv: Automātiskā sīktēlu skata slieksnis:

# Describing: 'ThumbnailView will not be automatically shown'
source: Disabled
ar: معطّل
lv: Izslēgts

source: <p>If you select <b>Settings -&gt; Show Tooltips</b> in the thumbnail view, then you will see a small tool tip window displaying information about the thumbnails. This window includes a small preview image. This option configures the image size.</p>
ar: <p>إذا حددت <b>الإعدادات -&gt; عرض تلميحات الأدوات</b> في عرض الصور المصغرة، فسترى نافذة تلميح أدوات صغيرة تعرض معلومات حول الصور المصغرة. تتضمن هذه النافذة صورة معاينة صغيرة. يضبط هذا الخيار حجم الصورة.</p>
lv: <p>Ja sīktēlu skatā atlasījāt <b>Iestatījumi—&gt;Rādīt paskaidres</b>, tad redzēsiet mazu paskaidres logu ar informāciju par sīktēlu. Šis logs satur mazu attēla priekšskatījumu. Šī opcija nosaka attēla izmēru.</p>
