Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: Contrast
ar: التباين
lv: Kontrasts

source: Sharpness
ar: الوضوح
lv: Asums

source: Saturation
ar: الإشباع
lv: Piesātinājums

source: No cameras found in the database
ar: لم يعثر على كاميرات في قاعدة البيانات
lv: Datubāzē kameras nav atrastas

source: No lenses found in the database
ar: لم يعثر على عدسات في قاعدة البيانات
lv: Datubāzē lēcas nav atrastas

source: Not all images in the database have lens information. <note>Recreate the Exif search database to ensure lens data for all images.</note>
ar: ليس جميع الصور في قاعدة البيانات تحتوي على معلومات العدسة. <note>أعد إنشاء قاعدة بيانات بحث Exif لضمان وجود بيانات العدسة لجميع الصور.</note>
lv: Ne visiem datubāzē esošajiem attēliem ir informācija par lēcu. <note>Lai nodrošinātu lēcu datus visiem attēliem, no jauna izveidojiet „Exif“ meklēšanas datubāzi.</note>

source: <p>No file name given!</p>
ar: <p>لم يُعط اسم للملفّ!</p>
lv: <p>Nav norādīts datnes nosaukums!</p>

source: Generating images for HTML page
ar: توليد الصور لصفحة لغة علامات النص الفائق HTML
lv: Ģenerē attēlus HTML lapai

source: Error copying %1 to %2
ar: خطأ في نسخ %1 غلى %2
lv: Kļūda, kopējot „%1“ uz „%2“

source: <a href="%1">prev</a>
ar: <a href="%1">السابق</a>
lv: <a href="%1">iepr.</a>

source: prev
ar: السابق
lv: iepr.

source: <a href="index-%1.html">index</a>
ar: <a href="index-%1.html">الدليل</a>
lv: <a href="index-%1.html">indekss</a>

source: <a href="%1">next</a>
ar: <a href="%1">التالي</a>
lv: <a href="%1">nāk.</a>

source: next
ar: التالي
lv: nāk.

source: Could not create file '%1'.
ar: لم أتمكن من إنشاء الملف '%1'.
lv: Neizdevās izveidot datni „%1“.

source: Could Not Create File
ar: لم أتمكن من إنشاء الملف
lv: Neizdevās izveidot datni

source: <p>Unable to copy %1 to %2</p>
ar: <p>غير قادر على نسخ الملف %1 إلى %2</p>
lv: <p>Neizdevās nokopēt „%1“ uz „%2“</p>

source: Unable to write image '%1'.
ar: غير قادر على كتابة الصورة '%1'.
lv: Neizdodas rakstīt attēlu „%1“.

source: Date
ar: التاريخ
lv: Datums

# @title:window
source: HTML Export
ar: تصدير HTML
lv: HTML eksports

source: Content
ar: المحتوى
lv: Saturs

source: Page title:
ar: عنوان الصفحة:
lv: Lapas virsraksts:

source: Copyright:
ar: حقوق النسخ:
lv: Autortiesības:

source: Description:
ar: الوصف:
lv: Apraksts:

source: Create .kim export file
ar: أنشئ ملف التصدير .kim
lv: Izveidot „.kim“ eksporta datni

# Inline as a verb, i.e. 'please show movies right on the page, not as links'
source: Inline Movies in pages
ar: ضمّن مقاطع الفيديو مباشرة في الصفحات
lv: Lapā ievietot pašus video

# Tag as in HTML-tag, not as in image tag
source: Use HTML5 video tag
ar: استخدم وسم فيديو HTML5
lv: Izmantot HTML5 video birku

source: <p>This selection will generate video files suitable for displaying on web. avconv and ffmpeg2theora are required for video file generation.</p>
ar: <p>هذا الخيار سيولد ملفات فيديو مناسبة للعرض على الويب. avconv و ffmpeg2theora مطلوبان لتوليد ملفات الفيديو.</p>
lv: <p>Šī atlase ģenerēs video datnes, kas ir piemērotas attēlošanai internetā. To ģenerēšanai ir nepieciešams „avconv“ un „ffmpeg2theora“.</p>

source: Generate HTML5 video files (mp4 and ogg)
ar: ولّد ملفات فيديو HTML5 (mp4 و ogg)
lv: Ģenerēt HTML5 video datnes („mp4“ un „ogg“)

source: What to Include
ar: ما هي الأشياء التي يجب ضمّها
lv: Ko iekļaut

source: Layout
ar: التخطيط
lv: Izkārtojums

source: Thumbnail size:
ar: حجم المصغّرة:
lv: Sīktēla izmērs:

source: Number of columns:
ar: عدد الأعمدة:
lv: Kolonnu skaits:

source: Theme:
ar: السمة:
lv: Motīvs:

source: Theme Description
ar: وصف السمة
lv: Motīva apraksts

source: Image Sizes
ar: حجم الصور
lv: Attēlu izmēri

source: Full size
ar: كامل الحجم
lv: Pilns izmērs

source: Destination
ar: الهدف
lv: Galamērķis

source: Base folder:
ar: المجلد الأساسي:
lv: Pamata mape:

source: Gallery folder:
ar: مجلد المعرض :
lv: Galerijas mape:

source: Output folder:
ar: مجلد المخرجات:
lv: Izvades mape:

source: URL for final destination of .kim file:
ar: عنوان URL للوجهة النهائية لملف .kim:
lv: URL „.kim“ datnes galamērķim:

source: <p>If you move the gallery to a remote location, set this to the destination URL.</p><p>This only affects the generated <filename>.kim</filename> file.</p>
ar: <p>إذا قمت بنقل المعرض إلى موقع بعيد، فاضبط هذا على عنوان URL الوجهة.</p><p>هذا يؤثر فقط على ملف <filename>.kim</filename> المُنشأ.</p>
lv: <p>Pārvietojot galeriju uz attālu vietu, norādiet šo kā mērķa URL.</p><p>Tas ietekmē tikai ģenerēto <filename>.kim</filename> datni.</p>

source: Open gallery in browser:
ar: افتح المعرض في المتصفح:
lv: Atvērt galeriju pārlūkprogrammā:

source: You must select at least one resolution.
ar: يجب عليك أن تختار غلى الأقل دقة ( الصورة) واحدة.
lv: Jānorāda vismaz viena izšķirtspēja.

source: Select base folder...
ar: حدد المجلد الأساسي...
lv: Atlasiet pamata mapi...

source: <p>You did not specify a base folder. This is the topmost folder for your images. Each generated collection will be contained in this folder in separate subfolders.</p>
ar: <p> لم تحدّد مجلد أساسي. هذا هو المجلد الأعلى لصورك. كل مجموعة مُنشأة ستُضع في هذا المجلد في مجلدات فرعية منفصلة.</p>
lv: <p>Jūs nenorādījāt pamata mapi. Tā ir attēlu mapju struktūras augstākā līmeņa mape. Katra ģenerētā kolekcija atradīsies šajā mapē atsevišķās apakšmapēs.</p>

source: No Base Folder Specified
ar: لم تحدّد مجلد أساسي
lv: Nav norādīta pamata mape

source: <p>You did not specify an output folder. This is a folder containing the actual images. The folder will be a subfolder of the base folder specified above.</p>
ar: <p>لم تحدّد مجلد إخراج. هذا هو المجلد الذي يحتوي على الصور الفعلية. سيكون المجلد مجلدًا فرعيًا للمجلد الأساسي المحدد أعلاه.</p>
lv: <p>Jūs nenorādījāt izvades mapi. Šī ir mape, kas satur pašus attēlus. Šī mape būs augstāk norādītās pamata mapes apakšmape.</p>

source: No Output Folder Specified
ar: لم تحدّد مجلد إخراج
lv: Izvades mape nav norādīta

source: <p>Error while reading information about %1. This is most likely because the folder does not exist.</p><p>The error message was: %2</p>
ar: <p>خطأ أثناء قراءة المعلومات حول %1. هذا على الأرجح لأن المجلد غير موجود.</p><p>كانت رسالة الخطأ: %2</p>
lv: <p>Kļūda, lasot informāciju par „%1“. Visdrīzāk tāpēc, ka šī mape nepastāv.</p><p>Kļūdas ziņojums bija: %2</p>

source: <p>%1 does not exist, is not a folder or cannot be written to.</p>
ar: <p>%1 غير موجود، أو ليس مجلدًا، أو لا يمكن الكتابة إليه.</p>
lv: <p>„%1“ nepastāv, nav mape vai tajā neizdodas rakstīt.</p>

source: <p>Output folder %1 already exists. Usually, this means you should specify a new folder.</p><p>Should %2 be deleted first?</p>
ar: <p>مجلد الإخراج %1 موجود فعلًا. عادةً، هذا يعني أنه يجب عليك تحديد مجلد جديد.</p><p>هل يجب حذف %2 أولاً؟</p>
lv: <p>Izvades mape „%1“ jau pastāv. Parasti tas nozīmē, ka ir jānorāda jauna mape.</p><p>Vai vispirms dzēst „%2“?p>

# @title
source: Folder Exists
ar: المجلد موجود
lv: Mape pastāv

source: Could not find any themes - this is very likely an installation error
ar: لم أستطع العثور على أي سمة - يمكن أن يكون هذا خطأ في التثبيت
lv: Neizdevās atrast nevienu motīvu — tā varētu būt instalācijas kļūda

source: More than one theme is set as default, using theme %1
ar: عُيّن أكثر من سمة مبدئية، سيستخدم السمة %1
lv: Kā noklusējums ir norādīts vairāk par vienu motīvu, izmanto motīvu „%1“

source: by
ar: بواسطة
lv: autors:

source: <p>Gallery folder cannot be empty.</p>
ar: <p>لا يمكن أن يكون مجلد المعرض فارغًا.</p>
lv: <p>Galerijas mape nevar būt tukša.</p>

source: <p>The output folder already exists.</p>
ar: <p>مجلد الإخراج موجود فعلًا.</p>
lv: <p>Izvades mape jau pastāv.</p>

source: Failed to start
ar: فشل البدء
lv: Neizdevās palaist

source: Crashed
ar: انهار
lv: Avarēja

source: Timedout
ar: انتهت المهلة
lv: Noildze

source: Read error
ar: خطأ قراءة
lv: Lasīšanas kļūda

source: Write error
ar: خطأ كتابة
lv: Rakstīšanas kļūda

source: Unknown error
ar: خطأ مجهول
lv: Nezināma kļūda

source: <p>Error when extracting video thumbnails.<br/>Error was: %1</p>
ar: <p>خطأ عند استخراج الصور المصغرة للفيديو.<br/>كان الخطأ: %1</p>
lv: <p>Kļūda, izvelkot video sīktēlus.<br/>Kļūda bija: %1</p>

source: Unable to extract video thumbnails from some files. Either the file is damaged in some way, or the video is ultra short. For your convenience, the token '%1' has been set on those videos. (You might need to wait till the video extraction led in your status bar has stopped blinking, to see all affected videos.)
ar: تعذر استخراج الصور المصغرة للفيديو من بعض الملفات. إما أن الملف تالف بطريقة ما، أو أن الفيديو قصير جدًا. لتسهيل الأمر عليك، وُضع الرمز المميز '%1' على تلك المقاطع. (قد تحتاج إلى الانتظار حتى يتوقف مؤشر استخراج الفيديو في شريط الحالة عن الوميض لرؤية جميع المقاطع المتأثرة.)
lv: Neizdodas izvilkt video sīktēlus no dažām mapēm. Vai nu mape ir kādā veidā bojāta, vai arī video ir ārkārtīgi īss. Jūsu ērtībai, šiem video ir iestatīts marķieris „%1“. (Iespējams, lai redzētu visus šādus video, jums būs jāpagaida līdz statusa joslā beidz mirgot video izvilkšanas indikators.)

source: Building all thumbnails may take a long time.
ar: بناء جميع المصغرات قد يستغرق وقتًا طويلاً.
lv: Sīktēlu veidošana var aizņemt ilgu laiku.

source: Do you want to rebuild all of your thumbnails?
ar: هل تريد إعادة بناء جميع المصغرات الخاصة بك؟
lv: Vai vēlaties pārbūvēt visus sīktēlus?

source: Building thumbnails
ar: يبني المصغرات
lv: Būvē sīktēlus

source: Save an export file
ar: احفظ ملف تصدير
lv: Saglabāt eksporta datni

source: KPhotoAlbum import files
ar: ملفات استيراد دفتر الصور
lv: „KPhotoAlbum“ importa datnes

# @title:window
source: Export Configuration / Copy Images
ar: ضبط التصدير / نسخ الصور
lv: Eksporta konfigurācija / kopēt attēlus

source: How to Handle Images
ar: كيفية التعامل مع الصور
lv: Kā apstrādāt attēlus

source: Include in .kim file
ar: ضمّن في الملف .kim
lv: Iekļaut .kim datnē

source: Do not copy files, only generate .kim file
ar: لا تنسخ الملفات، ولّد فقط ملف .kim
lv: Nekopēt datnes, ģenerēt tikai „.kim“ datni

source: Automatically copy next to .kim file
ar: انسخ آليّاً التالي إلى الملف .kim
lv: Automātiski kopēt pie „.kim“ datnes

source: Hard link next to .kim file
ar: رابط ثابت بجانب ملف .kim
lv: Cietā saite pie „.kim“ datnes

source: Symbolic link next to .kim file
ar: رابط رمزي بجانب ملف .kim
lv: Simboliskā saite pie „.kim“ datnes

source: Compress export file
ar: اضغط ملف التصدير
lv: Saspiesta eksportēšanas datne

source: Generate thumbnails
ar: ولّد مصغرات
lv: Ģenerēt sīktēlus

source: Limit maximum image dimensions to:
ar: حدّد أقصى مقاس للصورة إلى:
lv: Ierobežot maksimālo attēlu lielumu līdz:

source: <p>If your images are stored in a non-compressed file format then you may check this; otherwise, this just wastes time during import and export operations.</p><p>In other words, do not check this if your images are stored in jpg, png or gif; but do check this if your images are stored in tiff.</p>
ar: <p>إذا كانت صورك مخزنة بصيغة ملف غير مضغوطة، فيمكنك تفعيل هذا الخيار؛ وإلا فإنه يهدر الوقت أثناء عمليات الاستيراد والتصدير.</p><p>بمعنى آخر، لا تفعل هذا الخيار إذا كانت صورك مخزنة بصيغ jpg أو png أو gif؛ ولكن فعّله إذا كانت صورك مخزنة بصيغة tiff.</p>
lv: <p>Šo varat atlasīt, ja attēlus glabājat formātā, kas nesniedz saspiešanu, pretējā gadījumā tas tikai paildzinās eksportēšanas un importēšanas darbību.</p><p>Citiem vārdiem sakot — neatzīmējiet šo, ja attēlus gabājat „jpg“, „png“ vai „gif“, bet atzīmējiet, ja attēlus glabājat „tiff“ formātā.</p>

source: <p>Generate thumbnail images</p>
ar: <p>ولّد صور المصغرات</p>
lv: <p>Ģenerēt sīktēlus</p>

source: <p>With this option you may limit the maximum dimensions (width and height) of your images. Doing so will make the resulting export file smaller, but will of course also make the quality worse if someone wants to see the exported images with larger dimensions.</p>
ar: <p>باستخدام هذا الخيار، يمكنك تحديد أقصى أبعاد (العرض والارتفاع) لصورك. يؤدي ذلك إلى جعل ملف التصدير الناتج أصغر حجمًا، ولكن بالطبع ستقل الجودة إذا رغب أحد في رؤية الصور المصدرة بأبعاد أكبر.</p>
lv: <p>Šī opcija ļauj samazināt attēlu maksimālo izmēru (platums un augstums). Tas var samazināt rezultātā iegūto datņu izmērus, bet tāpat arī samazinās attēlu kvalitāti, ja kāds vēlēsies tos apskatīt pilnā izmērā.</p>

source: <p>When exporting images, bear in mind that there are two things the person importing these images again will need:<br/>1) meta information (image content, date etc.)<br/>2) the images themselves.</p><p>The images themselves can either be placed next to the .kim file, or copied into the .kim file. Copying the images into the .kim file works well for a recipient who wants all, or most of those images, for example when emailing a whole group of images. However, when you place the images on the Web, a lot of people will see them but most likely only download a few of them. It works better in this kind of case, to separate the images and the .kim file, by place them next to each other, so the user can access the images s/he wants.</p>
ar: <p>عند تصدير الصور، تذكر أن هناك شيئين سيحتجاهما الشخص الذي يستورد هذه الصور مرة أخرى:<br/>1) المعلومات الوصفية (محتوى الصورة، التاريخ، إلخ)<br/>2) الصور نفسها.</p><p>يمكن وضع الصور نفسها بجانب ملف .kim، أو نسخها داخل ملف .kim. يعمل نسخ الصور داخل ملف .kim بشكل جيد للمستلم الذي يريد كل أو معظم تلك الصور، على سبيل المثال عند إرسال مجموعة كاملة من الصور بالبريد الإلكتروني. ومع ذلك، عند وضع الصور على الويب، سيراها الكثير من الأشخاص ولكن على الأرجح ستُحمل عدد قليل منها فقط. في هذه الحالة، من الأفضل فصل الصور وملف .kim، بوضعهما بجانب بعضهما البعض، حتى يتمكن المستخدم من الوصول إلى الصور التي يريدها.</p>
lv: <p>Eksportējot attēlus, atcerieties, ka personai, kura tos importēs, vajadzēs divas lietas:<br/>1) metadatus (attēla saturs, datums, u.c.)<br/>2) pašus attēlus.</p><p>Attēlus var novietot tajā pašā mapē, kurā atrodas „.kim“ datne, vai nokopēt „.kim“ datnē. Kopēšana „.kim“ datnē labi strādā saņēmējam, kas vēlas visas vai lielāko daļu no attēliem, tos sūtot kopā, piemēram, uz e-pastu. Tomēr, saglabājot attēlu tīmeklī, daudzi cilvēki tos var apskatīt, bet visdrīzāk tos lejupielādēs tikai maza daļa no viņiem. Šādā gadījumā labāka izvēla ir atdalīt „.kim“ datni, to novietojot blakus attēlam, lai lietotājs var piekļūst uzreiz tikai attiecīgajam attēlam.</p>

source: Error creating zip file
ar: خطأ في إنشاء الملف المضغوط zip
lv: Kļūda, veidojot ZIP datni

source: &Cancel
ar: أل&غِ
lv: &Atcelt

source: Creating index file
ar: إنشاء ملف الفهرسة
lv: Veido indeks datni

source: Creating thumbnails
ar: إنشاء المصغرات
lv: Veido sīktēlus

source: Copying image files
ar: نسخ ملفات الصورة
lv: Kopē attēlu datnes

source: Error writing file %1
ar: خطأ عند كتابة الملف %1
lv: Kļūda, rakstot datni „%1“

source: <p>Other KPhotoAlbum users may now load the import file into their database, by choosing <b>import</b> in the file menu.</p><p>If they find it on a web site, and the web server is correctly configured, all they need to do is simply to click it from within konqueror. To enable this, your web server needs to be configured for KPhotoAlbum. You do so by adding the following line to <b>/etc/httpd/mime.types</b> or similar:<pre>application/vnd.kde.kphotoalbum-import kim</pre>This will make your web server tell konqueror that it is a KPhotoAlbum file when clicking on the link, otherwise the web server will just tell konqueror that it is a plain text file.</p>
ar: <p>يمكن لمستخدمي دفتر الصور الآخرين الآن تحميل ملف الاستيراد إلى قاعدة بياناتهم، باختيار <b>استيراد</b> في قائمة الملف.</p><p>إذا وجدوه على موقع ويب، وكان خادم الويب مضبوطًا بشكل صحيح، فكل ما عليهم فعله هو النقر عليه ببساطة من داخل konqueror. لتمكين هذا، يجب تهيئة خادم الويب الخاص بك ليعمل مع دفتر الصور. افعل ذلك بإضافة السطر التالي إلى <b>/etc/httpd/mime.types</b> أو ما يشابهه:<pre>application/vnd.kde.kphotoalbum-import kim</pre>سيجعل هذا خادم الويب يخبر konqueror بأنه ملف دفتر الصور عند النقر على الرابط، وإلا فسيخبر خادم الويب konqueror بأنه ملف نصي عادي.</p>
lv: <p>Citi „KPhotoAlbum“ lietotāji tagad var ielādēt importēšanas datni savā datubāzē, datnes izvēlnē spiežot uz <b>importēt</b>.</p><p>Ja viņi šo datni atrod uz pareizi konfigurēta tīmekļa servera, viņiem pietiek uz datnes noklikšķinot „Konqueror“ programmā. Lai ieslēgtu šo funkciju, tīmekļa serveris ir jākonfigurē „KPhotoAlbum“ izmantošanai. To varat izdarīt, servera <b>/etc/httpd/mime.types</b> datnē (vai analogā) pievienojot rindiņu:<pre>application/vnd.kde.kphotoalbum-import kim</pre>Tas liks tīmekļa serverim, uzklikšķinot uz saites, norādīt „Konqueror“ programmai, ka tā ir „KPhotoAlbum“ datne. Pretējā gadījumā tīmekļa serveris „Konqueror“ programmai norādīs, ka tā ir neformatēta teksta datne.</p>

source: How to Use the Export File
ar: كيفية استعمال ملف التصدير
lv: Kā izmantot eksportēšanas datni

source: KPhotoAlbum Export Files
ar: ملفات تصدير دفتر الصور
lv: „KPhotoAlbum“ eksportēšanas datnes

source: Unable to create temporary file
ar: تعذر إنشاء ملف مؤقت
lv: Neizdodas izveidot pagaidu datni

source: <p>XML file did not specify the source of the images, this is a strong indication that the file is corrupted</p>
ar: <p>لم يحدد ملف XML مصدر الصور، وهذا مؤشر قوي على تلف الملف</p>
lv: <p>XML datnē nebija norādīts attēlu avots, tas parasti nozīmē, ka datne ir bojāta</p>

source: <h1><font size="+2">Welcome to KPhotoAlbum Import</font></h1>This wizard will take you through the steps of an import operation. The steps are: <ol><li>First you must select which images you want to import from the export file. You do so by selecting the checkbox next to the image.</li><li>Next you must tell KPhotoAlbum in which folder to put the images. This folder must of course be contained by the base folder KPhotoAlbum uses for images. KPhotoAlbum will take care to avoid name clashes</li><li>The next step is to specify which categories you want to import (People, Places, ... ) and also tell KPhotoAlbum how to match the categories from the file to your categories. Imagine you load from a file, where a category is called <b>Blomst</b> (which is the Danish word for flower), then you would likely want to match this with your category, which might be called <b>Blume</b> (which is the German word for flower) - of course given you are German.</li><li>The final steps, is matching the individual tokens from the categories. I may call myself <b>Jesper</b> in my image database, while you want to call me by my full name, namely <b>Jesper K. Pedersen</b>. In this step non matches will be highlighted in red, so you can see which tokens was not found in your database, or which tokens was only a partial match.</li></ol>
ar: <h1><font size="+2">مرحبًا بك في استيراد دفتر الصور</font></h1> سيرشدك هذا المعالج خلال خطوات عملية الاستيراد. الخطوات هي: <ol><li>أولاً، يجب عليك تحديد الصور التي تريد استيرادها من ملف التصدير. افعل ذلك بتحديد خانة الاختيار المجاورة للصورة.</li><li>بعد ذلك، يجب إخبار دفتر الصور بالمجلد الذي تريد وضع الصور فيه. يجب أن يكون هذا المجلد بالطبع ضمن المجلد الأساسي الذي يستخدمه دفتر الصور للصور. سيتولى دفتر الصور تجنب تعارض الأسماء</li><li>الخطوة التالية هي تحديد الفئات التي تريد استيرادها (أشخاص، أماكن، ...) وإخبار دفتر الصور أيضًا بكيفية مطابقة الفئات من الملف مع فئاتك. تخيل أنك تقوم بالتحميل من ملف، حيث تسمى فئة <b>Blomst</b> (وهي الكلمة الدنماركية للزهرة)، فمن المحتمل أنك تريد مطابقة هذه مع فئتك، والتي قد تسمى <b>Blume</b> (وهي الكلمة الألمانية للزهرة) - بالطبع إذا كنت ألمانيًا.</li><li>الخطوات الأخيرة، هي مطابقة الرموز الفردية من الفئات. قد أسمي نفسي <b>Jesper</b> في قاعدة بيانات الصور الخاصة بي، بينما تريد أن تناديني باسمي الكامل، وهو <b>Jesper K. Pedersen</b>. في هذه الخطوة، ستُميز التطابقات غير الموجودة باللون الأحمر، حتى تتمكن من رؤية الرموز التي لم يعثر عليها في قاعدة البيانات الخاصة بك، أو الرموز التي كانت تطابقًا جزئيًا فقط.</li></ol>
lv: <h1><font size="+2">Laipni lūgti „KPhotoAlbum“ importēšanā</font></h1>Šis vednis ļaus pa soļiem veikt importēšanu. Veicamās darbības ir: <ol><li>Vispirms atlasiet, kurus attēlus vēlaties importēt no eksportēšanas datnes. Varat to izdarīt, klikšķinot uz izvēles rūtiņas pie attēla.</li><li>Pēc tam norādiet „KPhotoAlbum“, kurā mapē attēlus ievietot. Šai mapei, protams, jāatrodas pamata mapē, ko „KPhotoAlbum“ izmanto attēliem. „KPhotoAlbum“ parūpēsies par nosaukumu sadursmēm</li><li>Nākamais solis ir norādīt importējamās kategorijas (Cilvēki, Vietas, ... ) un norādīt „KPhotoAlbum“, kā kategorijas no datnes atbilst jūsu kategorijām. Iedomājieties, ka ielādējat datni, kurā kategorija saucas <b>Blomst<b/> (kas ir dāņu valodas vārds 'puķei'), bet vēlaties, lai tas atbilstu jūsu albuma kategorijai, kas saucas <b>Blume</b> (kas ir vācu valodas vārds 'puķei'), jo šajā piemērā jūs būtu vācietis.</li><li>Pēdējais solis ir atrast atbilstošos kategoriju marķierus. Savā attēlu datubāzē es sevi varbūt saucu par <b>Jesper</b>, bet citā datubāzē varbūt mani kāds ir nosaucis pilnā vārdā <b>Jesper K. Pedersen</b>. Šajā solī neatbilstošie marķieri tiks iekrāsoti sarkanā krāsā, kas ļaus redzēt, kuri marķieri nav atrasti datubāzē vai kuriem marķieriem ir tikai daļēja atbilsme.</li></ol>

# @title:tab introduction page
source: Introduction
ar: المقدمة
lv: Ievads

source: Select All
ar: حدّد الكلّ
lv: Atlasīt visu

source: Deselect All
ar: ألغِ تحديد الكلّ
lv: Noņemt atlasi visam

source: Select Which Images to Import
ar: اختر الصورة للاستيراد
lv: Atlasiet, kurus attēlus importēt

source: Destination of images:
ar: هدف الصور:
lv: Attēlu atrašanās vieta:

source: Destination of Images
ar: هدف الصور
lv: Attēlu atrašanās vieta

source: The folder must be a subfolder of %1
ar: يجب أن يكون المجلد مجلدًا فرعيًا لـ %1
lv: Mapei jābūt „%1“ apakšmapei

source: This folder is reserved for category images.
ar: هذا المجلد محجوز لصور الفئات.
lv: Šī mape ir rezervēta kategorijas attēliem.

source: Match Categories
ar: مواءمة الأصناف
lv: Pieskaņot kategorijas

source: Folder %1 does not exist. Should it be created?
ar: المجلد %1 غير موجود. هل يجب إنشاؤه؟
lv: „%1“ mape nepastāv. Vai to izveidot?

# @title
source: Create folder?
ar: إنشاء مجلد؟
lv: Vai izveidot mapi?

# @action:button
source: Create
ar: أنشئ
lv: Izveidot

source: Error creating folder %1
ar: خطأ في إنشاء المجلّد %1
lv: Kļūda, izveidojot mapi „%1“

source: How to resolve clashes
ar: كيفية حل التعارضات
lv: Kā atrisināt sadursmes

# @title:window
source: Copying Images
ar: ينسخ الصور
lv: Kopēt attēlus

source: Error when writing image %1
ar: حدث خطأ عند كتابة الصورة %1
lv: Kļūda,rakstot attēlu „%1“

source: Updating Database
ar: يحدّث قاعدة البيانات
lv: Atjaunina datubāzi

source: Cannot copy from any of the following locations:
ar: تعذر النسخ من أي من المواقع التالية:
lv: Neizdodas kopēt no šīm vietām:

# @title
source: Copy failed
ar: فشل النسخ
lv: Kopēšanas neizdevās

# @action:button
source: Continue without Asking
ar: تابع دون سؤال
lv: Turpināt nevaicājot

source: Key in file
ar: المفتاح في الملف
lv: Atslēga datnē

source: Key in your database
ar: المفتاح في قاعدة بياناتك
lv: Atslēga datubāzē

source: Unable to open '%1' for reading.
ar: غير قادر على فتح '%1' للقراءة.
lv: Neizdodas lasīšanai atvērt „%1“.

source: Error Importing Data
ar: خطأ استيراد البيانات
lv: Kļūda, importējot datus

source: Error reading folder contents of file %1; it is likely that the file is broken.
ar: حدث خطأ في قراءة محتويات مجلد الملف %1؛ من المحتمل أن الملف تالف.
lv: Kļūda, lasot „%1“ datnes mapes saturu. Iespējams, šī datne ir bojāta.

source: Error reading index.xml file from %1; it is likely that the file is broken.
ar: خطأ عند قراءة الملف index.xml من %1، من المحتمل أن يكون الملف معطوب.
lv: Kļūda, nolasot „index.xml“ datni no „%1“. Iespējams, datne ir bojāta.

source: Thumbnail item in export file was not a folder, this indicates that the file is broken.
ar: عنصر الصورة المصغرة في ملف التصدير لم يكن مجلدًا، وهذا يشير إلى أن الملف تالف.
lv: Sīktēlu vienu eksportēšanas datnē nebija mape, kas norāda, ka datne ir bojāta.
