Repository: KDE/kphotoalbum
Catalog: po/*/kphotoalbum.po
Languages: ar, lv

source: No thumbnail existed in export file for %1
ar: لم يوجد ظفر في ملف التصدير لِــ %1
lv: Eksportēšanas datnē nav atrasts sīktēlus priekš „%1“

source: Export file did not contain a Images subfolder, this indicates that the file is broken
ar: لم يحتوي ملف التصدير على مجلد فرعي للصور، وهذا يشير إلى أن الملف تالف
lv: Eksportēšanas datne nesaturēja attēlu apakšmapi, kas norāda, ka datne ir bojāta

source: Images item in export file was not a folder, this indicates that the file is broken
ar: عنصر الصور في ملف التصدير لم يكن مجلدًا، وهذا يشير إلى أن الملف تالف
lv: Attēlu vienums eksportēšanas datnē nebija mape, kas norāda, ka datne ir bojāta

source: No image existed in export file for %1
ar: لم يوجد صورة في ملف التصدير لِــ %1
lv: Neviens attēls nepastāv eksportēšanas datnē priekš „%1“

source: One image from the import file, has the same MD5 sum as an image in the Database, how should that be resolved?
ar: صورة واحدة من ملف الاستيراد، لها نفس مجموع MD5 كصورة في قاعدة البيانات، كيف يجب حل ذلك؟
lv: %1 attēlam importēšanas datnē ir vienāda MD5 kontrolsumma ar attēliem datubāzē. Kā rīkoties?

source: Use data from Import File
ar: استخدم البيانات من ملف الاستيراد
lv: Izmantot datus no importēšanas datnes

source: Use data from Database
ar: استخدم البيانات من قاعدة البيانات
lv: Izmantot datus no datubāzes

source: Merge data
ar: ادمج البيانات
lv: Apvienot datus

source: Date and Time
ar: التاريخ والوقت
lv: Datums un laiks

# @info:shell
source: Conflicting commandline options: %1 and %2!
ar: خيارات سطر الأوامر متضاربة: %1 و %2!
lv: Konfliktējošas komandrindas opcijas: %1 un %2!

source: KPhotoAlbum Thumbnail Tool
ar: أداة الصور المصغرة لـ دفتر الصور
lv: „KPhotoAlbum“ sīktēlu rīks

source: Tool for inspecting and editing the KPhotoAlbum thumbnail cache
ar: أداة لفحص وتحرير ذاكرة التخزين المؤقت للصور المصغرة لـ دفتر الصور
lv: Rīks „KPhotoAlbum“ sīktēlu kešatmiņas pārbaudīšanai un rediģēšanai

source: Copyright (C) 2020-2025 The KPhotoAlbum Development Team
ar: حقوق النشر (C) 2020-2025 فريق تطوير دفتر الصور

source: Johannes Zarl-Zierl
ar: يوهانيس زارل-زيرل

source: Development, Maintainer
ar: تطوير، صيانة
lv: Izstrādātājs, uzturētājs

source: Robert Krawitz
ar: روبرت كراويتز

source: Development, Optimization
ar: تطوير، تحسين
lv: Izstrādātājs, optimizējis darbības

source: Tobias Leupold
ar: توبياس لويبولد

source: Development, Releases, Website
ar: تطوير، إصدارات، موقع الويب
lv: Izstrādātājs, sniedzis relīzes, veidojis tīmekļa vietni

source: Jesper K. Pedersen
ar: جيسبر ك. بيدرسن

source: Former Maintainer, Project Creator
ar: الصائن السابق، منشئ المشروع
lv: Agrākais izstrādātājs, projekta izveidotājs

source: Hassan Ibraheem
ar: حسان إبراهيم

source: Jan Kundr&aacute;t
ar: يان كوندرات

source: Andreas Neustifter
ar: أندرياس نويسفتر

source: Tuomas Suutari
ar: تووماس سوتاري

source: Miika Turkia
ar: مييكا توركيا

source: Henner Zeller
ar: هنر زيلر

# @info:shell
source: The folder containing the .thumbnail folder.
ar: المجلد الذي يحتوي على مجلد .thumbnail.
lv: Mape, kas satur „.thumbnail“ mapi.

# @info:shell
source: Print information about thumbnail cache.
ar: اطبع معلومات حول ذاكرة التخزين المؤقت للصور المصغرة.
lv: Drukāt informāciju par sīktēlu kešatmiņu.

# @info:shell
source: Convert thumbnailindex to format suitable for KPhotoAlbum >= 4.3.
ar: حوّل فهرس الصور المصغرة إلى تنسيق مناسب لـ دفتر الصور >= 4.3.
lv: Konvertēt „thumbnailindex“ uz formātu, kas ir piemērots „KPhotoAlbum“ >= 4.3.

# @info:shell
source: Check thumbnail cache for consistency of thumbnail dimensions.
ar: افحص ذاكرة التخزين المؤقت للصور المصغرة للتأكد من اتساق أبعادها.
lv: Pārbaudiet sīktēlu kešatmiņu saistībā ar sīktēlu izmēru konsekvenci.

# @info:shell
source: Fix inconsistent thumbnails by removing them from the cache (requires --check-thumbnail-dimensions).
ar: أصلح الصور المصغرة غير المتسقة بإزالتها من الذاكرة المؤقتة (يتطلب --check-thumbnail-dimensions).
lv: Salabot nekonsekventus sīktēlus, izņemot tos no kešatmiņas (nepieciešamas „--check-thumbnail-dimensions“).

# @info:shell
source: Remove unreferenced thumbnails from the thumbnail data files.
ar: أزل الصور المصغرة غير المشار إليها من ملفات بيانات الصور المصغرة.
lv: No sīktēlu aprakstošajām datnēm noņemt atsauces uz neesošiem sīktēliem.

# @info:shell
source: Be less verbose.
ar: كن أقل تفصيلاً.
lv: Būt mazāk informatīvam.

# @info:shell
source: Missing argument!
ar: وسيط مفقود!
lv: Trūkst parametra!

# @info:shell
source: %1 is not a folder!
ar: %1 ليس مجلدًا!
lv: „%1“ nav datne!

# @info:shell
source: Thumbnail cache folder: %1
ar: مجلد ذاكرة التخزين المؤقت للصور المصغرة: %1
lv: Sīktēlu kešatmiņas datne: %1

# @info:shell
source: Thumbnail index file version: %1
ar: إصدار ملف فهرس الصور المصغرة: %1
lv: Sīktēlu indeksa datnes versija: %1

# @info:shell
source: Maximum supported thumbnailindex file version: %1
ar: أقصى إصدار مدعوم لملف فهرس الصور المصغرة: %1
lv: Maksimāla atbalstītā „thumbnailindex“ datnes versija: %1

# @info:shell
source: Thumbnail storage dimensions: %1 pixels
ar: أبعاد تخزين الصور المصغرة: %1 بكسل
lv: Sīkdatņu glabāšanas izmērs: %1 pikseļi

# @info:shell
source: Note: Thumbnail storage dimensions are defined in the configuration file prior to v5.
ar: ملاحظة: كانت أبعاد تخزين الصور المصغرة تُحدد في ملف الإعدادات قبل الإصدار v5.
lv: Piezīme: pirms 5. versijas sīkdatņu glabāšanas izmēri ir definēti konfigurācijas datnē.

# @info:shell
source: Number of thumbnails: %1
ar: عدد الصور المصغرة: %1
lv: Sīkdatņu skaits: %1

# @info:shell
source: No inconsistencies found.
ar: لم يعثر على أي عدم اتساق.
lv: Nekonsekvences nav atrastas.

# @info:shell This line is printed before a list of file names.
source: The following thumbnails appear to have incorrect sizes:
ar: يبدو أن للصور المصغرة التالية أحجام غير صحيحة:
lv: Izskatās, ka šiem sīktēliem ir nepareizi izmēri:

# @info:shell
source: Removed 1 inconsistent thumbnail from the database.
ar: أزيلت صورة مصغرة غير متسقة واحدة من قاعدة البيانات.
lv: No datubāzes ir noņemts %1 nekonsekvents sīktēls.

# @info:shell
source: Could not open file `thumbnailindex`!
ar: تعذر فتح الملف `thumbnailindex`!
lv: Neizdevās atvērt datni „thumbnailindex“!

# @info:shell
source: Thumbnail index was not changed.
ar: لم يتغيّر فهرس الصور المصغرة.
lv: Sīktēlu indekss netika izmainīts.

# @info:shell
source: Could not open temporary file for writing!
ar: تعذر فتح ملف مؤقت للكتابة!
lv: Neizdevās rakstīšanai atvērt pagaidu datni!

# @info:shell
source: Could not back up file `thumbnailindex`!
ar: تعذر إنشاء نسخة احتياطية للملف `thumbnailindex`!
lv: Neizdevās izveidot „thumbnailindex“ datnes rezerves kopiju!

# @info:shell
source: Could not copy temporary thumbnail index file to final location!
ar: تعذر نسخ ملف فهرس الصور المصغرة المؤقت إلى الموقع النهائي!
lv: Neizdevās nokopēt pagaidu sīktēlu indeksa datni uz tās beigu atrašanās vietu!

# @info:shell
source: Error message was: %1
ar: كانت رسالة الخطأ: %1
lv: Kļūdas ziņojums bija: %1

# @info:shell
source: Thumbnail index is not a version 5 file!
ar: فهرس الصور المصغرة ليس ملفًا من الإصدار 5!
lv: Sīktēlu indekss nav 5. versijas datne!

source: &View
ar: &عرض
lv: &Skats

source: Privacy
ar: الخصوصية
lv: Privātums

source: &Maintenance
ar: الإشراف على ال&صيانة
lv: &Apkope

source: Plugins
ar: الملحقات
lv: Spraudņi

source: Main Toolbar
ar: شريط الأدوات الرئيس
lv: Pamata rīkjosla

source: When reading time information of images, their Exif info is used. Exif info may, however, not be supported by your KPhotoAlbum installation, or no valid information may be in the file. As a backup, KPhotoAlbum may use the timestamp of the image - this may, however, not be valid in case the image is scanned in. So the question is, should KPhotoAlbum trust the time stamp on your images?
ar: عند قراءة معلومات وقت الصور، تُستخدم معلومات Exif الخاصة بها. ومع ذلك، قد لا تكون معلومات Exif مدعومة في تثبيت دفتر الصور الخاص بك، أو قد لا توجد معلومات صالحة في الملف. كنسخة احتياطية، قد يستخدم دفتر الصور الطابع الزمني للصورة - ومع ذلك، قد لا يكون هذا صالحًا في حالة مسح الصورة ضوئيًا. لذا فإن السؤال هو، هل يجب على دفتر الصور الوثوق بالطابع الزمني على صورك؟
lv: Nosakot informāciju par to, kad fotogrāfija ir uzņemta, tiek izmantoti tās „Exif“ dati. Tomēr jūsu „KPhotoAlbum“ instalācija var neatbalstīt „Exif“ informāciju vai arī datne var nesaturēt nepieciešamo informāciju. Gadījumos, kad „Exif“ dati nedarbojas, „KPhotoAlbum“ var izmantot attēla laika zīmogu, tomēr skenētiem attēliem tā var nebūt derīga. Tāpēc jautājums ir: vai „KPhotoAlbum“ uzticēties attēlā esošajiem laika zīmogiem?

source: Trust Time Stamps?
ar: أثق في دمغة التوقيت ؟
lv: Vai uzticēties laika zīmogiem?

source: <p>There was an error while accessing the Exif search database. The error is likely due to a broken database file.</p><p>To fix this problem run Maintenance->Recreate Exif Search database.</p><hr/><p>For debugging: the command that was attempted to be executed was:<br/>%1</p><p>The error message obtained was:<br/>%2</p>
ar: <p>حدث خطأ أثناء الوصول إلى قاعدة بيانات بحث Exif. من المحتمل أن يكون الخطأ بسبب ملف قاعدة بيانات تالف.</p><p>لإصلاح هذه المشكلة، شغّل الصيانة->إعادة إنشاء قاعدة بيانات بحث Exif.</p><hr/> <p>لأغراض التصحيح: الأمر الذي حاول تنفيذه كان:<br/>%1</p> <p>رسالة الخطأ التي حصل عليها كانت:<br/>%2</p>
lv: <p>Radās kļūda, piekļūstot „Exif“ meklēšanas datubāzei. Iespējams, tās pamatā ir bojāta datubāzes datne.</p><p>Lai problēmu novērstu, palaidiet „Apkope“—>„No jauna izveidot „Exif“ meklēšanas datubāzi“.</p><hr/><p>Atkļūdošanai: programma mēģināja izpildīt šādu komandu:<br/>%1</p><p>Iegūtais kļūdas ziņojums bija:<br/>%2</p>

source: Error in Exif database
ar: خطأ في قاعدة بيانات Exif
lv: Kļūda, „Exif“ datubāzē

source: <p>There was an error while opening the Exif search database.</p> <p>To fix this problem run Maintenance->Recreate Exif Search database.</p><hr/><p>The error message obtained was:<br/>%1</p>
ar: <p>حدث خطأ أثناء فتح قاعدة بيانات بحث Exif.</p> <p>لإصلاح هذه المشكلة، شغّل الصيانة->إعادة إنشاء قاعدة بيانات بحث Exif.</p><hr/><p>رسالة الخطأ التي حصل عليها كانت:<br/>%1</p>
lv: <p>Atverot „Exif“ meklēšanas datubāzi, notika kļūda.</p> <p>Lai problēmu novērstu, palaidiet „Apkope“—>„No jauna izveidot „Exif“ meklēšanas datubāzi“.</p><hr/><p>Iegūtais kļūdas ziņojums bija:<br/>%1</p>

source: <p>The Exif search database is corrupted and has no data.</p> <p>To fix this problem run Maintenance->Recreate Exif Search database.</p>
ar: <p>قاعدة بيانات بحث Exif تالفة وليس بها بيانات.</p> <p>لإصلاح هذه المشكلة، شغّل الصيانة->إعادة إنشاء قاعدة بيانات بحث Exif.</p>
lv: <p>„Exif“ meklēšanas datubāze ir bojāta un nesatur datus.</p> <p>Lai problēmu novērstu, palaidiet „Apkope“—>„No jauna izveidot „Exif“ meklēšanas datubāzi“.</p>

source: KPhotoAlbum
ar: دفتر الصور

source: KDE Photo Album
ar: دفتر الصور كيدي
lv: KDE Fotoalbums

source: Copyright (C) 2003-2025 The KPhotoAlbum Development Team
ar: حقوق النشر (C) 2003-2025 فريق تطوير دفتر الصور

source: Marco Caldarelli
ar: ماركو كالداريلي

source: Patch for making it possible to reread Exif info using a nice dialog.
ar: رَقْعَة لجعل إعادة قراءة معلومات Exif باستخدام حوار لطيف ممكنة.
lv: Ielāps, lai ļautu pārlasīt „Exif“ informāciju ērtā lodziņā.

source: Jean-Michel FAYARD
ar: جان-ميشيل فايارد

source: Patch with folder info made available through the browser. Patch for adding a check box for "and/or" searches in the search page.
ar: رَقْعَة تجعل معلومات المجلد متاحة عبر المتصفح. رَقْعَة لإضافة خانة اختيار للبحث بـ "و/أو" في صفحة البحث.
lv: Ielāps ar mapes informāciju, kas pieejama no pārlūka. Ielāps izvēles rūtiņas pievienošanai „un/vai“ meklēšanām meklēšanas lapā.

source: Matthias Füssel
ar: ماتياس فيوسل

source: Geo Position page in browser and various bug fixes
ar: صفحة الموقع الجغرافي في المتصفح وإصلاحات أخطاء متنوعة
lv: Ģeolokācijas lapa pārlūkā un dažādi kļūdu labojumi

source: Wes Hardaker
ar: ويس هارداكر

source: Some very useful features to improve workflow
ar: ميزات مفيدة جدًا لتحسين سير العمل
lv: Dažas ļoti noderīgs iespējas darbplūsmas uzlabošanai

source: Reimar Imhof
ar: ريمر إيمهوف

source: Patch to sort items in option listboxes
ar: رُقعة لفرز العناصر في صناديق قوائم الخيارات
lv: Ielāps vienumu kārtošanai opciju sarakstu kastītēs

source: Christoph Moseler
ar: كريستوف موسيلر

source: Numerous patches for lots of bugs, patches for a few new features
ar: رُقع عديدة لأخطاء كثيرة، ورُقع لبعض الميزات الجديدة
lv: Vairāki ielāpi daudzām kļūdām, ielāpi dažām jaunām iespējām

source: Teemu Rytilahti
ar: تيمو ريتيلاهيتي

source: Theme support for HTML generation
ar: إتاحة السمات لتوليد HTML
lv: Motīvu atbalsts HTML ģenerēšanai

source: Thomas Schwarzgruber
ar: توماس شوارزغروبر

source: Patch to sort images in the thumbnail view, reading time info out of Exif images for existing images
ar: رُقعة لفرز الصور في عرض الصور المصغرة، وقراءة معلومات الوقت من صور Exif للصور الموجودة

source: Clytie Siddall
ar: كليتي سيدال

source: Tremendous help with the English text in the application.
ar: مساعدة كبيرة في النص الإنجليزي في التطبيق.
lv: Milzīga palīdzība ar angļu valodas tekstu programmā.

source: Will Stephenson
ar: ويل ستيفنسون

source: Developing an Icon for KPhotoAlbum
ar: تطوير أيقونة لـ دفتر الصور
lv: „KPhotoAlbum“ ikonas izstrāde

source: Marcel Wiesweg
ar: مارسيل فيزفيغ

source: Patch which speeds up loading of thumbnails, preview in image property dialog.
ar: رُقعة تُسرّع تحميل الصور المصغرة، ومعاينة في حوار خصائص الصورة.
lv: Ielāps, kas paātrina sīktēlu ielādi, priekšskatījums attēlu īpašību lodziņā.

# @title:window
source: Automatically Stack Images
ar: كدّس الصور آليًا
lv: Automātiski grēdot attēlus

source: Stack images with identical MD5 sum
ar: كدّس الصور ذات مجموع MD5 المتطابق
lv: Grēdot attēlos ar identisku MD5 kontrolsummu

source: Stack images based on file version detection
ar: كدّس الصور بناءً على كشف إصدار الملف
lv: Grēdot attēlus par pamatu ņemot datnes versiju atrašanu

source: Original to top
ar: ضع الأصل في الأعلى
lv: Oriģinālu augšpusē

# Label for a QSpinbox that selects a number of seconds.
source: Stack images created within the following time-frame:
ar: كدّس الصور المنشأة ضمن الإطار الزمني التالي:
lv: Grēdot attēlus, kas ir izveidoti šādā laika nogrieznī:

# Unit suffix on a QSpinBox; note the space at the beginning.
source: seconds
ar: ثانية
lv: sekundēs

source: AutoStacking Options
ar: خيارات التكديس الآلي
lv: Automātiskās grēdošanas opcijas

source: Include matching image to appropriate stack (if one exists)
ar: أضف الصورة المطابقة إلى الكدس المناسب (إذا وُجد)
lv: Iekļauj atbilstošas grēdas atrašanu attēlam (ja tāda pastāv)

source: Unstack images from their current stack and create new one for the matches
ar: أزِل الصور من كدسها الحالي وأنشئ كدسًا جديدًا للمطابقات
lv: Noņemt atbilstošos attēlus no pašreizējās grēdas un pievienot jaunai

source: Skip images that are already in a stack
ar: تجاوز الصور الموجودة فعلًا في كدس
lv: Izlaist attēlus, kas jau atrodas grēdā

source: Show Category Editor
ar: اعرض محرر الأصناف
lv: Rādīt kategoriju redaktoru

source: Make Category Image
ar: اجعَلها صورة فئة
lv: Izveidot kategorijas attēlu

# @title:window
source: Copy image to ...
ar: انسخ صورة إلى ...
lv: Kopēt attēlu uz...

# @title:window
source: Link image to ...
ar: اربط الصورة بـ ...
lv: Saitēt attēlu uz...

# @title:window
source: Removing Items
ar: يزيل العناصر
lv: Noņem vienumus

source: Removing 1 item
ar: يزيل عنصر واحد
lv: Noņem %1 vienumu

source: Selected item will be removed from the database.<br/>What do you want to do with the file on disk?
ar: سَيُزال العنصر المحدد من قاعدة البيانات.<br/>ماذا تريد أن يُفعَل بالملف على القرص؟
lv: Atlasītais %1 vienums tiks noņemts no datubāzes.<br/>Ko vēlaties darīt ar datnēm diskā?

source: Move file to Trash
ar: انقل الملف إلى سلة المهملات
lv: Pārvietot %1 datni uz atkritni

source: Delete file from disk
ar: احذف ملفّ من قرص
lv: Dzēst %1 datni no diska

source: Only remove the item from database
ar: أزِل من قاعدة بيانات
lv: Šo %1 datni noņemt tikai no datubāzes

source: Merge these images
ar: ادمج هذه الصور
lv: Apvienot šos attēlus

source: Select image to keep:
ar: اختر الصورة التي ستُحفظ:
lv: Atlasiet attēlu, kuru paturēt:

# i for info
source: i
ar: م

source: <p>Below is a list of all images that are duplicate in your database.<br/>Select which you want merged, and which of the duplicates should be kept.<br/>The tag and description from the deleted images will be transferred to the kept image</p>
ar: <p>فيما يلي قائمة بجميع الصور المكررة في قاعدة البيانات الخاصة بك.<br/>اختر أيها تريد دمجها، وأي النسخ المكررة يجب أن تُحفظ.<br/>سَتُنقل الوسم والوصف من الصور المحذوفة إلى الصورة المحفوظة</p>
lv: <p>Tālāk ir norādīti visi attēli, kuri datubāzē atkārtojas.<br/>Atlasiet, kurus vēlaties apvienot un kuras attēlu versijas paturēt.<br/>Dzēsto attēlu birkas un apraksti tiks nodoti uz paturēto attēlu.</p>

source: Move to &trash
ar: انقل إلى ال&مهملات
lv: Pārvietot uz &atkritni

source: &Delete from disk
ar: ا&حذف من القرص
lv: &Dzēst no diska

source: &Block from database
ar: ا&منع من قاعدة البيانات
lv: &Izslēgt no datubāzes

source: Select &All
ar: حدّد ال&كلّ
lv: Atlasīt &visu

source: Select &None
ar: حدّد لا &شيء
lv: &Neatlasīt neko

source: %1 of %2 selected
ar: حُدد %1 من %2
lv: Atlasīts %1 no %2

source: No duplicates found
ar: لم تُعثَر على أي تكرارات
lv: Dublējošies vienumi nav atrasti

source: Current Item
ar: العنصر الحالي
lv: Pašreizējais vienums

source: All Selected Items
ar: كلّ العناصر المختارة
lv: Visi atlasītie vienumi

source: Copy and Open
ar: انسخ وافتح
lv: Kopēt un atvērt

source: Open With...
ar: افتح ب‍...
lv: Atvērt ar...

source: Your Command Line
ar: سطر أوامرك
lv: Jūsu komandrinda

source: Invoke External Program
ar: منادات برنامج خارجي
lv: Palaist ārēju programmu

# @title:window
source: Feature Status
ar: حالة الميزة
lv: Iespējas statuss

source: <h1>Overview</h1><p>Optional features in KPhotoAlbum:</p>%1
ar: <h1>نظرة عامة</h1><p>الميزات الاختيارية في دفتر الصور:</p>%1
lv: <h1>Pārskats</h1><p>„KPhotoAlbum“ izvēles iespējas:</p>%1

source: <h1>Build time features</h1><p>Build time features are optional features that need to be enabled when building KPhotoAlbum.</p><p>If you built KPhotoAlbum yourself, please check the <a href="https://community.kde.org/KPhotoAlbum/build_instructions">build instructions</a> if you missed something. If you need help compiling KPhotoAlbum, feel free to ask on the <a href="https://mail.kde.org/cgi-bin/mailman/listinfo/kphotoalbum">KPhotoAlbum mailing list</a> for help.</p><p>If you installed KPhotoAlbum from the package manager or an app store, you can file a bug report with the supplier of the package.</>
ar: <h1>ميزات وقت البناء</h1><p>ميزات وقت البناء هي ميزات اختيارية تحتاج إلى تمكين عند بناء دفتر الصور.</p><p>إذا بنيت دفتر الصور بنفسك، فتحقق من <a href="https://community.kde.org/KPhotoAlbum/build_instructions">تعليمات البناء</a> إذا فاتك شيء. إذا كنت بحاجة إلى مساعدة في ترجمة دفتر الصور، فلا تتردد في طلب المساعدة على <a href="https://mail.kde.org/cgi-bin/mailman/listinfo/kphotoalbum">قائمة بريد دفتر الصور</a>.</p><p>إذا ثبّت دفتر الصور من مدير الحزم أو متجر التطبيقات، يمكنك تقديم تقرير خطأ إلى مورد الحزمة.</p>
lv: <h1>Būvējuma laika iespējas</h1><p>Būvējuma laika iespējas ir izvēles iespējas, kuras iespējams ieslēgt brīdī, kad būvējat „KPhotoAlbum“.</p><p>Ja „KPhotoAlbum“ būvējat pats un kaut kā trūkst, apskatiet <a href="https://community.kde.org/KPhotoAlbum/build_instructions">būvēšanas norādījumus</a>. Ja ir nepieciešama palīdzība ar „KPhotoAlbum“ kompilēšanu, lūdziet palīdzību <a href="https://mail.kde.org/cgi-bin/mailman/listinfo/kphotoalbum">„KPhotoAlbum“ adresātu sarakstā</a>.</p><p>Ja instalējāt „KPhotoAlbum“ no pakotņu pārvaldnieka vai lietotņu veikala, varat pakotnes piegādātājam iesniegt kļūdas ziņojumu.</>

source: <h2><a name="purpose">Purpose plugin support</a></h2><p>KPhotoAlbum supports the <em>Purpose</em> plugin system which is part of KDE Frameworks.</p>
ar: <h2><a name="purpose">إتاحة ملحقة Purpose</a></h2><p> يتيح دفتر الصور ملحقة النظام <em>Purpose</em> التي هي جزء من أطر عمل كيدي.</p>
lv: <h2><a name="purpose">„Purpose“ spraudņa atbalsts</a></h2><p>„KPhotoAlbum“ atbalsta <em>Purpose</em> spraudņu sistēmu, kas ir daļa no KDE Satvara.</p>

source: <h2><a name="geomap">Map view for geotagged images</a></h2><p>If KPhotoAlbum has been built with support for Marble, KPhotoAlbum can show images with GPS information on a map.</p>
ar: <h2><a name="geomap">عرض الخريطة للصور ذات الوسم الجغرافي</a></h2><p>إذا بُني دفتر الصور مع إتاحة ماربل، فيمكن لدفتر الصور عرض الصور ذات معلومات GPS على خريطة.</p>
lv: <h2><a name="geomap">Kartes skats attēliem ar uzņemšanas vietas informāciju</a></h2><p>Ja „KPhotoAlbum“ ir būvētas ar „Marble“ atbalstu, „KPhotoAlbum“ varēsiet redzēt karti ar attēliem un GPS informāciju.</p>

source: <h1>Run time features</h1><p>Run time features are optional features that depend on another package or program being available during runtime. I.e. you can enable these features by installing the right package.</p>
ar: <h1>ميزات وقت التشغيل</h1><p>ميزات وقت التشغيل هي ميزات اختيارية تعتمد على توفر حزمة أو برنامج آخر أثناء وقت التشغيل. أي يمكنك تمكين هذه الميزات عن طريق تثبيت الحزمة المناسبة.</p>
lv: <h1>Palaišanas laika iespējas</h1><p>Palaišanas laika iespējas ir izvēles iespējas, kuru pieejamība ir atkarīga no citas pakotnes vai programmas pieejamības programmas darbināšanas laikā. Proti, šīs iespējas varat ieslēgt, ieinstalējot attiecīgo pakotni.</p>

source: <h2><a name="database">SQLite database support</a></h2><p>KPhotoAlbum allows you to search using a certain number of Exif tags.</p><p>This feature is only available if the Qt SQLite driver is installed. On Debian-based distributions this package is usually called libqt6sql6-sqlite.</p>
ar: <h2><a name="database">دعم قاعدة بيانات SQLite</a></h2><p>يسمح لك دفتر العناوين بالبحث باستخدام عدد معين من وسوم Exif.</p><p>هذه الميزة متاحة فقط إذا كان برنامج تشغيل Qt SQLite مثبتًا. في التوزيعات القائمة على Debian، تُسمى هذه الحزمة عادةً libqt6sql6-sqlite.</p>
lv: <h2><a name="database">„SQLite“ datubāzes atbalsts</a></h2><p>„KPhotoAlbum“ ļauj meklēt pēc noteikta skaita „Exif“ birkām.</p><p>Šī iespēja ir pieejama tikai tad, ja ir instalēts „Qt“ „SQLite“ draiveris. „Debian“ saimes operētājsistēmās šo pakotni parasti sauc „libqt6sql6-sqlite“.</p>
